[
  {
    "timestamp": 1715782089197,
    "commText": "<p><b>Gujarat Titans</b> Squad: Shubman Gill(c), Sai Sudharsan, David Miller, Shahrukh Khan, Matthew Wade(w), Rahul Tewatia, Rashid Khan, Noor Ahmad, Umesh Yadav, Mohit Sharma, Kartik Tyagi, Sandeep Warrier, Abhinav Manohar, Sharath BR, Darshan Nalkande, Jayant Yadav, Wriddhiman Saha, Kane Williamson, Vijay Shankar, Joshua Little, Ravisrinivasan Sai Kishore, Spencer Johnson, Azmatullah Omarzai, Manav Suthar, Gurnoor Brar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715782214035,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Abhishek Sharma, Travis Head, Nitish Reddy, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Sanvir Singh, Pat Cummins(c), Bhuvneshwar Kumar, Jaydev Unadkat, Vijayakanth Viyaskanth, T Natarajan, Umran Malik, Mayank Agarwal, Glenn Phillips, Washington Sundar, Rahul Tripathi, Aiden Markram, Anmolpreet Singh, Upendra Yadav, Mayank Markande, Jhatavedh Subramanyan, Fazalhaq Farooqi, Marco Jansen, Akash Maharaj Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715782215766,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715782215776,
    "commText": "<p><b>Preview</b> by <b>Gokul Gopal</b> \\n \\nA seven-day break in a busy schedule like the IPL is a luxury for teams, and Sunrisers Hyderabad are one of only two sides to enjoy that in this edition. \"Yeah, it is a bonus to have a week's break in an IPL tournament; I've been involved with SRH for just over a decade now and I think there's never been a break like that before,\" says Sunrisers' assistant coach Simon Helmot. \"It's nice to refresh...nice to have the time to catch up with friends and family.\" \\n \\nThe last time they took the field was on May 8 when openers Travis Head and Abhishek Sharma put on a brutal display of batting, getting to 167/0 in just 9.4 overs to race to victory against Lucknow Super Giants which gave their net run rate a mighty boost. That victory eliminated Mumbai Indians from the playoffs race and during SRH's break, two more teams joined MI. Meanwhile, KKR and RR qualified and the former also cemented a spot in the top-two. SRH too have a shot at featuring in Qualifier 1, for which they need to win the next two matches and hope that Rajasthan Royals drop one, which will bring NRR into play. \\n \\nCan SRH get back to their aggressive best after the seven-day non-action? \"I don't think it changes momentum,\" insists Helmot. We've had some five-day breaks throughout the tournament, we're used to having breaks, so I don't think that'll change anyway in which we prepare.\" \\n \\nAnd speaking about aggression, such has been SRH's blaze in this edition that Hyderabad has seen sell-out crowds, which wasn't the case in the past seasons. \"We remember the first years here at SRH when we were developing a fan base. There may have been some space in the crowd, there may have even been times when there was some support for the opposition as well. But hasn't that changed?...I'll say this year has been the most vocal, the nosiest, and the most supporting crowd that I can ever remember,\" says Helmot, who calls the crowd their \"13th impact player\". And SRH will be eager to reciprocate that support with another victory which will confirm a berth for them in the playoffs. \\n \\nTheir opponents are Gujarat Titans, who just got knocked out from the playoffs race after rain played spoilsport in Ahmedabad. In what has been a lacklustre season for them, the Shubman Gill-led side will be hoping to sign off on a positive note and in the process disrupt the aspirations of the home side. Before the abandoned game, the Titans posted 231 against Chennai Super Kings, riding on Gill and Sai Sudharsan's hundreds to register their second highest total in the IPL. They need their batters to deliver again but, more than that, they need the bowlers to be on the mark going up against the bulldozing SRH batters who don't show the opposition any mercy. \\n \\nAfter being expensive in his earlier outings, Mohit Sharma redeemed himself with a match-winning 3 for 31 against CSK. The Titans will be hoping for more of that from him and also count on former SRH player Rashid Khan's experience in these climes. The Titans have also struggled with their middle order, using as many as 11 players from Nos. 4 to 7 this season for only two fifty-plus scores this season, and the lowest average among all teams. Although late, they'll be keen to make amends and end their campaign with some consolation. \\n \\n<b>When:</b> SRH vs GT, Match 66 - Thursday, May 16 at 19:30 IST \\n \\n<b>Where:</b> Rajiv Gandhi International Stadium, Hyderabad \\n \\n<b>What to expect:</b> It was at this venue that SRH decimated LSG by 10 wickets, having set the tone for their journey here with a total of 277 against MI back in March. They have four wins out of five at home this season, with their only loss coming against Royal Challengers Bengaluru when they couldn't chase down a target of 207, with the combination of change of pace and spin working well for the visiting side on a slow surface. \\n \\n<b>Head to head:</b> SRH 1 - 3 GT. Sunrisers have lost three matches in a row against the Titans but this will be the first time the teams will face each other in Hyderabad. \\n \\n<b>Teams watch</b> \\n \\n<b>Sunrisers Hyderabad</b> \\n \\n<b>Injury/Availability:</b> Sunrisers do not have any fitness concerns in their setup \\n \\n<b>Tactics & Matchups:</b> Bhuvneshwar Kumar has dismissed Gill three times in 56 deliveries and has conceded only 57 runs, which makes him a favourable matchup for SRH up against the GT skipper. Gill has also been dismissed four times by right-arm legspin in this IPL, which makes Vijayakanth Viyaskanth a good option against him. T Natarajan is a useful option against left-handers, having bagged seven southpaw wickets (at a strike rate of 12 an economy of 8.79) out of his tally of 15 this season. \\n \\n<b>Probable XI:</b> Abhishek Sharma, Travis Head, Nitish Reddy, Heinrich Klaasen (wk), Abdul Samad, Shahbaz Ahmed, Sanvir Singh, Pat Cummins (c), Bhuvneshwar Kumar, Jaydev Unadkat, Vijayakanth Viyaskanth. [Impact sub: T Natarajan]. \\n \\n<b>Gujarat Titans</b> \\n \\n<b>Injury/Availability:</b> Wriddhiman Saha had a niggle which kept him out of the game against CSK, with GT bringing in Matthew Wade and handing Kartik Tyagi a GT debut. They could look at sticking to this combination considering Saha, even if he has recovered, hasn't been in the best of form with the bat. \\n \\n<b>Tactics & Matchups:</b> In his last five matches, Heinrich Klaasen has been dismissed by spinners three times while Travis Head has been dismissed by spin five times, bringing Rashid and Noor Ahmad into the picture. \\n \\n<b>Probable XI:</b> Shubman Gill (c), Sai Sudharsan, Shahrukh Khan, David Miller, Matthew Wade (wk), Rahul Tewatia, Rashid Khan, Noor Ahmad, Umesh Yadav, Mohit Sharma, Kartik Tyagi. [Impact sub: Sandeep Warrier]. \\n \\n<b>Did you know?</b> \\n \\n- Out of the 583 runs he has scored in this season so far, Travis Head has got 385 runs (66.03%) in the powerplay alone. He averages 128.33 in this phase with a strike rate of 220. His opening partner Abhishek Sharma has scored 285 (71.07%) of his tally of 401 runs in the powerplay, at a strike rate of 205.04 \\n \\n- Sunrisers have struck the most maximums in this IPL, scoring 146 sixes, while their 171 fours is the least among all teams in this edition. Abhishek Sharma tops the sixes chart (35) and along with Travis Head and Heinrich Klaasen, they have struck 97 sixes combined \\n \\n<b>What they said</b> \\n \\n\"It was a little bit challenging the first time we played against Gujarat on their wicket. Again, it's just to remind ourselves not every wicket is going to be 200-plus. We need to assess in real time how it's going and communicate with each other, and remember that we're working in a partnership. That has been the learning we got after that game. We've been 11 games on since then (nine), we just need to make sure to maintain our strategy and execute as best we can\" - <b>Simon Helmot</b>, SRH assistant coach, reflects on the loss to GT earlier in the competition. \\n \\n\"It's never easy. Some of our key players got injured before the season, and in the season as well we've had some injuries. It's not easy for the players coming in to be able to perform straightaway. But apart from that I think it was just a matter of one match, here and there. The match against Delhi which we lost by one run, a match like that could go either way. I think in the first couple of years a lot of matches like that went in our favour. At the end of the day the margin is very close, so it's hard to identify or pinpoint a moment or a particular area. But I think collectively as a fielding unit we let ourselves down in some of the key moments\" - <b>Shubman Gill</b>, GT captain, sums up the season.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715782215796,
    "commText": "<p><b>18:30 Local Time, 13:00 GMT:</b> We are five games away from finishing the league stage and there are still two playoff spots up for grabs. Today's game will have a lot of viewers as the result will determine the fate of some of the other teams. Hello and welcome to match 66.. A win today for the Sunrisers Hyderabad and they become the third team to book a spot in the top four. A loss will keep the likes of Delhi Capitals, Lucknow Super Giants and Royal Challengers Bengaluru in the hunt. So a lot at stake and that is not something new for skipper Pat Cummins. He has led this team brilliantly and hence they have their future in their own hands. The openers - Head and Abhishek - have been a revelation, Klaasen has stamped his mark as the spin basher and Nitish Reddy is the find of the season. The bowling too looks more penetrative with the return to form of Bhuvneshwar Kumar. What's more the Sunrisers are playing at home and will have their Orange Army behind them as they look to seal the playoff spot.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715782215806,
    "commText": "<p>Gujarat Titans have had a forgettable campaign. After winning the tournament in their first year and finishing runner's up last season, they have not lived up to their potential. Shubman Gill as captain has been under pressure and that has shown in his batting as he's not been able to replicate the performances he put up last year. There's over-reliance on him and Sai Sudharsan to deliver each time with the bat as the rest have struggled for consistency. Rashid Khan, coming back from an injury, has looked a shadow of his old self and that has played a big part to where the Titans are on the points table. There has been a lot of chopping and changing as they couldn't find the right combination. But they did beat CSK a couple of games back while their previous game against KKR was abandoned, today gives them a chance to finish their season on a high.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715864519478,
    "commText": "<p><b>18:32 Local Time, 13:02 GMT:</b> \"A thunderstorm started around 3:45 and went on till about 5 before reducing to a drizzle. It has now stopped raining and the groundsmen are busy draining the water from the covers. Supersoppers in action too.\" - this was an update just over 30 minutes ago from I0$ who's at the ground. He followed it up with - \"Plenty of work to be done, though. Lots of puddles near the boundary ropes, with those areas left uncovered.\" And the latest news being \"The tyres placed on the covers are coming off now.\"</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715865318371,
    "commText": "<p><b>18:45 Local Time, 13:15 GMT:</b> \"The covers are coming off now. And there are loud cheers each time a cover is being removed\" - pings Gokul.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715865761292,
    "commText": "<p><b>18:52 Local Time, 13:22 GMT:</b> Oh no! \"It's not raining right now but they are bringing the covers back on. Slight dark clouds above the ground, which could be the reason.\" - updates Gokul. The toss will definitely be delayed now.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715866264060,
    "commText": "<p><b>19:00 Local Time, 13:30 GMT:</b> The two captains are out in the middle but not in their playing jerseys. They are in their training gear and have been summoned by the match referee, he's having a word with them and it ends with Cummins giving the thumbs up. Gill and Cummins continue to have a chat.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715867080408,
    "commText": "<p><b>19:15 Local Time, 13:45 GMT:</b> \"Covers are coming off again\" - pings Gokul. Live pictures also show the same and the super soppers are working away. Hopefully this is the last we mention about covers tonight. Fingers crossed.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715867623690,
    "commText": "<p><b>19:23 Local Time, 13:53 GMT:</b> \"They are removing the centre covers now. And the hessian is coming off too\" - updates Gokul. Things are looking pretty good. The stands are filling up and people are waiting patiently for the action to begin.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715868575500,
    "commText": "<p><b>19:40 Local Time, 14:10 GMT:</b> \"The pitch is being rolled now and Cummins and Vettori are beside the wicket having a close look and chatting. The stumps are going in, the camera is being set up pitch side for the toss coverage, and we should be having the toss soon as well. We'll lose some overs if the match starts after 8:30. But will be a full game if it gets underway before that.\" - informs Gokul. \"From the scheduled start time there is a one-hour allowance for a full game,\" he adds.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715868901915,
    "commText": "<p><b>19:45 Local Time, 14:15 GMT:</b> We have great news. Toss is at <b>20:00 local</b> and the game will start at <b>20:15 local</b> which means we should get a full 20-over game. Hang on! \"The covers are being brought on for some reason. They are bringing back the hessians. Pitch is being covered.\" - pings Gokul. \"No rain though,\" he adds.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715869349109,
    "commText": "<p><b>19:52 Local Time, 14:22 GMT:</b> Oops, the drizzle is back and so are the covers. We're looking at another delay for the toss.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715870437254,
    "commText": "<p><b>20:10 Local Time, 14:40 GMT:</b> \"It's that irritating sort of rain now. Not too heavy but steady enough to keep the covers in place,\" pings Gokul from the venue. We're looking at reduced overs if the game doesn't start by 8:30 PM. <b>Just in case this is a washout, SRH will qualify for the playoffs today itself.</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715871649340,
    "commText": "<p><b>20:30 Local Time, 15:00 GMT:</b> Still raining, still a steady downpour. We've officially started losing overs as well. Hang on, folks! This could be a long night.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715873443054,
    "commText": "<p><b>21:00 Local Time, 15:30 GMT:</b> \"Still raining, in case you wanted to check for an update.\" - pings Gokul. The cut-off time to start a 5-over game is <b>22:30 local</b>. So the rain needs to stop soon because the groundstaff will need time to get the conditions ready for play. Meanwhile, the fans at the venue are being entertained with a lighting show.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715875016726,
    "commText": "<p><b>21:26 Local Time, 15:56 GMT:</b> Still raining in Hyderabad and my colleague Gokul took that opportunity to treat himself to a lovely Mutton Biryani. The Mutton Biryani was amazing, he pings. So if you're ever close to Uppal Stadium, do try it. Sadly, we can only give y'all culinary tips tonight, since cricket is very far away on the menu.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715876519574,
    "commText": "<p><b>21:52 Local Time, 16:22 GMT:</b> Still no signs of the rain easing and it is increasingly likely that the game would be called off now. <b>Still no official confirmation.</b> For now, we wait.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715877180907,
    "commText": "<p><b>22:03 Local Time, 16:33 GMT:</b> Live visuals from the ground suggest the covers are fully drenched with water, and the drizzle continues. Just a question of when and not if this match will be called-off.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715877180917,
    "commText": "<p><b>With this result:</b> \\nSRH’s playoffs spot is now confirmed, DC eliminated. \\nRCB-CSK will now be a knockout with the hosts needing to win by 18 runs or within 18.1 overs (assuming a first innings score of 200). \\nA win against KKR will confirm RR’s second finish. \\nSRH will finish second if they beat PBKS and KKR beat RR after that (both games are on Sunday). \\nCSK can finish second if they beat RCB and RR and SRH lose their respective games.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1715877658502,
    "commText": "<p><b>22:11 Local Time, 16:41 GMT:</b> Umpires call the captains and they are shaking hands now. It's official, <b>Match 66 has been called off without a ball being bowled.</b> First time in 76 IPL games that a match in Hyderabad has been called off. <b>SRH qualify for the playoffs</b>, but this washout means a top two finish is no longer in their hands. They’d need to beat Punjab on Sunday, and hope that Rajasthan lose their final group game. For Gujarat Titans, it has been a case of chasing stormy clouds. They’ve now had back-to-back games called off due to rain. That’s also the end of the road for them as this was their last group game. Time to bid farewell from this gloomy evening. Hopefully we get brighter skies tomorrow in the IPL. Ta da!</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]