[
  {
    "timestamp": 1714747748091,
    "commText": "<p><b>Royal Challengers Bengaluru</b> Squad: Virat Kohli, Faf du Plessis(c), Will Jacks, Rajat Patidar, Glenn Maxwell, Cameron Green, Dinesh Karthik(w), Swapnil Singh, Karn Sharma, Mohammed Siraj, Yash Dayal, Anuj Rawat, Mahipal Lomror, Himanshu Sharma, Akash Deep, Vijaykumar Vyshak, Reece Topley, Tom Curran, Lockie Ferguson, Mayank Dagar, Alzarri Joseph, Suyash Prabhudessai, Manoj Bhandage, Saurav Chauhan, Rajan Kumar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714747855924,
    "commText": "<p><b>Gujarat Titans</b> Squad: Wriddhiman Saha(w), Shubman Gill(c), Sai Sudharsan, David Miller, Azmatullah Omarzai, Rahul Tewatia, Shahrukh Khan, Rashid Khan, Ravisrinivasan Sai Kishore, Noor Ahmad, Mohit Sharma, Sandeep Warrier, Sharath BR, Vijay Shankar, Manav Suthar, Darshan Nalkande, Matthew Wade, Umesh Yadav, Kane Williamson, Jayant Yadav, Abhinav Manohar, Joshua Little, Kartik Tyagi, Spencer Johnson, Sushant Mishra</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714747857020,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714747857030,
    "commText": "<p><b>Preview</b> by <b>Kaushik Rangarajan</b> \\n \\nA lot can change in a short time in the IPL. This time last year, Royal Challengers Bengaluru and Gujarat Titans squared off at the Chinnaswamy Stadium under very different circumstances. The Titans were toppers and already in the playoffs. RCB were a win away from making it four straight years in the final-four, their fate very much at home, which as it turned out was not the best place it could be. \\n \\nSnap to the present and Saturday's contest is one between teams placed eighth and tenth. While the qualification flame hasn't been doused for either team, progress from here is now a function of several variables, including form. In that regard, RCB are slightly better placed with two wins on the bounce and a clearer game plan involving front-loading their overseas batters/all-rounders. A third straight win and a double over the Titans will lift Faf du Plessis' side from the points-table floor, where they've spent the majority of this season. \\n \\nGujarat, on the other hand, seek an upturn at the top. They are the slowest scoring team in the PowerPlays, but also don't lose many wickets which means they haven't effectively maximised the batting depth with Rashid Khan bating at No.8. The end of this fixture last year was viewed in some quarters as a seminal changing of the guard in Indian cricket when Shubman Gill responded to a Virat Kohli 100 with a ton of his own. A year on, there's no place for the Titans skipper in a World Cup squad with the old guard proving to be resilient. \\n \\nGill's 19-ball 16 in last Sunday's clash between these sides in Ahmedabad felt like a particular low point in a middling season for the star batter-captain, the downturn mirroring that of his franchise. The team management, however, firmly remains in his corner and believes that captaincy will eventually get the best out of him. Interestingly, his tally of 320 so far is only 55 runs short of where he was at, at this stage in his stellar IPL 2023 campaign. Form, like weather, can be fickle. And as Bengaluru has shown in the last two days, a lot can change in a short time. \\n \\n<b>When: </b>Royal Challengers Bengaluru vs Gujarat Titans, IPL 2024, May 4, 19.30 IST \\n \\n<b>Where: </b>M. Chinnaswamy Stadium, Bengaluru \\n \\n<b>What to expect: </b>It's been nearly 20 days since SRH and RCB plundered 549 runs in the last game here. After a string of games with slightly lower scores, the 'refreshed' Chinnaswamy Stadium pitch could signal a return to IPL 2024 norm. After months of scorching summer heat, Bengaluru rejoiced in the gloom of the last two days. There is no forecast of a rain-enforced interruption on match day. \\n \\n<b>Head to Head: </b>RCB 2-2 GT. The Royal Challengers comprehensively chased down 200 with four overs to spare in last week's reverse fixture in Ahmedabad. All four games between these sides have been won by the chasing team. \\n \\n<b>Team Watch:</b> \\n \\n<b>Royal Challengers Bengaluru</b> \\n \\n<b>Injuries/Availability: </b>Glenn Maxwell returned from his break in the previous fixture and remains available for selection. \\n \\n<b>Tactics & Matchups:</b> \\n \\nMohammmed Siraj has dismissed David Miller twice and conceded just 10 runs from the 14 balls bowled at the left-hander. They are likely to face off in the death overs, where the RCB man currently holds the edge over the destructive Titans finisher. \\n \\nRCB are likely to continue using an all-Indian bowling attack and play both their overseas all-rounders. Vijaykumar Vyshak, who has bowled well on his home ground, could come in as the impact substitute and provide additional bowling cushion. \\n \\n<b>Probable XI: </b>Virat Kohli, Faf du Plessis (c), Will Jacks, Rajat Patidar, Glenn Maxwell, Cameron Green, Dinesh Karthik (wk), Swapnil Singh, Karn Sharma, Mohammed Siraj, Yash Dayal [Impact Subs: Mahipal Lomror/Vijaykumar Vyshak] \\n \\n<b>Gujarat Titans</b> \\n \\n<b>Injuries/Availability:</b> \\n \\n<b>Tactics & Matchups: </b>Spencer Johnson's left-arm angle can be a useful proposition against a right-heavy RCB top-order. He can also be used to counter the back-in-form Rajat Patidar, who is striking spin at 225 compared to a measly 127.12 against the faster bowlers. The quicks have also dismissed Patidar six times in seven innings, with left-armers accounting for two of those dismissals. \\n \\nWriddhiman Saha had a long net session on the eve of the match but one possible tweak for GT could involve swapping out the veteran 'keeper for Matthew Wade. If GT consider such a move, they could bench the overseas all-rounder Omarzai for Vijay Shankar, who had a great game here in 2023. Given GT are adequately stocked in the spin department, they could also look to swap their third spinner, Noor Ahmad, for Johnson in keeping with teams' preferring for pace (31 wickets at 10.47 ER) over spin (11 wickets at 9.25 ER) at this venue. \\n \\n<b>Probable XI: </b>Shubman Gill (c), Wriddhiman Saha/Matthew Wade (wk), Sai Sudharsan, Azmatullah Omarzai/Vijay Shankar, Shahrukh Khan, David Miller, Rahul Tewatia, Rashid Khan, R. Sai Kishore, Sandeep Warrier, Noor Ahmad/Spencer Johnson, Mohit Sharma [Impact Sub: Darshan Nalkande] \\n \\n<b>Did you know? </b> \\n \\n- In four games against GT, Virat Kohli has scored 58(53), 73(53), 101*(61) and 70*(44) \\n \\n- Since his debut in 2021, no batter scores faster against wrist spin than Rajat Patidar (SR: 219) \\n \\n- Rashid Khan has only 8 wickets after 10 games, his lowest tally in the IPL at this stage. Last year, he had 18 at this stage. \\n \\n<b>What they said:</b> \\n \\n\"It's definitely something I'm adapting to. I started doing it in November last year in the Caribbean for England. It's obviously different. The hardest thing I found is coming in outside the PowerPlay. You get a few to have a look at, you get a few easy boundaries and get yourself rolling. But outside the PowerPlay, you have to make the play yourself and it's harder to be 17-18 off 10 balls. So I think it's more of a mental thing... It's about what I can do best to help the team's chances from this position. It's something I'm getting better at.\" - Will Jacks, on his role at No.3 after predominantly playing as an opener in other competitions.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714827374456,
    "commText": "<p><b>18:30 Local Time, 13:00 GMT, 18:30 IST:</b> A fantastic century by Will Jacks and a solid knock by Virat Kohli helped the Challengers thump Gujarat Titans by 9 wickets in Ahmedabad. It’s time for the reverse fixture as the venue changes from the Narendra Modi Stadium to the Chinnaswamy in Bangalore. Despite an emphatic victory against Gujarat, RCB are still placed last in the points table. The Titans haven’t had a great season either as their captain - Shubman Gill hasn’t lived up to his expectations with the bat. Making it to the playoffs looks like a distant dream for both the teams, all they can do is play for their pride. Something for their fans to cheer about. What does the Chinnaswamy have in store for us tonight? A high-scoring contest or a low-scoring thriller? We shall find out soon. Stay around for the toss and teams</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714828341887,
    "commText": "<p><b>Sai Kishore:</b> The messaging was pretty clear - just to play well and compete well. When we play to our best, we give ourselves the best chance to win. As bowlers there are very few things you can control. If you can land the ball in the right area with the right of release, that’s all you can control. As a bowler, you want the ball in all phases of the game. Whenever there is pressure, you want to make an impact. Happy to take up the pressure wherever needed. There is very good skill levels in the group. More than skill, it’s the mental toughness that takes you through. Hope that we bounce back and play to our best potential.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714828417225,
    "commText": "<p><b>Pitch and ground dimensions:</b> 57m and 64m square boundaries respectively, 69m down the ground. It's extremely hard, not a lot of grass. It will getting good for batting, reckons <b>Hayden.</b> Can trust the bounce. The boundaries are really small, it can be a high-scoring contest.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829165999,
    "commText": "<p>I0$ informs <b>Kaushik Rangarajan</b> from the Chinnaswamy..</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829310446,
    "commText": "<p>Right then, the two captains are out in the middle and it's <b>toss time..</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829383706,
    "commText": "<p><b>Royal Challengers Bengaluru have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829456966,
    "commText": "<p><b>Faf du Plessis:</b> We are going to chase. The conversations (among the players) have been good. To make that shift from the beginning, that's pleasing. From a batting perspective we have found our mojo. The guys can come in and bat freely. Same team.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829549525,
    "commText": "<p><b>Shubman Gill:</b> The talk is to win four in four. It's important to turn up and deliver our best. I feel our fielding has let us down. We have had a chat about it. We need to be a better team as a fielding unit. IPL is such a long tournament. It's important to turn up on the day. We have two changes, <b>Manav Suthar</b> makes his debut and Josh Little comes in.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829734767,
    "commText": "<p><b>Gujarat Titans</b> (Playing XI): Wriddhiman Saha(w), Shubman Gill(c), Sai Sudharsan, David Miller, Shahrukh Khan, Rahul Tewatia, Rashid Khan, Manav Suthar, Noor Ahmad, Mohit Sharma, Joshua Little</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829862364,
    "commText": "<p><b>Royal Challengers Bengaluru</b> (Playing XI): Virat Kohli, Faf du Plessis(c), Will Jacks, Glenn Maxwell, Cameron Green, Dinesh Karthik(w), Karn Sharma, Swapnil Singh, Mohammed Siraj, Yash Dayal, Vijaykumar Vyshak</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829865412,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829870162,
    "commText": "<p><b>Gujarat Titans Impact Subs:</b> Sandeep Warrier, Sharath BR, Darshan Nalkande, Vijay Shankar, Jayant Yadav</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829886530,
    "commText": "<p><b>Royal Challengers Bengaluru Impact Subs: </b>Anuj Rawat, Mahipal Lomror, Akash Deep, Rajat Patidar, Suyash Prabhudessai</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829896679,
    "commText": "<p>We have made a couple of changes in our Fantasy Handbook. Do check out the updated Expert XI before locking your teams...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829896689,
    "commText": "<p><b>Glenn Maxwell:</b> I probably needed a bit of time to get my body right, wasn't batting as well as I would have liked, results weren't going my way. Had some time to reflect and refresh, spend a bit more time with the family, wasn't putting as much onus on the training time but more the stuff I was doing in the gym, in the physical side and the mental side of the game. Really good place at the moment. Got the family over here - mum and dad, wife and child who are still here supporting me which is great. Looking forward to having a little bit of success at the back end of this tournament. The hard thing about being on the road going from tournament to tournament is the adaptability that you have to have. It's a busy year but I am so grateful to have the support from them the whole way through. (Approach with the bat) Hopefully it's the same as the other night where I don't have to bat (chuckles), but I have been really confident with the stuff that I have been doing at training, I don't think that's changed too much. My mindset hasn't quite been as clear as it has been in the past and that can happen when you are striving for runs. You feel like you are in good form at the start of the tournament and you try too hard to get your innings going without worrying about the process at the start. Focusing on that, making sure that I am sticking to my strengths and sticking to what makes me a successful player.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714829896699,
    "commText": "<p><b>DYK,</b> The chasing side has won all four games between these two teams!</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1714831103828,
    "commText": "<p>The players are out in the middle and we are ready for live action. The two GT openers have been inconsistent this season. Will they be able to make the most out of the Chinnaswamy surface? Let's find out..</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]