[
  {
    "timestamp": 1712843865699,
    "commText": "<p>It's time for action at the Wankhede and the players are out in the middle. No change at the top of the order for RCB with Faf du Plessis and Virat Kohli striding out. MI are starting with spin and it's Mohammad Nabi</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712843280773,
    "commText": "<p>A settled team for Mumbai Indians with Suryakumar Yadav the most likely impact sub, plenty of changes for RCB and they've options in the bench when it comes to naming their impact sub. Confused over team selections for your fantasy XI? Head over to our expert XI for options</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712843039007,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842966133,
    "commText": "<p><b>Mumbai Indians Subs:</b> Suryakumar Yadav, Dewald Brevis, Naman Dhir, Nehal Wadhera, Harvik Desai</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842879920,
    "commText": "<p><b>Royal Challengers Bengaluru Subs:</b> Suyash Prabhudessai, Saurav Chauhan, Swapnil Singh, Rajan Kumar, Karn Sharma</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842669388,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842667359,
    "commText": "<p><b>Royal Challengers Bengaluru</b> (Playing XI): Virat Kohli, Faf du Plessis(c), Will Jacks, Rajat Patidar, Glenn Maxwell, Dinesh Karthik(w), Mahipal Lomror, Reece Topley, Vijaykumar Vyshak, Mohammed Siraj, Akash Deep</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842570660,
    "commText": "<p><b>Mumbai Indians</b> (Playing XI): Rohit Sharma, Ishan Kishan(w), Tilak Varma, Hardik Pandya(c), Tim David, Romario Shepherd, Mohammad Nabi, Shreyas Gopal, Jasprit Bumrah, Gerald Coetzee, Akash Madhwal</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842562013,
    "commText": "<p><b>Faf du Plessis</b> - We've tried to change things, so we've given chances to some of our players, some new players and it's up to them to take the opportunity. It's important to give players a decent run, but we've found ourselves in a stage where we haven't done well, so it's time to make changes. One thing that's important is to be consistent and that's where we've been disappointing. But we know we can turn this around. We would have fielded as well, chasing at this ground is the better option, but the pitch looks good. We've got three changes - Jacks debuts and he'll come in at 3, Mahipal and Vyshak are back.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842553365,
    "commText": "<p><b>Hardik Pandya </b>- We will bowl first. It looks like a similar track, but it might get better to bat on under lights. There was a bit of dew as well, so chasing could be a better option. The mood before and after the win was different, we'll need to start well, put the pressure and then take the game forward. We got the highest score without anyone getting to 50, that gives you plenty of confidence. Bowling well in the powerplay was crucial. One change - Shreyas Gopal comes in place of PC</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712842256052,
    "commText": "<p><b>Mumbai Indians have won the toss and have opted to field</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712841819279,
    "commText": "<p>Team News: <b>Will Jacks</b> is all set to make his RCB debut and he has been handed his maiden cap by Virat Kohli. Will he replace Green / Maxwell? Or will RCB go with four overseas batters? We should know it during the toss which ain't too far away</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712841029468,
    "commText": "<p>It's a red soil pitch as usual for today's game at the Wankhede. 65m and 59m square boundaries, the straight boundary is at 74m. So 200 could be a par score considering the dimensions. The pitch itself is an absolute belter, a batting paradise. It's been a high-scoring ground, both teams could go aggressive against the new ball in the powerplay. Not much spin, just a beautiful batting wicket. It's a no-brainer, the captain winning the toss would opt to bowl first, reckon <b>Sanjay Manjrekar and Michael Clarke</b>, in their pitch report</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712758967658,
    "commText": "<p><b>6:15 pm IST</b>: It's one of the most awaited clashes in the history of the Indian Premier League, but this season's first meeting between the two teams already has signs of 'desperation' attached to it. Mumbai Indians have one win from four games, the Royal Challengers are even worse with one win from five games. In a league consisting of 14 matches each, the chances of a playoff slot hasn't slipped away completely, but both teams will have to start winning and they'll have to start from tonight. Mumbai Indians snapped their 3-match losing streak and they did so in some fine fashion, smashing the headlights out of the Capitals bowers and then doing enough to ensure victory with the ball. On the other hand, RCB come on the back of 3 successive losses (2 at home) and will have to think out of the box if they're to stay in contention for a playoff berth. Desperate times call for desperate measures - will RCB be brave enough to pick players on form rather than past performances? Will they re-jig their batting order to suit the modern day T20 style? Can Mumbai Indians continue to flourish and secure back-to-back wins?</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712758967638,
    "commText": "<p><b>Preview by Vijay Tagore</b> \\n \\nDiscussing online with Michael Vaughan, Adam Gilchrist had a point to make about Royal Challengers Bengaluru (RCB) the other day. After Virat Kohli, who tops the RCB and IPL and batting charts with 7579 runs, the second highest Indian scorer for the franchise is Rahul Dravid with 898 runs. Dinesh Karithik is the second among the current lot with 701 runs. \\n \\nGilchrist's observation may be spot-on. Dravid left RCB in 2010, leaving a void in the team's batting lineup that has yet to be adequately filled. No wonder then that RCB have been chronic underperformers in the Indian Premier League, a fact that is reflected in the millions of sarcastic and satirical memes on social media. \\n \\n\"An interesting point,\" said Reece Topley, the RCB bowler from England on the eve of the team's game against Mumbai Indians at the Wankhede. \"... because that probably spans different eras and, you know, Mo (Bobat, director of cricket) and Andy (Flower, head coach) weren't in charge of the side. Yeah, I mean, yeah, but you know, so it can be from my experience that I can't answer that, you know, I have not been around for 16 years.\" \\n \\nThe Englishman continued: \"That's probably something that's transcended many managements. And Virat's been consistent for RCB for a long time, which is amazing. And the loyalty that he's shown to the franchise and also the fans show to him is incredible. But I mean, that's a question on sort of history and we can only give answers personally for the last two years and more importantly for this season to get us to our goal.\" \\n \\nIf lack of runs from the Indian batters has been a problem historically, the batting crisis has worsened this year. Runs have come only from the bat of Kohli, who is the Orange Cap holder with 316 runs. Runs from elsewhere, particularly from the overseas batters, have dried out. Faf du Plessis with 109 runs in five games -- 35, 3, 8, 19 and 44 -- has not exactly fired at the top of the order and Glenn Maxwell has been a big flop with just 32 runs (0, 3, 28, 0 and 3). Even Cameron Green, the high-profile pre-season trabansfer has not paid dividends so far - mere 68 runs in five matches (18, 3 , 33, 9, 5*). \\n \\nNo wonder then that they are languishing in the bottom half of the table with just one win. Complicating the situation is the fact that they are at a venue and against an opposition where they don't have an impressive record - they trail 3-7 at the Wankhede. \"I wasn't aware of that. It's obviously a fresh opportunity tomorrow and I think it's always dangerous when things haven't been going so well. We need to put them under pressure and we'll be doing everything we can to do that,\" Topley said. \\n \\nMumbai Indians have found their bearings with a convincing win against Delhi Capitals a few days ago and will hope to continue with the momentum. Their problem has been captain's form, who has been unable to dominate the bowling the way he is otherwise known to. Just 23 runs in 15 balls in the death overs (between 16 and 20) with three dismissals is not a score he is happy about. He has got 108 runs in four games otherwise - (11, 24, 34 and 39). And Tim David said the team has had conversations about it. \\n \\n\"We've had conversations about how we played, because, to be honest, Hardik has been playing a really important job for our team. You look at the last match, we struggled really hard for momentum towards the back end and Hardik played really a perfect innings. That set the platform for myself and Romario (Shepherd) to go on with at the end. He got that. We got ourselves to a platform and he got that one ball that he could have hit for six. He hit it high on the bat, missed the middle, he's out, you know, so that's how the game goes,\" the Australian said. \\n \\n<b>When:</b> Mumbai Indians vsRoyal Challengers Bengaluru, IPL 2024, April 11, 19:30 IST \\n \\n<b>Where:</b> Wankhede Stadium, Mumbai \\n \\n<b>What to expect:</b> With small boundaries and a batting wicket, it should be a high-scoring contest. With high-profile and big hitters in both sides, one could see sixes raining down ceaselessly. With dew being a factor, captain winning the toss may choose to field. \\n \\n<b>Head to Head:</b> MI 18 - 14 RCB. RCB have dominated their Mumbai rivals since 2020, having won five of the seven contests. At the Wankhede, MI lead RCB 7-3. \\n \\n<b>Team Watch:</b> \\n \\n<b>Mumbai Indians</b> \\n \\n<b>Injury/Availability:</b> No injury concerns for MI \\n \\n<b>Tactics & Matchups:</b> Rohit Sharma will look to capitalise on the early overs from Mohammed Siraj, who has never dimissed the former MI captain in this tournament (53 balls | 68 runs). Rohit might also want to farm the strike against the quick, as Ishan Kishan tends to struggle against him (42 balls | 50 runs | 2 dismissals) \\n \\n<b>Probable XI:</b> Rohit Sharma, Ishan Kishan (wk), Suryakumar Yadav, Tilak Varma, Hardik Pandya (c), Tim David, Mohammad Nabi, Romario Shepherd, Piyush Chawla, Gerald Coetzee, Jasprit Bumrah [Impact Sub: Akash Madhwal] \\n \\n<b>Royal Challengers Bengaluru</b> \\n \\n<b>Injury/Availability:</b> RCB have no injury issues. \\n \\n<b>Tactics & Matchups:</b> Jasprit Bumrah has been on top of his game this season, but he has a more than able nemesis in Kohli, who has a strike rate of 152.17 against the MI pacer in the tournament. Fasten your seatbelts for an early feisty tussle between the two. \\n \\n<b>Probable XI:</b> Virat Kohli, Faf du Plessis (c), Rajat Patidar, Glenn Maxwell, Cameron Green, Dinesh Karthik (wk), Saurav Chauhan, Reece Topley, Mayank Dagar, Mohammed Siraj, Yash Dayal [Impact Sub: Mahipal Lomror or Akash Deep]. \\n \\n<b>Did You Know:</b> \\n \\n- Glenn Maxwell strikes at 178.02 at the Wankhede stadium \\n \\n- Jasprit Bumrah has picked 43 wickets in 37 games at the venue \\n \\n<b>What they said:</b> \\n \\n\"We're most focused on ourselves. It's pretty obvious we didn't play our best cricket in the first three matches and as we start to gain some momentum, this team can get on a real winning run. We're looking forward to that happening.\" - MI batter <b>Tim David</b>. \\n \\n\"The goal is still to qualify for finals and it's taking each game as it comes. We're going to do everything we can to win tomorrow and even if things don't go our way, it's not impossible to qualify. So I think we're just going to go about it a game at a time.\" - RCB bowler <b>Reece Topley</b>.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712758967628,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712758966075,
    "commText": "<p><b>Royal Challengers Bengaluru</b> Squad: Virat Kohli, Faf du Plessis(c), Rajat Patidar, Glenn Maxwell, Cameron Green, Dinesh Karthik(w), Saurav Chauhan, Reece Topley, Mayank Dagar, Mohammed Siraj, Yash Dayal, Himanshu Sharma, Suyash Prabhudessai, Mahipal Lomror, Vijaykumar Vyshak, Swapnil Singh, Karn Sharma, Tom Curran, Lockie Ferguson, Alzarri Joseph, Will Jacks, Anuj Rawat, Manoj Bhandage, Akash Deep, Rajan Kumar</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1712758754606,
    "commText": "<p><b>Mumbai Indians</b> Squad: Rohit Sharma, Ishan Kishan(w), Suryakumar Yadav, Tilak Varma, Hardik Pandya(c), Tim David, Romario Shepherd, Mohammad Nabi, Piyush Chawla, Gerald Coetzee, Jasprit Bumrah, Akash Madhwal, Kwena Maphaka, Naman Dhir, Nehal Wadhera, Shams Mulani, Shreyas Gopal, Luke Wood, Vishnu Vinod, Arjun Tendulkar, Kumar Kartikeya, Shivalik Sharma, Anshul Kamboj, Nuwan Thushara, Dewald Brevis</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]