[
  {
    "timestamp": 1711290605418,
    "commText": "<p><b>Punjab Kings</b> Squad: Shikhar Dhawan(c), Jonny Bairstow, Prabhsimran Singh, Sam Curran, Jitesh Sharma(w), Liam Livingstone, Shashank Singh, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar, Arshdeep Singh, Rilee Rossouw, Tanay Thyagarajan, Harpreet Singh Bhatia, Vidhwath Kaverappa, Chris Woakes, Rishi Dhawan, Sikandar Raza, Ashutosh Sharma, Atharva Taide, Nathan Ellis, Shivam Singh, Prince Choudhary, Vishwanath Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711290701509,
    "commText": "<p><b>Royal Challengers Bengaluru</b> Squad: Virat Kohli, Faf du Plessis(c), Rajat Patidar, Glenn Maxwell, Cameron Green, Anuj Rawat(w), Dinesh Karthik, Karn Sharma, Alzarri Joseph, Mayank Dagar, Mohammed Siraj, Yash Dayal, Akash Deep, Suyash Prabhudessai, Swapnil Singh, Vijaykumar Vyshak, Lockie Ferguson, Mahipal Lomror, Will Jacks, Manoj Bhandage, Saurav Chauhan, Rajan Kumar, Himanshu Sharma, Tom Curran, Reece Topley</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711290703163,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711290703173,
    "commText": "<p><b>Preview by Kaushik Rangarajan</b> \\n \\nA handful of logistics managers walking into the P1 stand on an idyllic and warm Sunday afternoon in Bengaluru's Chinnaswamy Stadium received the above, all-too-familiar acoustic welcome. It was the sound of RCB's batters practising their range hitting and sending projectiles into unoccupied chairs around the ground. The homecoming hope is for the 'thud' to be replaced by a celebratory crowd roar. After a false start in Chennai, RCB have a run of three home games in an eight-day window where batting missteps will come with a big price. \\n \\nThe Monday night fixture against Punjab Kings is a first opportunity to see if the Andy Flower and Mo Bobat combine have an alternate theory to playing on this most unforgiving of T20 grounds. Last year, for example, saw an average score of 196. RCB got 197 in a final 'win and qualify' game and still lost with five balls to spare. Could they, for instance, eschew all inhibition, forget about bowling strengths and hit out from the get go? To that extent, the partnership between Anuj Rawat and Dinesh Karthik on the opening night of IPL 2024 was a reassuring display of available depth. \\n \\nFor the visitors, it is a very short turnaround after a positive start at a new home. But if there is one venue they wouldn't mind turning up straight for a match 48 hours after the last one, then this is it. The Chinnaswamy holds no secrets. Or does it? \\n \\n<b>When:</b> Royal Challengers Bengaluru vs Punjab Kings, IPL 2024, March 25, 19:30 IST \\n \\n<b>Where:</b> M. Chinnaswamy Stadium, Bengaluru \\n \\n<b>What to expect:</b> The pitch for the game has patchy grass cover that has been characteristic of some recent games played here. It could start slow and slightly two-paced before quickly reverting to type, as it did in the India-Afghanistan game two months ago. The venue has seen quite a bit of T20 cricket, notably with the opening leg of the WPL played here. As ever, expect sixes at the venue. As many as 134 were struck over seven games here last year, one coming every roughly every two overs. \\n \\n<b>Head to Head:</b> RCB 14 - 17 PBKS. Punjab Kings have been something of a bogey team for RCB. Even in these last four seasons, when RCB have made three playoff appearances and the Kings none, PBKS hold a 5-2 advantage in clashes between the sides. \\n \\n<b>Team Watch:</b> \\n \\n<b>Royal Challengers Bengaluru</b> \\n \\n<b>Injury/Availability:</b> RCB have a fully fit squad to choose from. \\n \\n<b>Tactics & Matchups:</b> \\n \\nVirat Kohli has an excellent IPL record against Arshdeep Singh [44 off 23, 0 dismissals] and will be tasked with laying down the marker by winning this early match-up. Harpreet Brar, who has dismissed Kohli twice in this competition, will be his challenge in the middle overs but then it'll be Faf du Plessis' turn to make most of his record - [79 off 46, 0 dismissals] against the left-arm spinner. \\n \\n<b>Probable XI:</b> Virat Kohli, Faf du Plessis (c), Rajat Patidar, Glenn Maxwell, Cameron Green, Anuj Rawat (wk), Dinesh Karthik, Alzarri Joseph, Mayank Dagar, Karn Sharma, Mohammed Siraj [Impact Sub: Yash Dayal for Dinesh Karthik] \\n \\n<b>Punjab Kings</b> \\n \\n<b>Injury/Availability:</b> PBKS also have no injuries to report ahead of their second game. \\n \\n<b>Tactics & Matchups:</b> Kagiso Rabada has a positive match-up against RCB's 'Big Three'. He's dismissed Kohli four times in all T20s and has accounted for du Plessis and Maxwell thrice each. On the opposite end of the battle, Jonny Bairstow will look to take down Mohammed Siraj early. He has struck at a SR of 230 against RCB's pace ace without getting out even once. \\n \\n<b>Probable XI:</b> Shikhar Dhawan (c), Jonny Bairstow, Prabhsimran Singh, Sam Curran, Jitesh Sharma (wk), Liam Livingstone, Shashank Singh, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar [Impact Sub: Arshdeep Singh for Prabhsimran Singh] \\n \\n<b>Did you know?</b> \\n \\n- RCB lost four of the five night games they played at the Chinnaswamy Stadium in IPL 2023 \\n \\n- Faf du Plessis has an excellent record against PBKS. His scores against them since 2019 read: 54, 96, 87*, 48, 36*, 76, 88, 10 & 84 (last) \\n \\n- Harshal Patel, who'll return to the Chinnaswamy Stadium, has a career ER of 11.31 in death overs at this venue \\n \\n<b>What they said:</b> \\n \\n\"The communication to me has been very clear. I am supposed to be batting down the order, but if we lose early wickets, I have to bat in the middle order. Keeping wickets last season in the last couple of games gave me a lot of confidence, and I am looking forward to continuing as a wicketkeeper-batsman this season as well,\" - <b>Anuj Rawat</b>.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711290703193,
    "commText": "<p><b>18:15 Local Time, 12:45 GMT:</b> IPL is off and running folks - couple of last over thrillers and couple of one-sided affairs, the entertainment has truly begun. Today we move to Bengaluru where RCB play their first home game as they host Punjab Kings. There was an unbox event for RCB before the competition where they announced the change of name from Bangalore to Bengaluru and their new jersey was also launched, during that event Virat Kohli said this - I0$ - but it felt like the same ol' RCB during their opening encounter against CSK. A collapse after the powerplay, couple of lower order batters giving hope and the costliest pacer bought in the auction going for plenty of runs - a story played out countless times in the last 16 years.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711371036355,
    "commText": "<p>Nonetheless, it was just the first game, against the defending champions and at a venue where they haven't won since the opening season, so it can be swept under the carpet. Today will be a good measure on how this season will go about. They are playing at home and the atmosphere as always will be goosebumps inducing. The fans will throng the stadium in full support, the previous game would be a distant memory by now, the only thing on their mind would be to shout \"RCB, RCB, RCB\" and in return they would want nothing but entertainment.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711371170467,
    "commText": "<p><b>Coming to the team:</b> There might be some temptation to tinker with the playing XI but given the game is at Chinnaswamy it would be better to stick with the same team. Again the reliance is on Kohli, Faf and Maxwell to deliver with the bat, Patidar needs to forget his debut Test series and move on because this is a different format and one which he is good at, Anuj Rawat and DK were the biggest positives but RCB will hope it does not come down to them again. Mayank Dagar looked good in the couple of overs he bowled but since the pitch here offers very little for spin, he might be the one missing out tonight.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711371402428,
    "commText": "<p>There's not a lot of difference between Royal Challengers Bengaluru and Punjab Kings. Both have been there since IPL's inception and are yet to win the trophy. RCB have made it to three finals while Punjab have made it to one. There has been constant chopping and changing in the management, the team name has also been changed and high time they start challenging for the title. Punjab began their campaign on a winning note as they beat Delhi Capitals comfortably by 4 wickets. But again the question remains: can they be consistent? Can they build on that win?</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711371929403,
    "commText": "<p><b>How do Punjab stack up?</b> The bowling department seems to have all bases covered - Arshdeep, Rabada, Curran and Chahar form the core while the likes of Harpreet Brar and Harshal Patel bring variety. There was a bold move to send Curran at number four in their opening game and it paid off as the all rounder scored 63 to help chase down 177. Having Curran bat at four gives them a left-hander in the middle, he can play at different tempos and allows the likes of Jitesh Sharma and Livingstone to come in late where they can get going from the word go. And if Dhawan and Bairstow can get them off to fliers then there's no stopping this Punjab team.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711371942220,
    "commText": "<p><b>Pitch and Conditions:</b> \"First of three back to back home games for RCB as they take on Punjab Kings. This has been a high-scoring ground because of the dimensions and the center pitch is being used; 60 meters on either side and straight is 70 meters. It certainly does (look like a high-scoring Chinnaswamy pitch). The pitch is rock hard, there's a bit of grass on it and what we know about last year's IPL is the average first innings score is 196. The ball is going to fly everywhere. The trend in this IPL so far has been the home team winning. Can the RCB get off the mark tonight in front of their adoring fans? There are a few cracks but they look superficial and it also looks patchy with patches of grass. Maybe a little bit two-paced because it is dry where there are cracks but  under lights you expect the ball to come on to the bat,\" reckon I0$ and I1$.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711372105397,
    "commText": "<p><b>Cameron Green:</b> (Preferred batting position) Anywhere I can fit into the team basically. I am still pretty fresh at T20 cricket, so I am still trying to work it out myself, just happy to play wherever. (Two bouncers rule) Chops and changes each game, we had a pretty good match-up to Dube last game, unfortunately we didn't get him out doing it. It obviously helps my style, I find that as one of my better balls. And few of the other guys in our time feel the same, Alzarri with the two bouncer rule - helps him as well, it's exciting. It brings a new dimension to the game, the batters aren't too happy about it but the bowlers are. Helps the bowlers, especially in some of these grounds, I like it. My first home game here, can't wait to see how loud the fans are going to be. Exciting to be here as a local player.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711372505317,
    "commText": "<p><b>Royal Challengers Bengaluru have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711372905236,
    "commText": "<p><b>Faf du Plessis:</b> We are going to have a bowl. It looks a pretty good wicket but also because of the way our team is set up. You can say that RCB hasn't won a trophy, but the ladies (RCBW) broke the sealing and hopefully that motivates us. The boys are excited for the season. In any game of cricket you can't lose cluster of wickets, we did manage to recover towards the end but that is something we have to improve on. Same team and one or two options on changing the substitutions.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711373518168,
    "commText": "<p><b>Shikhar Dhawan:</b> We would have bowled first. But looking forward to batting first now. We did a lot of right things in the first game and that's why we ended up on the winning side. We have to keep improving each game. Same team.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711373750683,
    "commText": "<p><b>Royal Challengers Bengaluru</b> (Playing XI): Faf du Plessis(c), Virat Kohli, Rajat Patidar, Glenn Maxwell, Cameron Green, Dinesh Karthik, Anuj Rawat(w), Alzarri Joseph, Mayank Dagar, Mohammed Siraj, Yash Dayal</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711373780957,
    "commText": "<p><b>Punjab Kings</b> (Playing XI): Shikhar Dhawan(c), Jonny Bairstow, Prabhsimran Singh, Sam Curran, Jitesh Sharma(w), Liam Livingstone, Shashank Singh, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711373782682,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711373972757,
    "commText": "<p><b> Punjab Kings Subs:</b> Arshdeep Singh, Rilee Rossouw, Tanay Thyagarajan, Harpreet Bhatia, Vidwath Kaverappa</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711374000656,
    "commText": "<p><b>Royal Challengers Bengaluru Subs:</b> Suyash Prabhudessai, Mahipal Lomror, Karn Sharma, Vijaykumar Vyshak, Swapnil Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711374024103,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711374024113,
    "commText": "<p><b>Liam Livingstone:</b> It was the first game at our new stadium, everyone was really pleased with the way we played. Think there's a lot of ways we can get better which is the exciting thing. I guess winning games when you don't play at your best is probably a good thing going forward. The environment is really good, it's my third year now, we haven't made too many changes throughout the year. It's a group that's been together for a long time and it's somewhere I really enjoy playing. With our middle-order, we've got boys that can bat pretty much in any position, we are going to be quite flexible throughout the year. I don't think there's necessarily going to be a certain batting order. We are just going to see how the game pans out, whoever is best for each situation goes out and bat, that's the pretty exciting thing, you don't quite know when you are going in. Being flexible and being able to adapt to different situations is a challenge. (Batting at this venue) It brings more pressure as well, don't think you want to miss out on a ground like this. It's a really nice ground to play at, especially the first game of the year. I am sure all of our batters are really looking forward to it.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711374654689,
    "commText": "<p>Strange decision by RCB to go in with four regular bowlers and two all rounders - Maxwell and Green. They could have played an extra bowler and brought in the extra batter - probably DK or Anuj - as impact substitute. Karthik made way for Dayal in the first game while Karn Sharma was in the XI. Punjab Kings chased in their opening game and have stuck to the same line-up as they're batting first today. Will be interesting to see who will keep; Karthik or Anuj?</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711375062555,
    "commText": "<p>The umpires are making their way out to the middle. RCB are already in the field and in their respective positions. Kaushik, who's at the ground, pinged this around toss time - \"Quite a few empty seats at toss time\". But you can expect it to be full in a few minutes. Siraj is at the top of his mark and Faf is having a word with him. All in readiness and waiting for the countdown. 3..2..1..Let's go</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]