[
  {
    "timestamp": 1711797228641,
    "commText": "<p><b>Gujarat Titans</b> Squad: Wriddhiman Saha(w), Shubman Gill(c), Azmatullah Omarzai, David Miller, Vijay Shankar, Rahul Tewatia, Rashid Khan, Ravisrinivasan Sai Kishore, Umesh Yadav, Mohit Sharma, Spencer Johnson, Sai Sudharsan, Sharath BR, Abhinav Manohar, Noor Ahmad, Manav Suthar, Kane Williamson, Jayant Yadav, Sandeep Warrier, Shahrukh Khan, Joshua Little, Darshan Nalkande, Kartik Tyagi, Sushant Mishra, Matthew Wade</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711797375482,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Travis Head, Mayank Agarwal, Abhishek Sharma, Aiden Markram, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Mayank Markande, Jaydev Unadkat, Nitish Reddy, Washington Sundar, Umran Malik, Glenn Phillips, Upendra Yadav, Rahul Tripathi, T Natarajan, Anmolpreet Singh, Jhatavedh Subramanyan, Sanvir Singh, Fazalhaq Farooqi, Marco Jansen, Akash Maharaj Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711797378003,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711797378013,
    "commText": "<p><b>Preview</b> \\n \\nEven as the cinders from that epic 'hit-a-thon' at the HCA stadium a few days back are only just beginning to cool, the kit bags have been packed and shipped off westward as Sunrisers Hyderabad move on to their second away game to face Gujarat Titans. \\n \\nIt'll be back to the drawing board for the Sunrisers. After the batting fest in Hyderabad where 523 runs were scored, coming close on the heels of a 412-run contest in Kolkata, SRH might have to quickly readjust the tempo depending on what type of pitch is offered in Ahmedabad. But who better than their captain Pat Cummins, coach Daniel Vettori, and the Indian crowd silencer Travis Head to adapt to the venue that brought the trio a big golden prize last November. \\n \\nFor the Titans, they'll be hoping that the comfort of home aids them in getting back on track as they return from the trip to Chennai where they were humbled by the defending champions by a 63-run margin. With the batting order still finding its feet under new captain Shubman Gill and the bowling unit trying to mask the absence of a big name like Mohammed Shami, the Titans might just prefer a slow surface which the venue tends to provide every now and again. \\n \\n<b>When:</b> Sunday, March 31 at 15:30 IST \\n \\n<b>Where:</b> Narendra Modi Stadium, Ahmedabad \\n \\n<b>What to expect:</b> Sometimes, the pitches here are slow. Sometimes, they are belters. There were a few high-scoring games in IPL 2023 but there have been some middling totals here too. The 2023 World Cup matches played here were proof of that. In the previous season, the Titans failed to defend 204 against the Knight Riders and then kept Lucknow Super Giants to 171 after posting a massive 227 in the afternoon matches at this venue. \\n \\n<b>Head to head:</b> Titans 2-1 Sunrisers \\n \\n<b>Team watch</b> \\n \\n<b>Gujarat Titans</b> \\n \\n<b>Injury/Availability:</b> Matthew Wade has joined the team ahead of their third match and should be available for selection, having missed the first couple of games to take part in the Sheffield Shield final. \\n \\n<b>Tactics & Matchups:</b> Mohit Sharma picked up 4 for 28 the last time GT played against SRH at this venue. With 17 wickets in overs 16-20 and an economy of 8.69, he will be their key bowler in the death, going up against SRH's powerful batting lineup. \\n \\n<b>Probable XI:</b> Wriddhiman Saha (wk), Shubman Gill (c), Sai Sudharsan, Vijay Shankar, David Miller, Azmatullah Omarzai, Rahul Tewatia, Rashid Khan, R Sai Kishore, Umesh Yadav, Spencer Johnson. [Impact sub: Mohit Sharma for Sai Sudharsan]. \\n \\n<b>Sunrisers Hyderabad</b> \\n \\n<b>Injury/Availability:</b> There is still no clarity on when Wanindu Hasaranga will join the SRH team. T Natarajan missed the last game due to a niggle and if fit, he could replace Jaydev Unadkat although the latter did exceedingly well against Mumbai's band of heavy hitters. \\n \\n<b>Tactics & Matchups:</b> Both Abhishek Sharma and Heinrich Klaasen have a favourable matchup against premier legspinner Rashid Khan. Both have been dismissed only once each by the Afghanistan wrist spinner and have a strike rate of 204.35 and 196.77 respectively against him, with five fours and eight sixes between them. Meanwhile, SRH will look to use Bhuvneshwar Kumar's good numbers against Shubman Gill to their advantage, with the experienced seamer having dismissed the GT captain three times and conceding only 50 off 48. \\n \\n<b>Probable XI:</b> Travis Head, Mayank Agarwal, Abhishek Sharma, Aiden Markram, Heinrich Klaasen (wk), Abdul Samad, Shahbaz Ahmed, Pat Cummins (c), Bhuvneshwar Kumar, Mayank Markande, T Natarajan/Jaydev Unadkat. [Impact sub: Umran Malik for Travis Head]. \\n \\n<b>Did you know?</b> \\n \\n- Bhuvneshwar Kumar and Umran Malik both bagged five-wicket hauls in two different games against Titans and both were in losing causes. \\n \\n- None of the Titans batters have registered a fifty-plus score so far in IPL 2024, with Sai Sudharsan's 45 off 39 against MI being their highest. \\n \\n- Mohammed Shami has picked up 28 wickets in the powerplay alone, at an average of 21.25, with a strike rate of 18 and economy of 7.08. The rest of the GT bowlers combined have 27 wickets at an average of 41.44 and strike rate of 28, with an economy of 8.88 in this phase. \\n \\n<b>What they said?</b> \\n \\n\"I've been really impressed with the way he's conducted himself as a leader. I think he's embraced it (captaincy) really well. He's shown some good leadership qualities. He's a smart guy. He's a young captain, and there's lots to learn, especially in T20. So, he'll learn along the way.\" - <b>Gary Kirsten</b>, GT mentor.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711875656664,
    "commText": "<p><b>14:30 Local Time, 09:00 GMT, 14:30 IST:</b> Temperatures are rising in cities all across India and so is the intensity in the 16th edition of IPL. Today features the third double-header of this season as the Gujarat Titans gear up to face Sunrisers Hyderabad first up at the Narendra Modi Stadium. The runner-ups of the last season began their campaign with a tight win against the Mumbai Indians. They traveled to Chennai after that and were found wanting against CSK in their second game. Shubman Gill hasn’t looked as his usual self so far and GT’s middle-order has been off-colour as well. Meanwhile in bowling, Rashid is struggling for rhythm after returning from a back injury. History says that when Rashid performs badly, it takes a toll on the rest. There’s plenty to ponder upon for GT but the fact that they are back home will help them find solace.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711875789121,
    "commText": "<p>The Sunrisers lost a nervy 4-run contest in their high-scoring opener against KKR but their batters gave a good account of themselves. And then against MI at home, they brought the roof down with a record-shattering batting performance, posting 277 on the board. MI came close but the benefit of the doubt can be given to the SRH bowlers as the surface was a proper highway. The trio of Travis Head, Abhishek Sharma, and Heinrich Klaasen can prove to be a nightmare for the opposition given the form they are in. Travis Head and Pat Cummins will be delighted to return to Ahmedabad after lifting the World Cup at this very venue last November.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711875933179,
    "commText": "<p>It will be interesting to see how the pitch plays today. We have seen quite a number of high-scoring games due to the pitches being fresh. The pitch in the previous game between GT and MI at this venue was decent-paced but the slower balls did grip especially as the innings progressed. The dew factor is also out of equation with this being a day game. A slightly slower pitch will suit the hosts better. But, if it’s a belter of a surface, SRH would fancy themselves. Expect a cracking contest! Toss and team lineups will be announced shortly...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711876044668,
    "commText": "<p><b>Pitch Report | Ravi Shastri and Kevin Pietersen: </b> \"It's a warm afternoon here in Ahmedabad. Dimensions - if I am looking to cut/punch through the off-side - 66 metres, dab towards third man - that's 58 metres, pull/hook - 63 metres, scoop - 53 metres and down the ground - that's 73 metres. On the surface, this looks a very good pitch. Looks like a batting beauty. It's an absolute road, it looks like a tremendous wicket. There's quite a nice breeze flowing across the ground, so that might help the players tremendously. It's going to reach 38 or 40 degrees here. In the day games played here, teams batting first have scored 200, once it was defended and on another occasion it wasn't. We've got Sunrisers Hyderabad up here. Sunrisers are gonna come here and they are gonna look at this wicket and they are going to think, 'maybe we can get 270 again.' There's an even covering of grass, it's a beautiful, beautiful wicket. In spite of this being a big stadium, plenty of runs here. You can chase down a big score. One thing the groundsman said, it's black soil, moisture doesn't stay too long, it's a good surface to bat.\"</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711876670373,
    "commText": "<p><b>Just In: Wanindu Hasaranga</b> has been ruled out of this season due to a <b>left heel injury.</b> It's a bad news for SRH, especially due to the multi-faceted gameplay that Hasaranga brings into the equation. He could have made a real impact in the second half of the season with the pitches expected to get slower.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877059654,
    "commText": "<p><b>Sunrisers Hyderabad have won the toss and have opted to bat</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877448934,
    "commText": "<p><b>Pat Cummins:</b> We are gonna have a bat, looks like a good wicket so we want to put runs on the board. Don't Know about that, but good wonderful memories back here and it's a packed stadium as well. We scored the highest score ever, we are very capable of that but it's not going to happen always. If we have a good crack, we might get close to it again. <b>Same team for us.</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877616424,
    "commText": "<p><b>Shubman Gill:</b> We would have bowled first, looks like a good wicket. Definitely have a lot of good memories to look back here and would like to make good memories going forward. The support that I get from Ashu Paa and the management is great. We have got two changes - <b>Noor Ahmad</b> comes in for Mitch (Spencer Johnson) and <b>Darshan Nalkande</b> comes in for Sai Kishore.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877677623,
    "commText": "<p><b>Sunrisers Hyderabad</b> (Playing XI): Mayank Agarwal, Travis Head, Abhishek Sharma, Aiden Markram, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Mayank Markande, Jaydev Unadkat</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877726327,
    "commText": "<p><b>Gujarat Titans</b> (Playing XI): Wriddhiman Saha(w), Shubman Gill(c), Azmatullah Omarzai, David Miller, Vijay Shankar, Rahul Tewatia, Rashid Khan, Umesh Yadav, Noor Ahmad, Mohit Sharma, Darshan Nalkande</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877745434,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877836050,
    "commText": "<p><b>Sunrisers Hyderabad Subs:</b> Umran Malik, Washington Sundar, Glenn Phillips, Nitish Reddy, Upendra Yadav</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877896523,
    "commText": "<p><b>Gujarat Titans Subs:</b> Sai Sudharsan, Ravisrinivasan Sai Kishore, Sharath BR, Manav Suthar, Abhinav Manohar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711877931971,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711878594215,
    "commText": "<p><b>Mayank Agarwal: </b> The environment is really good, we are playing aggressive cricket and we are enjoying ourselves. Every coach has his set of thought process, Brian Lara had a different approach and Daniel Vettori has a different approach but similar sort of thinking that aggressive cricket needs to be played but a different way of putting it across. (On Pat Cummins) He is a world cup winning captain, his strategies are good, he has a sharp mind, he reads the game well, and the way he is guiding everyone in the team is great. (On their fearless batting approach in the last game) You can’t plan for such a thing, you have to play fearless cricket, and everyone played with the flow. The runs kept increasing and we kept piling them on, we wanted to bat the opposition out of the game.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711878594225,
    "commText": "<p><b>Rashid Khan -</b> It's fine for now, I played three T20Is for Afghanistan and a couple of games here (since his injury comeback). My mind and my body is getting used to the rigour, I hope to do better in the upcoming games. It's tough to come back from a back injury, but I'm feeling comfortable. I haven't made any adjustments (to the bowling action), but I hadn't practiced anything for the last three months, so it takes time to get back to using your fingers for spinning the ball. The most important thing is to get back to consistency. There hasn't been a difference between then and now (before his injury), it's all about mind games, I don't worry too much about it. He's been amazing (on Shubman Gill), has kept the team in a relatively cool and calm space, the amount of confidence he inspires is great. Ashu Bhai and the rest of the coaches are always there to encourage us, they know a lot about the game and the opposition, that's the discussion between myself and Ashish (Nehra)</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711878736100,
    "commText": "<p>We have made a couple of changes to our Expert XI keeping the conditions in mind. Have a look at our new and improved team</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711879146341,
    "commText": "<p>The players and the umpires have made their way out to the middle. It's a hot afternoon in Ahmedabad. Omarzai is marking his run-up and he is ready to go. A slip in place. Here we go...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]