[
  {
    "timestamp": 1712153312447,
    "commText": "<p><b>Gujarat Titans</b> Squad: Wriddhiman Saha(w), Shubman Gill(c), Sai Sudharsan, Vijay Shankar, David Miller, Azmatullah Omarzai, Rahul Tewatia, Rashid Khan, Umesh Yadav, Noor Ahmad, Mohit Sharma, Darshan Nalkande, Ravisrinivasan Sai Kishore, Sharath BR, Manav Suthar, Abhinav Manohar, Matthew Wade, Kane Williamson, Jayant Yadav, Sandeep Warrier, Shahrukh Khan, Joshua Little, Kartik Tyagi, Spencer Johnson, Sushant Mishra</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712153636118,
    "commText": "<p><b>Punjab Kings</b> Squad: Shikhar Dhawan(c), Jonny Bairstow, Prabhsimran Singh, Jitesh Sharma(w), Liam Livingstone, Sam Curran, Shashank Singh, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar, Arshdeep Singh, Rilee Rossouw, Tanay Thyagarajan, Vidhwath Kaverappa, Harpreet Singh Bhatia, Chris Woakes, Rishi Dhawan, Sikandar Raza, Ashutosh Sharma, Atharva Taide, Nathan Ellis, Shivam Singh, Prince Choudhary, Vishwanath Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712153637815,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712153637825,
    "commText": "<p><b>Preview</b> by <b>Vijay Tagore</b> \\n \\nScoring just 75 runs across three games may not be considered poor in T20 cricket, but for Shubman Gill, a batting average of 25 falls short of his lofty standards. As Gujarat Titans gear up to face Punjab Kings in their fourth match of the season, all eyes will be on their newly appointed captain. The question looming large: is the burden of captaincy affecting Gill's performance? \\n \\n\"He is batting superbly,\" stated Mohit Sharma, the Titans' paceman, coming to the defense of his captain. \"Yes it is a fact that the stats have not been converted into big ones but he looks in superb rhythm. He is batting very well at the nets. A big knock from him not too far away.\" Gill's contributions in the three matches so far have been 31, 8, and 36 runs, but greater numbers are certainly expected from him. \\n \\nThe challenge for Gill lies in the relentless scrutiny he faces, particularly from Gujarat's passionate fans who are accustomed to the team's high standards. With two finals appearances and one title in the first two years, their success rate exemplary. This season, especially with the mega auction looming next year, presents a big test for the 24-year-old Indian batting sensation. \\n \\nWith Gary Kirsten (batting coach and mentor) and Ashish Nehra (head coach) among the highly-organised support staff, Gill has the right environment and set-up to grow as a cricketer. \"We as a franchise, as a support staff, are really excited to help him grow as a person more than as a captain. If he grows as a person, then he will definitely be a better captain going forward,\" Nehra had said before the start of the season. Gill endorsed his coach's advice. \"No one is perfect. There is a lot to learn,\" he had said. \\n \\nA big knock certainly from the captain is round the corner. If he gets one, it could spell trouble from the Punjab, incidentally, Gill's home state. With Sai Sudarshan and David Miller in good form, and Rahul Tewatia to follow, batting is not a worry. Bowling, of course, is never a concern for the Titans, what with Mohit, Rashid Khan and Noor Ahmed taking care of 12 overs. Azmatullah Omarzai has managed to keep highly talented Josh Little out of the XI and Umesh Yadav's experience is always handy for any side. The Titans side looks in sync. \\n \\nSame though cannot be said of Punjab, who went off track after winning their first game of the season (vs Delhi Capitals). As their bowling coach Trevor Gonsalves said, their problem has been losing wickets in a cluster. Besides, the Shikhar Dhawann side needs to sort out their bowling strategy. Arshdeep Singh was not given his quota of four overs in the previous game in which Krunal Pandya took the game away from them with a blistering knock. Harshal Patel and Rahul Chahar have not been as effective this season. \\n \\nT20 can produce unexpected results but if Punjab Kings manage to beat the Titans at the Narendra Modi Stadium here in Ahmedabad, it will be a real upset. \\n \\n<b>When:</b> Gujarat Titans vs Punjab Kings, IPL 2024, April 4, 19:30 IST \\n \\n<b>Where:</b> Narendra Modi Stadium, Ahmedabad \\n \\n<b>What to expect:</b> Toss may not be such a big factor as the pitch looks full of runs. The dew, though, will be a big factor and it may not be surprise, if the captain winning the toss chooses to bat. \\n \\n<b>Head to head:</b> GT 2 - 1 PBKS. The last outing between the sides was won by the Titans in Mohali last season. \\n \\n<b>Team watch</b> \\n \\n<b>Gujarat Titans</b> \\n \\n<b>Injuries/availability:</b> The hosts have no injury worries as such although, as Mohit Sharma said, most players could be carrying niggles. \\n \\n<b>Probable XI:</b> Shubman Gill (C), Wriddhiman Saha (wk), Sai Sudharsan, Azmatullah Omarzai, David Miller, Vijay Shankar, Rahul Tewatia, Rashid Khan, Noor Ahmed, Umesh Yadav, Darshan Nalkande [Impact sub: Sai for Mohit Sharma if they bat first, or vice-versa] \\n \\n<b>Punjab Kings</b> \\n \\n<b>Injuries/availability:</b> Liam Livingstone could miss the game due to hamstring injury. The rest of the squad is free of fitness concerns \\n \\n<b>Probable XI:</b> Shikhar Dhawan (C), Jonny Bairstow, Prabhsimran Singh, Jitesh Sharma (wk), Liam Livingstone, Sam Curran, Shashank Singh, Harshal Patel, Harpeet Brar, Kagiso Rabada, Rahul Chahar [Impact sub: Arshdeep Singh for Prabhsimran if they bat first, or vice-versa] \\n \\n<b>Did you know?</b> \\n \\n- Gill has an exceptional record against PBKS hitting five 50s in ten innings. \\n \\n- Umesh Yadav has won six POTM awards against Punjab Kings - the most by a player against an opponent in the IPL. \\n \\n- From being a new ball specialist during his peak years with CSK be 2013 and 2015, Mohit Sharma has become a death overs expert for Titans since his comeback last year. In 2013-15 period he bowled 51.4% of his overs in the Powerplay while for Titans 46.6% of his overs have come in the death overs. \\n \\n<b>What they said:</b> \\n \\n\"It is all about preparation and it is up to the team's needs. The team suggests your role. Earlier I used to bowl with the new ball. Since last year, I have been asked to bowl with the old ball. I keep searching for options on how I can contribute to the team's success. Whether I concede 70 or take 4/40, it all depends on preparation,\" - <b>Mohit Sharma,</b> GT bowler \\n \\n\"Not really concerned (about bowlers leaking runs). They are top-class players, whether it is Harshal Patel or Rahul Chahar. They have gone through a lot of situations where they have been hit. They will come back very strongly.\" -<b> Trevor Gonsalves</b>, PBKS' assistant bowling coach</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712235728568,
    "commText": "<p><b>18:30 Local Time, 13:00 GMT, 18:30 IST:</b> The Titans are off to a good start under the reign of their new skipper, Shubman Gill. Meanwhile, the Kings have been lackluster as a group so far. Although Gill hasn’t kicked on to play a substantial knock so far, his calm & cool demeanour bodes well for the Titans. GT began their campaign with a come-from-behind win against MI at home. Although they faced a drubbing against CSK in the cauldron at Chepauk, they bounced back in style at home against SRH. Sai Sudharsan has been solid as a rock for them. The fact that Miller looked fluent in the last game augurs well for their middle-order. Mohit Sharma continues to do what he does best, thriving under pressure situations and coming up trumps at the death. GT’s head coach, Ashish Nehra’s dynamic style of leadership has drawn comparisons to Manchester City's manager Pep Guardiola and he has been a boon for his side.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712235869727,
    "commText": "<p>The Kings, on the other hand, need to fire collectively as a unit. They started nicely with a victory against DC in their opening game at home. But, two successive losses after that away from home against RCB & LSG have pushed them on the back foot. Their batters were rattled by Mayank Yadav’s raw pace in their previous game. Dhawan is in good touch with the bat but he needs more support from the others. Sam Curran has been a vital cog in the wheel for them and the visitors will hope that he fires with both bat and ball tonight. Harshal’s ineffectiveness at the death and Rabada’s poor form is a cause of concern for them. The pitches in Ahmedabad so far have been tacky in nature but have got better to bat on with the innings progression. Expect a cagey contest! Toss and team lineups will be announced shortly...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712236755507,
    "commText": "<p><b>Pitch report:</b> \"We are the centre pitch. 63m square boundaries, 70m straight hit,\" reveals <b>WV Raman. Simon Katich</b> is then called in to talk about the surface. \"We are on Pitch No. 6. We were here 4 times last season and in those 4 matches three of them were won by the chasing team. So I expect that to come into play tonight at the toss. This pitch has black and red soil, a mixture of both. It's rock hard and has 3mm of grass on it so I expect to have good pace and bounce so I expect plenty of runs tonight. GT have won 8 out of 12 games here,\" opines Katich.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712236829706,
    "commText": "<p><b>Jitesh Sharma:</b> (On his journey from last season to this season) It was very exciting and thrilling, and there has been a lot of learning, I have tried to keep things simple. I have kept following my process, things have changed, I can’t deny that but I’m happy that changes have come in my life. I won’t judge myself on my performances so far, my mindset is the same. The position I bat in, I have to keep a setback in my mind because I won’t be able to execute my plans every time. But, I think that I will be good in my process and hopefully, everything will work out well. I think <b>Livingstone won’t be able to make it to the team tonight due to his injury</b>, let’s see.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712237134948,
    "commText": "<p><b>Punjab Kings have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712237440189,
    "commText": "<p><b>Shikhar Dhawan | PBKS captain: </b> We are gonna bowl first, I feel it's a good wicket and it will stay the same, we will prefer chasing. In some of the games, the score has been very high but it's not going to be that way every game because the teams are very good. I think we are playing decent cricket, it's early days in the tournament, we are going to play better. <b>Livi goes out and Sikandar Raza comes into the side.</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712237609191,
    "commText": "<p><b>Shubman Gill | GT captain: </b> We would have bowled, it looks like an even wicket, it's been a bit overcast so hopefully there will be no dew. We have started off pretty well, we have got couple of games on the road after this, games on the road are important. Last year, we played away from home pretty well. <b>Miller misses out due to a niggle and Kane comes into the side.</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712237703732,
    "commText": "<p><b>Gujarat Titans</b> (Playing XI): Wriddhiman Saha(w), Shubman Gill(c), Sai Sudharsan, Kane Williamson, Vijay Shankar, Azmatullah Omarzai, Rahul Tewatia, Rashid Khan, Noor Ahmad, Umesh Yadav, Darshan Nalkande</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712237907719,
    "commText": "<p><b>Punjab Kings</b> (Playing XI): Shikhar Dhawan(c), Jonny Bairstow, Jitesh Sharma(w), Prabhsimran Singh, Sam Curran, Shashank Singh, Sikandar Raza, Harpreet Brar, Harshal Patel, Kagiso Rabada, Arshdeep Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712237909637,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712238028535,
    "commText": "<p><b>Gujarat Titans Subs:</b> BR Sharath, Mohit Sharma, Sandeep Warrier, Abhinav Manohar, Manav Suthar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712238057528,
    "commText": "<p><b>Punjab Kings Subs:</b> Tanay Thyagarajan, Nathan Ellis, Asutosh Sharma, Rahul Chahar, Vidwath Kaverappa</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712238092594,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712238572834,
    "commText": "<p>We have made a few changes to our expert XI keeping the conditions in mind. Have a look at our new and improved team</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712239085583,
    "commText": "<p>The umpires are walking out to the middle followed by Gill and Saha. Punjab Kings have a quick huddle before taking the field. They have gone in with just six bowlers and left out Rahul Chahar. Chasing teams have started strengthing their batting than their bowling, so this move is not a surprise. Brar has the new ball, two right handers opening and hence this move. We are ready to go..</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]