[
  {
    "timestamp": 1716027862162,
    "commText": "<p><b>Punjab Kings</b> Squad: Prabhsimran Singh, Rilee Rossouw, Shashank Singh, Jitesh Sharma(w/c), Harpreet Brar, Harshal Patel, Nathan Ellis, Rahul Chahar, Arshdeep Singh, Vidhwath Kaverappa, Ashutosh Sharma, Tanay Thyagarajan, Rishi Dhawan, Harpreet Singh Bhatia, Shikhar Dhawan, Chris Woakes, Atharva Taide, Shivam Singh, Prince Choudhary, Vishwanath Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716028008646,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Travis Head, Nitish Reddy, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Sanvir Singh, Pat Cummins(c), Bhuvneshwar Kumar, Jaydev Unadkat, Vijayakanth Viyaskanth, T Natarajan, Abhishek Sharma, Umran Malik, Mayank Agarwal, Glenn Phillips, Washington Sundar, Marco Jansen, Mayank Markande, Aiden Markram, Rahul Tripathi, Anmolpreet Singh, Upendra Yadav, Jhatavedh Subramanyan, Fazalhaq Farooqi, Akash Maharaj Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716028010435,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716028010445,
    "commText": "<p><b>Preview by Gokul Gopal</b> \\n \\nA washout in Hyderabad on May 15 confirmed a playoffs berth for Sunrisers Hyderabad and they'll be keen to have two shots at making the IPL 2024 final by finishing in the top two. For that, they need a victory in their final league game against the spirited but inconsistent Punjab Kings and hope that Rajasthan Royals, who are on a losing streak despite sealing a top-four finish, drop their last game against Kolkata Knight Riders. But it all depends on the weather for Sunday's afternoon game, and the forecast doesn't look too promising. \\n \\nSunrisers, who have brought the house down with their ferocious batting in this IPL, will look to sustain that intensity going up against the Kings who will be missing several key players in their last match. The hosts, however, haven't had any onfield action for a while now. They had a seven-day break after their fiery performance against Lucknow Super Giants, which has extended to 10 days of non-action now due to the abandoned match. Will there be any rustiness? \\n \\nThe Kings, having not made the playoffs for 10 successive seasons now, will be hoping to sign off with a consolation win. They come into this game with some confidence, having overpowered the Royals in their previous match, but have a severely depleted side with the bulk of their overseas players having departed. And even in their last victory, it was the middle order that stood up and delivered, with their top-order woes not showing any signs of relenting. PBKS's top three have scored the least runs among all teams in this IPL and have the least number of fifty-plus scores as well, highlighting their major issue this season. Can they find a way around it in their last match? \\n \\n<b>When: </b>Sunrisers Hyderabad vs Punjab Kings,, Sunday, May 19 at 15:30 IST \\n \\n<b>Where: </b>Rajiv Gandhi International Stadium, Hyderabad \\n \\n<b>What to expect: </b>High-scoring games have been the flavour of Hyderabad and this match too is expected to adhere to the norm. Showers disrupted the practice sessions on Saturday (May 18) and more rain is forecast for the afternoon-evening period on the match day. \\n \\n<b>Head to head: </b>SRH 15 - 7 PBKS. Sunrisers have won their last two matches against the Kings, including their away match earlier in this edition in Mullanpur which they won by 2 runs, defending 182. \\n \\n<b>Teams watch</b> \\n \\n<b>Sunrisers Hyderabad</b> \\n \\n<b>Injury/Availability: </b>Sunrisers do not have any fitness concerns at the moment. \\n \\n<b>Tactics & Matchups: </b>Bhuvneshwar Kumar has favourable numbers against Prabhsimran Singh, having dismissed him twice in 10 deliveries in the IPL - and three dismissals in 11 deliveries including the 2023 Syed Mushtaq Ali match between Uttar Pradesh and Punjab. Both Bhuvneshwar has also kept Rilee Rossouw quiet, giving away only 5 runs in 10 deliveries, although he's yet to dismiss him, while the South African has scored 14 runs in 12 balls with one dismissal against Pat Cummins. \\n \\n<b>Probable XI: </b>Abhishek Sharma, Travis Head, Nitish Reddy, Heinrich Klaasen (wk), Abdul Samad, Shahbaz Ahmed, Sanvir Singh, Pat Cummins (c), Bhuvneshwar Kumar, Jaydev Unadkat, Vijayakanth Viyaskanth. [Impact sub: T Natarajan]. \\n \\n<b>Punjab Kings</b> \\n \\n<b>Injury/Availability: </b>Jitesh Sharma turned up for the captains' meeting before the start of the season as Shikhar Dhawan and Sam Curran hadn't joined the team yet. As it turns out, he will lead Punjab Kings in their last match of the competition as Dhawan continues his recovery from a shoulder injury while Sam Curran has left for England along with Jonny Bairstow to join the national side for the T20I series against Pakistan. With Kagiso Rabada, Liam Livingstone, Sikandar Raza and Chris Woakes also unavailable, PBKS have only two overseas options - Rilee Rossouw and Nathan Ellis - for their match against SRH. Meanwhile, they are likely to include Atharva Taide as one of their openers, replacing Bairstow, and perhaps bring in Rishi Dhawan in place of Curran. \\n \\n<b>Tactics & Matchups: </b>Rahul Chahar is a good option for PBKS to be used early, with the legspinner having accounted for Abhishek Sharma twice in 10 deliveries for only 7 runs. Harshal Patel matches up well against Heinrich Klaasen, with two dismissals in 14 balls for 22 runs. \\n \\n<b>Probable XI: </b>Prabhsimran Singh, Atharva Taide, Rilee Rossouw, Shashank Singh, Jitesh Sharma (c & wk), Ashutosh Sharma, Harpreet Brar, Rishi Dhawan, Harshal Patel, Nathan Ellis, Rahul Chahar. [Impact sub: Arshdeep Singh]. \\n \\n<b>Did you know? </b> \\n \\n- The 635 runs and three fifty-plus scores scored by the Punjab Kings openers is the least for any team in this IPL. Meanwhile, PBKS's batters from Nos. 5-8 have contributed 843 runs, the second most in this IPL after LSG (940) \\n \\n- Out of the 583 runs he has scored in this season so far, Travis Head has got 385 runs (66.03%) in the powerplay alone. He averages 128.33 in this phase with a strike rate of 220. His opening partner Abhishek Sharma has scored 285 (71.07%) of his tally of 401 runs in the powerplay, at a strike rate of 205.04 \\n \\n- Sunrisers have struck the most maximums in this IPL, scoring 146 sixes, while their 171 fours is the least among all teams in this edition. Abhishek Sharma is second on the sixes chart (35), just one behind Nicholas Pooran. Abhishek, Travis Head and Heinrich Klaasen have combined to strike 97 sixes \\n \\n<b>What they said? </b> \\n \\n\"It's not ideal. You prefer to have some good match practice before you go into the finals. But we can't control that. But what we do have confidence is that we've played some pretty good cricket to make the playoffs. Ideally you would play some competitive matches before you play your final - whether it's an eliminator or the qualifier\" - <b>Simon Helmot</b>, SRH assistant coach, on the possibility of SRH entering the playoffs after a lengthy break should the SRH-PBKS match be affected by rain. \\n \\n\"The mood is more positive in the dressing room than before because we have nothing to lose now. The season has been inconsistent for us. But we played really good cricket and we had many positives throughout the season...In cricket, things can change in an instant. We just missed out on some luck\" - <b>Jitesh Sharma</b>, PBKS captain for their final game of the season.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716108905590,
    "commText": "<p><b>14:25 local, 08:55 GMT:</b> It's <b>not raining in Uppal</b>, Hyderabad right now. And how many of you are still nursing the late-night RCB-CSK hangover? Yes or no, it's time to switch your focus to the other three play-off teams. Also, today marks the end of league stage, and the last double-header of the season as well. Plenty of rain updates over the last 4 days and, fingers crossed, hoping today is anything but wet-weather updates. Hello and welcome to game 69. Ball one in 60...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716109297842,
    "commText": "<p><b>Can SRH finish in the top 2?</b> They sure can, but for that to happen - they need to win today and hope RR (will play KKR in the evening) lose the next game. If SRH lose or no-result, RR will claim the second spot irrespective of the result in the final league game.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716109297852,
    "commText": "<p><b>Shashank Singh: </b>This is my fifth year in the IPL, first three years didn't get many chances but I learnt a lot. By god's grace I have justified my talent a bit this year. Better things waiting for me in the future, but let's focus on the present, focus on today's match. I have enjoyed whatever cricket I have played till now, doing decently well, when the team wins and I perform, it makes me happier. Management has given me that freedom from match 1. I got out for a duck in the first match but they have given me the freedom, have asked me to play freely and express myself. Credit goes to the team management. I play for Chattisgarh, my home state at number 4 or 5, enjoying my role, lot to learn. I'll make sure that I come with a better mindset next season and make sure I finish the game. It's a good wicket, good crowd, hopefully we finish off on a high.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716110387823,
    "commText": "<p><b>What's at stake for PBKS?</b> They did show glimpses of brilliance and came close to seizing key moments, but unfortunately a spate of injuries and inconsistency with the bat cost them dear. A win today will take them to the 8th spot, but they know beating SRH in Hyderabad isn't a straightforward task.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716110927175,
    "commText": "<p><b>Pitch report:</b> 66m square boundaries, 78m down the ground. A lot of runs on offer, there's no grass on the surface, the ball will spin later. A few cracks on the wicket. Looks like a belter, SRH would like to end this league stage with another big score, reckons I0$. The captain winning the toss might elect to bat.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716110986242,
    "commText": "<p><b>Punjab Kings have won the toss and have opted to bat</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111045308,
    "commText": "<p><b>Jitesh Sharma:</b> We would like to bat. I think wicket is looking good, we want to score big and put SRH under pressure. Proud and grateful to captain my side today. We have few options because all the overseas have gone gone. Only Rilee Rossouw is gonna play. We have exciting talent waiting for their opportunity and they are gonna give their best today. Nothing to lose today, we are here to play some good cricket.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111139906,
    "commText": "<p><b>Pat Cummins:</b> The fans have been awesome this season here. We are pretty well set-up for both (bat first or ball first. I'm a terrible reader of wickets, looks like a nice wicket. Looks dry and firm. Only one change for us. <b>Rahul Tripathi comes in for a bowler.</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111360924,
    "commText": "<p><b>Punjab Kings</b> (Playing XI): Prabhsimran Singh, Atharva Taide, Rilee Rossouw, Shashank Singh, Jitesh Sharma(w/c), Ashutosh Sharma, Shivam Singh, Harpreet Brar, Rishi Dhawan, Harshal Patel, Rahul Chahar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111444460,
    "commText": "<p><b>Sunrisers Hyderabad</b> (Playing XI): Abhishek Sharma, Nitish Reddy, Rahul Tripathi, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Sanvir Singh, Pat Cummins(c), Bhuvneshwar Kumar, Vijayakanth Viyaskanth, T Natarajan</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111446716,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111609513,
    "commText": "<p><b>Punjab Kings Impact Subs:</b> Arshdeep Singh, Tanay Thyagarajan, Prince Choudhary, Vidhwath Kaverappa, Harpreet Singh Bhatia</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111626129,
    "commText": "<p><b>Sunrisers Hyderabad Impact Subs:</b> Travis Head, Umran Malik, Glenn Phillips, Washington Sundar, Jaydev Unadkat</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716111650281,
    "commText": "<p><b>Here are the Impact substitutes for both the teams</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716112105373,
    "commText": "<p>We have made a few changes to our expert XI after the toss. Do remember to check our Fantasy Handbook guide before locking your teams...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716112683172,
    "commText": "<p><b>2 minutes to ball one:</b> The umpires stride out to the centre as the Orange flags fly high in the stands. It's gone slightly murky at the moment, but no sights of rain as yet...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716112750180,
    "commText": "<p>As ever, Bhuvneshwar Kumar will kickstart proceedings with the ball for SRH. One slip in place. Off we go...</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]