[
  {
    "timestamp": 1713102809666,
    "commText": "<p>We have made a few changes to our Fantasy Handbook. Do check out our updated FH before finalising your Fantasy XI...</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713102011159,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101947271,
    "commText": "<p><b>Chennai Super Kings Subs:</b> Matheesha Pathirana, Nishant Sindhu, Mitchell Santner, Moeen Ali, Shaik Rasheed</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101835770,
    "commText": "<p><b>Mumbai Indians Subs:</b> Suryakumar Yadav, Dewald Brevis, Naman Dhir, Nehal Wadhera, Harvik Desai</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101763055,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101761042,
    "commText": "<p><b>Mumbai Indians</b> (Playing XI): Rohit Sharma, Ishan Kishan(w), Tilak Varma, Hardik Pandya(c), Tim David, Mohammad Nabi, Romario Shepherd, Shreyas Gopal, Gerald Coetzee, Jasprit Bumrah, Akash Madhwal</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101718057,
    "commText": "<p><b>Chennai Super Kings</b> (Playing XI): Rachin Ravindra, Ruturaj Gaikwad(c), Ajinkya Rahane, Daryl Mitchell, Shivam Dube, Ravindra Jadeja, Sameer Rizvi, MS Dhoni(w), Shardul Thakur, Tushar Deshpande, Mustafizur Rahman</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101560701,
    "commText": "<p><b>Ruturaj Gaikwad:</b> Would have bowled first, something we can't control. Need to do well in all three departments. This is the beauty of IPL. always fluctuating. Good contest for both teams, two teams up for grabs. Team playing better will win. <b>Pathirana</b> comes in for <b>Theekshana</b>, that's the only change.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101469173,
    "commText": "<p><b>Hardik Pandya:</b> We would like to bowl first, dew will come into play. It (pitch) looks better than the last game, expecting a lot of runs. Need to stick to the basics. Winning is very important to get the momentum. We were able to win two games convincingly. That's the beauty about IPL, everyone has to contribute. Your team will be able to achieve goals eventually. The dew started coming post 10 overs (in the last game.) It gets heavier in the evening. Same team.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101454000,
    "commText": "<p><b>Mumbai Indians have won the toss and have opted to field</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101442278,
    "commText": "<p>Heads is the call by Gaikwad, and tails it is..</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713101302934,
    "commText": "<p>Right then, the two skippers are out in the middle and it's toss time..</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713100850773,
    "commText": "<p><b>Pitch Report:</b> Terrific game in store with two of the most successful teams in the IPL. The expectation is for a lot of power hitting because the pitch we are on has the same dimensions as the RCB vs MI game. The shorter boundary to the left is only about 59m, and it is 65m to the right. The previous game here was a high scoring game, but when you venture longer into the tournament the wickets tend to play a bit differently. This surface is a lot drier and when you use the same pitch consecutively then the wicket will show some semblance of dry patches. It still looks a beautiful wicket, not a wicket where you get rolled over for a 100 odd runs. There will be runs but today we could see the spinners play in the powerplay. They are spraying some anti-dew substance onto the outfield, but dew could play a factor. You certainly want to be chasing on the surface, suggests Ian Bishop and Kevin Pietersen.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713100175156,
    "commText": "<p><b>Ravindra Jadeja:</b> On this ground even the good balls can go the distance. Need to identify batter's strengths and bowl accordingly to avoid conceding boundaries at this venue. Got to stick to my plan against a particular player and set the field accordingly. The defeats we have conceded have been close games, haven't lost them by big margins. If you play good cricket, play your shots, chasing any target is possible here. You'll get to see a good contest as Mumbai Indians are a very good team. There are not many meetings or discussions when we play MI, this rivalry is hyped I think. Just need to focus on cricket when we are on the field.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713017537433,
    "commText": "<p>Chennai have been unbeaten at the Chepauk this season, but it’s the away games where they have struggled to get going. However, Ajinkya Rahane, Shivam Dube, Tushar Deshpande and Shardul Thakur - all of them are Mumbai boys, hence they’ll be pretty accustomed to playing in these conditions at the Wankhede. Nothing alien for them. How can one forget the kind of support MS Dhoni gets all across the country? With such a massive fan following, CSK can make any stadium turn yellow. Will they be able to clinch their first away win of the season, or will Mumbai Indians make it three in a row? We shall find out soon, stay around for the toss and teams..</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713017537423,
    "commText": "<p><b>18:15 local time:</b> It’s time for the El Classico of IPL. Five-time IPL champions vs Five-time IPL champions - will lock horns tonight at the Wankhede! After losing their first three matches of the season, Mumbai Indians have won two on the bounce. They posted a massive first innings total against Delhi Capitals, while chased down 195-odd against Royal Challengers Bangalore within 16 overs. With two consecutive wins at home, the Mumbai Indians are on the charge. Can they keep the winning momentum intact though? Would have been an easy task against any other side, but not against their opponents tonight - the Chennai Super Kings.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713017537403,
    "commText": "<p><b>Preview</b> by <b>Vijay Tagore </b> \\n \\n\"I don't know about the rivalry. When I play, I don't think of what is happening outside. My duty is to bowl the ball, hit the ball and catch the ball. I know only this and I just do that.\" It's Mumbai Indians versus Chennai Super Kings, it can't get bigger in the IPL. It could even be the last game of MS Dhoni at the venue where he had won India the World Cup. Mohammad Nabi, admittedly, is ignorant of the El Clasico of the IPL. \\n \\nThe atmosphere at the Wankhede on Sunday night remains shrouded in expectancy: will it be a sea of blue or a flood of yellow? The possibility of Mumbai Indian fans being outnumbered at their home ground is not ruled out. While a packed stadium is a given, the energy from the stands is expected to be particularly electrifying. \\n \\n\"We love it, to be honest. We really look forward to this fixture. It's a wonderful place to play and over the years it has developed into a really competitive rivalry, and it's based on two good teams playing successful brands of cricket,\" Stephen Fleming, the perennial Chennai Super Kings coach, said of the rivalry between the teams -- both five-time champions. \\n \\nThe New Zealander continued, explaining that the 'massive rivalry' has become part of Indian cricket's folklore because the sides process the game, temper their emotions and enjoy the occasion. In a nutshell, he was suggesting that cricket always takes precedence over everything else when MI and CSK clash. And the rest is hype, even if it is significant hype. \\n \\nIt is unlikely to be any different on Sunday night. With big hitters on both sides, it should be a high-scoring game. Mumbai Indians had lost a home game but the season has been particularly favourable to the home side, something even Fleming has pointed out. Of the five games they have played, CSK lost both their away games. \\n \\nWith Jasprit Bumrah in red hot form and their batters, including Suryakumar Yadav, Ishan Kishan and Rohit Sharma coming to the party, Mumbai Indians should fancy their chances in home conditions against their arch-rivals. They also have a big hitter in Romario Shepherd. But with the likes of Ajinkya Rahane, Shardul Thakur, Tushar Deshpande and Shivam Dube, particularly the last named, in the Chennai camp, the home advantage for the Mumbai Indians may get squarely neutered. And then there is this MS Dhoni factor, who is at home in every Indian centre. \\n \\nFleming agreed it is a massive advantage for the visitors. \"It's magnificent, to be honest. It is truly astounding the love that, let's be honest, the love that India has for MS Dhoni. And we are benefactors of that. So the team without doubt feel pride when they walk out to an away game. And there's a large amount of yellow, if not all yellow. \\n \\n\"It's in some cases overwhelming. So you just got to make sure that it's a nice addition, not a pressure. But we're under no illusions about what's created it and who's created it and we're very proud of him and his involvement with the side. So we look at it as a real honour that people will come out and support him and if it's secondary, then the team.\" \\n \\n<b>When:</b> Mumbai Indians vs Chennai Super Kings, IPL 2024, April 14, 19:30 IST \\n \\n<b>Where:</b> Wankhede Stadium, Mumbai \\n \\n<b>What to expect:</b> It is obvious that the captain winning the toss will decide to chase since dew will be a major factor. The pitch looks full of runs and it will be a high-scoring game, just like the last two contests here. \\n \\n<b>Head to Head:</b> MI 20-16 \\n \\nIn 36 matches, MI lead the head to head record and at the Wankhede, they lead 7-4. Last year, CSK won both home and away contests. \\n \\n<b>Team News</b> \\n \\n<b>Mumbai Indians</b> \\n \\n<b>Injury and availability:</b> MI have a clear slate on fitness report \\n \\n<b>Tactics and match-ups:</b> Shreyas Gopal should continue in place of Piyush Chawla but MI could be looking to bring in Jasprit Bumrah for Shivam Dube, the CSK batsman who has been in full form. He could be destructive against the spinners and Bumrah, also in good form, could be the only one in MI ranks to stop him. \\n \\n<b>Probable XI:</b> Rohit Sharma, Ishan Kishan (wk), Tilak Varma, Hardik Pandya (c), Tim David, Romario Shepherd, Mohammad Nabi, Shreyas Gopal, Jasprit Bumrah, Gerald Coetzee, Akash Madhwal. (Impact Substitute: Suryakumar Yadav) \\n \\n<b>Chennai Super Kings</b> \\n \\n<b>Injury and Availability:</b> No injuries reported; all players available, including Matheesha Pathirana although the Sri Lankan pacer may not play. \\n \\n<b>Tactics and match-ups:</b> Spinners are not having a big impact at the Wankhede and Ravindra Jadeja could be judiciously used, most likely to be brought in early when MI power-players will be in action. \\n \\n<b>Probable XI:</b> Ruturaj Gaikwad (c), Rachin Ravindra, Ajinkya Rahane, Daryl Mitchell, Sameer Rizvi, Ravindra Jadeja, MS Dhoni (wk), Shardul Thakur, Mustafizur Rahman, Tushar Deshpande, Maheesh Theekshana. (Impact Substitute: Shivam Dube) \\n \\n<b>Did you know?</b> \\n \\n- This will be the first instance of MI vs CSK in IPL without either Rohit or Dhoni helming either team. \\n \\n- Since 2023 Suryakumar Yadav averages close to 60 at a S/R of 206.40 in Wankhede but CSK have traditionally kept him quiet with the batter managing only two fifties in 14 innings against them \\n \\n<b>What they said</b> \\n \\nEvery batsman thinks that an off-spinner is there to hit. As a batsman, even I think so when I face an off-spinner. I think there is a chance for two sixes. When I am bowling, I think as a batsman to survive. If the conditions are bad, not much would be in my hands. In that case, I attack the batsman, try to take the wicket. To survive, I try yorkers, wide yorkers, or bowl slow. I try my best to survive those six balls - <b>Mohammad Nabi</b>, MI spinner, on challenges before off-spinners in IPL \\n \\nSo not by design, but more through results, it's worked out to a couple of successful franchises that have had opportunities to push ahead of the others. But look, in saying that every time you play a team these days, it feels like a massive rivalry or a massive game. So we try to keep things reasonably simple and part of the process of this game is to keep emotions down and just enjoy the occasion for what it is - <b>Stephen Fleming</b>, CSK coach, on MI-CSK rivalry</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713017537393,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713017534583,
    "commText": "<p><b>Chennai Super Kings</b> Squad: Rachin Ravindra, Ruturaj Gaikwad(c), Daryl Mitchell, Shivam Dube, MS Dhoni(w), Ajinkya Rahane, Sameer Rizvi, Ravindra Jadeja, Shardul Thakur, Mustafizur Rahman, Tushar Deshpande, Maheesh Theekshana, Moeen Ali, Shaik Rasheed, Nishant Sindhu, Mitchell Santner, Deepak Chahar, Mukesh Choudhary, Devon Conway, Ajay Jadav Mandal, Prashant Solanki, Simarjeet Singh, RS Hangargekar, Matheesha Pathirana, Aravelly Avanish</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713017428777,
    "commText": "<p><b>Mumbai Indians</b> Squad: Ishan Kishan(w), Rohit Sharma, Suryakumar Yadav, Hardik Pandya(c), Tilak Varma, Tim David, Romario Shepherd, Mohammad Nabi, Shreyas Gopal, Jasprit Bumrah, Gerald Coetzee, Akash Madhwal, Dewald Brevis, Naman Dhir, Nehal Wadhera, Harvik Desai, Piyush Chawla, Kwena Maphaka, Shams Mulani, Luke Wood, Arjun Tendulkar, Kumar Kartikeya, Shivalik Sharma, Nuwan Thushara, Anshul Kamboj</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]