[
  {
    "timestamp": 1714744670222,
    "commText": "<p>The players and the umpires stride out to the middle. The atmosphere is absolutely electrifying at the Wankhede as always. Narine and Salt have been in stellar form but they have to cope up with the challenge of facing Bumrah in the powerplay. There will be some swing for the new-ball bowlers. Thushara to start off with the new ball. A slip in place. Here we go...</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714744309795,
    "commText": "<p>We haven't made any change to our Expert XI. Head over and have a look at what we have suggested for this game</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743675352,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743576834,
    "commText": "<p><b>Kolkata Knight Riders Impact Subs:</b> Anukul Roy, Manish Pandey, Srikar Bharat, Sherfane Rutherford, Chetan Sakariya</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743554893,
    "commText": "<p>Seems like Rohit will be the Impact Sub for MI when they chase</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743542638,
    "commText": "<p><b>Mumbai Indians Impact Subs:</b> Rohit Sharma, Shams Mulani, Shivalik Sharma, Dewald Brevis, Romario Shepherd.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743457319,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743455676,
    "commText": "<p><b>Mumbai Indians</b> (Playing XI): Ishan Kishan(w), Suryakumar Yadav, Tilak Varma, Nehal Wadhera, Hardik Pandya(c), Naman Dhir, Tim David, Gerald Coetzee, Piyush Chawla, Jasprit Bumrah, Nuwan Thushara</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743393271,
    "commText": "<p><b>Kolkata Knight Riders</b> (Playing XI): Philip Salt(w), Sunil Narine, Angkrish Raghuvanshi, Shreyas Iyer(c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Varun Chakaravarthy</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743393144,
    "commText": "<p><b>Kolkata Knight Riders</b> (Playing XI): Philip Salt(w), Sunil Narine, Angkrish Raghuvanshi, Shreyas Iyer(c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Varun Chakaravarthy</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743140379,
    "commText": "<p><b>Shreyas Iyer: </b> It's always about doing the small things well, obviously the dew is a factor but we have to keep that out of mind. The message is clear, each one of them knows their role and responsibility. Batting first we are going with the<b> same team.</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714743029795,
    "commText": "<p><b>Hardik Pandya:</b> We will bowl. It's always about playing for pride, it looks quite tough for us but at the same time, we want to play good cricket, feels good to be back home. Looks like a good track, it's a fresh wicket so thought that bowling first will be good. Only one change, <b>Naman Dhir</b> comes in place of Nabi.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714742895010,
    "commText": "<p><b>Mumbai Indians have won the toss and have opted to field</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714742760224,
    "commText": "<p><b>Andre Russell:</b> Feeling good, based on the preperation, I am feeling like every other game before. Everyone is ready, we know that it’s going to be a tough game tonight so ready for the challenge. I’m always ready to bowl, based on the amount of option the skipper has, that’s the reason why I may not bowl my 4 but if it’s 1 or 2 overs, I’m ready to give it my best shot. We have a lot of options in our team, so can’t complain, whoever gets the responsibility should get the job done, once they are getting the job done, happy days. I really enjoy, I have a lot of good memories here, a lot of good innings here, so I hope I can refresh my memory with a good one tonight.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714742228717,
    "commText": "<p>Let’s reflect on the boundary sizes first – to my right it's 60m and to my left, it’s 65m, down the ground it's 74m. I think you got two different games from two different ends, if you look at this end it is quite dry than what we have come to expect, still there is plenty of runs to be had, I think captains will utilise spin bowling down into this because it’s quite dry and it might grip. But, if we continue to walk up this pitch, we can see that the grass covering is a lot more even so the fast bowlers might get more pace and bite bowling from this end up here. So, from a batting perspective, you have to see which overs you are going to capitalize on, whom you are going to attack. I spoke to the groundsmen and they are expecting some dew tonight so the toss is important. The average first innings score here in the four matches this season is 190. It’s not humid, there is no breeze around so I still think these are good batting conditions and I feel 190 is going to be below-par on this pitch, reckon<b> Michael Clarke and Daren Ganga</b>, in their pitch report.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714741276803,
    "commText": "<p>However, the Wankhede hasn’t been a happy-hunting ground for KKR – they have a horrid record here with only one win and nine losses against MI. Their openers, Narine and Salt, have been in superlative form and that will boost their confidence. After having played five games in a row at the Eden Gardens, the visitors need to adapt quickly but it’s not going to be easy. Harshit Rana who has done well for them will miss this game due to a Code of Conduct breach. Two wins in the remaining five league games will probably be enough for the men in purple and gold to seal a playoff spot. Can KKR fight their demons and conquer Wankhede tonight? Or will MI get back to winning ways after losing 3 games in a row? Stick around for the toss and team lineups...</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714658736204,
    "commText": "<p><b>6:30 pm IST:</b> Mumbai Indians are back to the Wankhede after having played four games on the road. They have had a poor season so far and are placed at the 9th position on the points table. Even if they win their last 4 league games, they will reach 14 points and that will probably not be enough to take them to the playoffs. The fact that they have nothing to lose and also returning back home will provide them some solace. They have misfired as a unit but the opportunity to play with freedom might just be the tonic they need. Meanwhile, Kolkata Knight Riders have been quite consistent this season and are placed at the 2nd position.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714658736184,
    "commText": "<p><b>Preview</b> by <b>Vijay Tagore</b> \\n \\nTwo Englishmen with identical initials - JB and JB - could have altered the fate of Kolkata Knight Riders' season. Had it not been for the extraordinary centuries by Jos Buttler (107 not out) of Rajasthan Royals and Jonny Bairstow (108 not out) of Punjab Kings, the Knight Riders might have secured their playoff spot by now. However, they succumbed to a record-breaking chase (262 for 2) against Punjab and failed to defend a formidable 222 against the Royals, leaving them jostling for a place in the final four. \\n \\nWith a need for two victories from their remaining five games, the Knight Riders stand on the brink of playoffs but still with much work to do to seal it. Moreover, facing Mumbai Indians twice, against whom they've historically struggled, especially at the Wankhede, poses a difficult challenge. Despite maintaining the No 2 position consistently since the start of the IPL, securing two wins in their final five matches presents both an opportunity as well as a challenge. Their fate remains uncertain. \\n \\nReflecting the uncertainty of the team's fate of reaching the play-offs, KKR's assistant coach Abhishek Nayar said, \"I wish I could tell you that 16 is good or 14 is good, but we never know. I think this is a competition which is one of the toughest in the world. It's two-month long. And it's not so much about how you play the first half, but it's also as important to play the second. So just in terms of points, we've seen teams that have been at the bottom of the table do really well against table toppers. So it's very hard to say if this is going to be safe and this is enough. I think the more the merrier for any team.\" \\n \\nThe Knight Riders' batting has exploded spectacularly this season, with Phil Salt and Sunil Narine providing platforms for formidable totals. However, their bowling hasn't quite matched up, despite the presence of the irresistible Mitchell Starc, IPL's most expensive buy (INR 24.75 crore). \\n \\n\"I believe our bowling could have performed better. 'Below par' wouldn't be the term I'd use,\" Nayar remarked, coming to the defence of the Australian pace bowler, who has managed a less-than-impressive economy rate of over 11, managing just seven wickets across eight games. Starc would be a fitting match-up for Rohit Sharma at the top of the order of MI. The Mumbai Indians opener has got out five times to left-arm pacers this season and the Aussie would be an ideal candidate to exploit the situation there, if there were to be one. \\n \\nMumbai Indians have nothing to lose as they can reach a maximum of 14 points in the best-case scenario (of winning the remaining four games), an unlikely proposition for earning a knockout berth. It will, however, be another test for skipper Hardik Pandya, who has avoided bowling all four overs in all games (he bowled out his quota only in three of the 10 games he played), to prove his full fitness. But with nothing to lose, they can dangerously be the party-poopers for the Knight Riders, who have been one of the better teams this IPL season. \\n \\n<b>When:</b> Mumbai Indians vs Kolkata Knight Riders, IPL 2024, May 3, 19:30 IST \\n \\n<b>Where:</b> Wankhede Stadium, Mumbai \\n \\n<b>What to expect:</b> Should be a high-scoring tough contest with KKR striving for a playoff berth and MI with nothing to lose. Toss will be crucial in the context of dew. \\n \\n<b>Head to Head:</b> MI 23 - KKR 9. The overwhelming numbers in favour of the home teams look even more one-sided at the venue with MI leading KKR 9-1. \\n \\n<b>Team Watch:</b> \\n \\n<b>Mumbai Indians</b> \\n \\n<b>Injuries/Unavailability:</b> Have no reported case of an injury to any of their players. \\n \\n<b>Tactics & Matchups:</b> Jasprit Bumrah should be the one to bowl up front to make an initial dent into the batting of KKR whose openers, Phil Salt and Sunil Narine, have been in fearsome form. They may bring in Kumar Kartikeya in place of one of the spinners. \\n \\n<b>Probable XI:</b> Ishan Kishan (wk), Rohit Sharma, Suryakumar Yadav, Tilak Varma, Hardik Pandya (c), Nehal Wadhera, Tim David, Mohammad Nabi, Gerald Coetzee, Kumar Kartikeya, Jasprit Bumrah (Impact Substitute: Naman Dhir) \\n \\n<b>Kolkata Knight Riders</b> \\n \\n<b>Injuries/Unavailability:</b> Have no injury concerns; Harshit Rana is unavailable due to a Code of Conduct breach. \\n \\n<b>Tactics & Matchups:</b> Mitchell Starc should be bowling to Rohit Sharma, who has shown vulnerability to left-arm pacers this season, having got out five times in 10 games. \\n \\n<b>Probable XI:</b> Philip Salt (wk), Sunil Narine, Venkatesh Iyer, Shreyas Iyer (c), Andre Russell, Rinku Singh, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Anukul Roy, Varun Chakaravarthy. (Impact Substitute: Angkrish Raghuvanshi) \\n \\n<b>Did you know?</b> \\n \\n- No side has beaten an opponent in the IPL as often as MI have beaten KKR - 23 times \\n \\n- MI have lost 19 wickets in Powerplay - the second most by any side behind Delhi Capitals' 21 \\n \\n<b>What they said:</b> \\n \\n\"We have to play to win and that's the way we play cricket, to win each game. So it doesn't matter how many points we can get, we're going to play each game and try to win as big as possible and if there is opportunity, you know, that's the only way we can actually get opportunities if we win the games.\" - Romario Shepherd on MI's approach in the hopeless situation of qualifying for play-offs. \\n \\n\"It's a very personal bond. It is best understood by those two people. It is not necessarily a coaching thing, it can also be a trust thing. Sometimes just having someone in the dugout and having that aura around you can have a positive effect on the player. There can be many other things, like Gauti telling him to go there and play with freedom. Gautam Gambhir is Kolkata's golden boy, he has come and won us two championships as captain, and Sunil Narine has been part of that journey. There's always going to be a certain memory that Sunny taps into. It's a deeper bond that both of them have and that is reflecting in Sunny's batting. He understands and trusts the guy trusts everything I am gonna do, win or lose, succeed or rail.\" - <b>KKR asst coach Abhishek Nayar on the bond between Gautam Gambhir and Sunil Narine</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714658736174,
    "commText": "<p><b>Squads:::</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714658731571,
    "commText": "<p><b>Kolkata Knight Riders</b> Squad: Philip Salt(w), Sunil Narine, Rinku Singh, Shreyas Iyer(c), Venkatesh Iyer, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Harshit Rana, Varun Chakaravarthy, Angkrish Raghuvanshi, Suyash Sharma, Anukul Roy, Manish Pandey, Rahmanullah Gurbaz, Dushmantha Chameera, Allah Ghazanfar, Sakib Hussain, Sherfane Rutherford, Chetan Sakariya, Nitish Rana, Srikar Bharat</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714658623786,
    "commText": "<p><b>Mumbai Indians</b> Squad: Ishan Kishan(w), Rohit Sharma, Suryakumar Yadav, Tilak Varma, Hardik Pandya(c), Nehal Wadhera, Tim David, Mohammad Nabi, Gerald Coetzee, Piyush Chawla, Jasprit Bumrah, Nuwan Thushara, Naman Dhir, Shams Mulani, Dewald Brevis, Kumar Kartikeya, Luke Wood, Shreyas Gopal, Harvik Desai, Romario Shepherd, Arjun Tendulkar, Shivalik Sharma, Anshul Kamboj, Akash Madhwal, Kwena Maphaka</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]