[
  {
    "timestamp": 1716299879958,
    "commText": "<p>Right! The fireworks go up as the players stride out to the centre. Shreyas Iyer having a conflab with Starc and Rinku regarding field placements. As ever, the swinging Mitch Starc to kickstart proceedings with the new ball. <b>One slip in place.</b> Off we go...</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716299335886,
    "commText": "<p><b>Abhishek Sharma:</b> (On the excitement of playing in the playoffs) As an individual, it happens a lot but the way the environment is in the team, we all are taking it as a next game and it’s a special thing of a champion team. We knew our roles very well from the start, we decided to play aggressive cricket and dominate be it in batting or bowling. The management is really supportive and that helps us to play our natural game. It feels good to watch their match as they have a very competitive team, they are without one of their players so that can be an advantage for us as we are playing with the same combination. It’s mixed soil, black and red and that suits our team, whenever we come to Ahmedabad it’s usually a high-scoring game.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298755593,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298683729,
    "commText": "<p><b>Kolkata Knight Riders Impact Subs: </b>Anukul Roy, Manish Pandey, Nitish Rana, KS Bharat, Sherfaine Rutherford</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298677185,
    "commText": "<p><b>Sunrisers Hyderabad Impact Subs:</b> Sanvir Singh, Umran Malik, Glenn Phillips, Washington Sundar, Jaydev Unadkat</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298627832,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298626619,
    "commText": "<p><b>Kolkata Knight Riders</b> (Playing XI): Rahmanullah Gurbaz(w), Sunil Narine, Venkatesh Iyer, Shreyas Iyer(c), Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Harshit Rana, Varun Chakaravarthy</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298623802,
    "commText": "<p><b>Sunrisers Hyderabad</b> (Playing XI): Travis Head, Abhishek Sharma, Rahul Tripathi, Nitish Reddy, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Vijayakanth Viyaskanth, T Natarajan</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298312995,
    "commText": "<p><b>Shreyas Iyer:</b> I would have loved to bowl. I had a chat with the curator and he said it's a mixed soil, let's see how it plays, hoping for a good game. Important that we keep the momentum going and stay in the present. Great achievement (finising at the top of the table) and everyone is proud of it, we are taking one match at a time and we need to be positive about what's going to happen here. We are going with the <b>same team.</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716298253170,
    "commText": "<p><b>Cummins:</b> We gonna have a bat, looks like a good wicket and expect a high-scoring game. The batting group has been amazing for us and hopefully more of the same tonight. We are playing pretty much the <b>same eleven as the last game</b>.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716297920895,
    "commText": "<p><b>Sunrisers Hyderabad have won the toss and have opted to bat</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716297588619,
    "commText": "<p><b>Andre Russell:</b> Feeling very good, I think we have been having a tremendous season, this is where all the teams strive to reach, we have a good thing going, I hope tonight we can keep playing some good positive cricket. (Having not played a game after 11th May due to inclement weather) We are still focused, we have no control over the weather, we were prepared to play warm-up and everything, the energy was still there. It looks like it’s going to be an amazing night tonight, no weather around, we are ready to play some cricket. I’m in good nick, I have been hitting the ball well, I missed out on a few innings where I could have pushed the score more. With the balance in the team, it gives me the confidence to go out and play my shots. We have Rinku and Ramandeep behind, who can hit sixes and do what I do, it gives me freedom. Bowling as well, I’m happy to come on when the captain needs me and I’m doing a decent job with the ball. We have done some homework and we need to keep things simple. When you are under the pump as a bowling group, the opponent want you to try too many things and with a six-hitting team like this, they expect you to do something different. Once we stick to our lengths, big ground here tonight, we are going to utilise as much as we can and restrict them.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716296879437,
    "commText": "<p><b>Pitch and dimensions:</b> The outfield is green and lush. The square boundaries are 63 metres each while it is 70 metres down the ground. The pitch looks a touch dry. Will suit bowlers who will use the off-pace deliveries. In some areas, around the good length, there's a bit of moisture, but it is hard. The power-hitters will play a major role here, looks like a good batting wicket. Won't spin much, reckons Matthew Hayden.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716295512337,
    "commText": "<p><b>What happened the last time these two sides met?</b> Mayank Agarwal received a flying kiss from Harshit Rana. That's how most SRH fans would like to remember, as the contest saw both teams pushed into a nervy corner for most parts of the game. In the end, when SRH had a mountain to climb in the last 4 overs, Klaasen went berserk and nearly pulled off the chase for his side. Inexperienced and under pressure, Harshit Rana didn't panic as he bowled a splendid final over to help his side get off to a winning start to the season. It was that victory that started KKR's rise and they barely looked back after that, with 9 wins from 14 games (2 were washed out).</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716294987448,
    "commText": "<p>Standing in their way are the men from the city of joy, the <b>Kolkata Knight Riders</b>. A team that has a rich history of making 6 playoffs from 8 seasons (2011-2018). Quite interestingly, KKR never finished at the bottom of the table and to put the icing on the cake, this is the first team they finished number one on the table in their history. And a reminder that, this is only their second entry into playoffs in the last 6 seasons. The last time they made it to the playoffs, they reached the IPL final only to end runners up to CSK. Can they go one step better this time around and bring home their 3rd title? It's been 10 years since they won the trophy. And the \"I0$\" fans have an extra reason to cheer this season. Gautam Gambhir, the mentor of KKR. His association with the franchise holds a special slot for every Purple fan. Is this the season for KKR?</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716294442999,
    "commText": "<p><b>Hurt, bruised and hungry</b> - The mood of all SRH fans over the last three years. While the fact that their franchise didn't make it to the playoffs stung real hard, it's the 'I0$' tag (2021 & 2023) that left the biggest scar. How could a franchise that once had a history of \"five successive playoff seasons\" sink that low? David Warner controversy. Change of captaincy. Change of coaches. Change of jersey. Team going from bad to worse with each passing season. It surely wasn't a pleasant phase for any Sunrisers' fan. And here comes the best part. Despite all those lows, the fans turned in great numbers this season in Hyderabad and rallied behind the team like those 3 years never existed. One of the promising superstars of Indian cricket, Abhishek Sharma, was so moved (acknowledged it on SM) by the support he received from the SRH fans, that he along with many other players made sure they offered something in return for the fans by <b>winning 5 out of 7</b> (one game was a washout) home games this year. Now that they made it to the playoffs, how about winning the qualifier 1 and claim the \"finals slot\" for the third time in their 12-year history?</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716294001109,
    "commText": "<p><b>17:50 local, 12:20 GMT:</b> Hello, there? We have officially entered the <b>playoff zone</b> in the IPL. This territory is quite slippery, mind, and teams that blink will have to pay a heavy price. It's I0$ phase of the tournament where players' mental strength and management's composure gain greater attention than ever. Righto! Time to switch on the crunch-gear, then I1$</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716214328102,
    "commText": "<p><b>Preview</b> by <b>Vijay Tagore</b> \\n \\nAhmedabad has been burning and boiling, with the mercury soaring above 45 degrees celsius lately, but amusingly enough, that may not be all bad news. With a slew of recent Indian Premier League matches affected by rain, the current trend of scorching heat is unlikely to be unwelcomed by those associated with the IPL. Ironically, it may offer a refreshing relief to the two remaining teams at the venue. \\n \\nThe weather forecast for both Tuesday and Wednesday, when Qualifier 1 and the Eliminator will be played, is for more of the same sweltering heat, ensuring the matches proceed without interruption. According to the local Meteorological Department, the weather will be 'hot with plenty of sun' - a massive understatement of the season. The heat has been both infernal and searing. But just try asking the Kolkata Knight Riders, who experienced two consecutive washouts, including one at the Narendra Modi Stadium on May 13. They may not mind the heat. \\n \\nHeading into a crucial fixture, the Knight Riders, two-time champions who finished at the top of the points table for the first time in 17 seasons, are short on match practice, having last played a full 40-over game on May 5. This could be a concern for Shreyas Iyer's side, who have engineered and pioneered a new approach to the IPL, almost similar to the style of their opponents, Sunrisers Hyderabad, in Qualifier 1. Both teams have redefined the game with a high-risk, no-holds-barred, take-no-prisoners attitude. \\n \\nThus, it will be a clash of two bold, fearless, in-form teams with a slight edge tilted towards the Hyderabad side, who are also looking for their third IPL championship. Kolkata have their season's regular opener, Phil Salt, who combined well with other opener Sunil Narine, missing since the Englishman has left for home for national duties. Narine may partner Rahmanullah Gurbaz in the game. The Afghan is yet to hit a ball in a game this season. \\n \\nOn the other hand, SRH's go-for-broke opening combination of Travis Head and Abhishek Sharma is very much intact. Strange things have certainly happened in cricket, particularly in the IPL, but the success or failure of the opening combinations of the sides could determine the result of the game. \\n \\nThen there is this bowling factor that gives Pat Cummins's side some advantage. The Hyderabad team has largely depended on its pacers - T Natarajan, Bhuvneshwar Kumar and Cummins himself with Jaydev Unadkat and Marco Jansen to fall back on - and the Narendra Modi Stadium has mostly aided the pacers. The Knight Riders' arsenal has been their spinners, chiefly Narine and Varun Chakaravarthy. \\n \\nA big plus for Hyderabad has been that Bhuvneshwar Kumar, who opens the attack, had been off colour initially but has found his mojo in the second half of the league while the Knight Riders have not exactly had their spearhead, Mitchell Starc, firing on all cylinders. Kolkata will need Starc (12 wickets in 11 innings), the costliest buy in the IPL history, to come to the party. If that's not enough, KKR need to be wary of the happy memories that Cummins and Head have at this venue - of winning the ODI World Cup last year. \\n \\nBut the only issue that may not work for SRH is the neutrality in the stands. Cummins had famously said before the World Cup final last year that nothing is more satisfying than silencing 1.3 lakh people. There may be as many people on Tuesday night as well, but they may not support the opposition as fervently as they did on November 19, 2023. \\n \\n<b>When:</b> Kolkata Knight Riders vs SunRisers Hyderabad, IPL 2024, May 21, 19:30 IST \\n \\n<b>Where:</b> Narendra Modi Stadium, Ahmedabad \\n \\n<b>What to expect:</b> It is not a do-or- die game but neither team wants to be in that situation as a defeat will put them there. With the pitch expected to assist the batters, it will be a high-scoring game with the captain winning the toss choosing to field, as most captains have done this season. \\n \\n<b>Head to Head:</b> KKR 17 - 9 SRH. The Knight Riders have been even more dominating since 2020, having won seven of their nine face-offs. The playoffs records of the two sides are almost similar, with KKR winning eight and losing five while SRH have won 5 and lost six. \\n \\n<b>Team Watch:</b> \\n \\n<b>Kolkata Knight Riders</b> \\n \\n<b>Injuries/Availability:</b> All players, barring Phil Salt, are available. \\n \\n<b>Tactics and Match-Ups:</b> Travis Head and Abhishek Sharma are among the rare few batters who have enjoyed an upperhand in the battle against Sunil Narine. The veteran spinner could be held back to be utilised in the middle and late overs in a bid to control Heinrich Klassen, who enjoys a favourable matchup against the other KKR spinner - Varun Chakravarthy. \\n \\nAndre Russell has dismissed Abhishek twice in 10 balls, and conceded only 11 runs. Don't be surprised if the West Indian has an early go against the in-form southpaw \\n \\n<b>Probable XII:</b> Rahamanullah Gurbaz (wk), Sunil Narine, Angkrish Raghuvanshi/Nitish Rana, Shreyas Iyer (c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh , Mitchell Starc, Harshit Rana, Varun Chakaravarthy [Impact substitute: Vaibhav Arora] \\n \\n<b>Sunrisers Hyderabad</b> \\n \\n<b>Injuries/Availability:</b> They have a clean slate on this front \\n \\n<b>Tactics and Match-Ups:</b> Andre Russell hasn't enjoyed a high-scoring rate in Ahmedabad, striking at just under 140 in four innings at the venue. SRH bowlers will look to force him to hit towards the long square boundaries \\n \\n<b>Probable XII:</b> Travis Head, Abhishek Sharma, Nitish Reddy, Rahul Tripathi, Heinrich Klaasen (wk), Abdul Samad, Shahbaz Ahmed, Pat Cummins (c), Sanvir Singh, Bhuvneshwar Kumar, Vijayakanth Viyaskanth [Impact substitute: T Natarajan] \\n \\n<b>Did you know:</b> \\n \\n- Sunil Narine is yet to score a run in an IPL game in Ahmedabad, having been dismissed thrice on ducks previously \\n \\n- In the four IPL matches Andre Russell has played in Ahmedabad, he hasn't picked up a wicket \\n \\n- Bhuvneshwar Kumar has snapped nine wickets in three games in Ahmedabad, and conceded at less than run-a-ball</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716214328092,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716214326192,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Travis Head, Abhishek Sharma, Rahul Tripathi, Nitish Reddy, Heinrich Klaasen(w), Shahbaz Ahmed, Abdul Samad, Sanvir Singh, Pat Cummins(c), Bhuvneshwar Kumar, Vijayakanth Viyaskanth, T Natarajan, Umran Malik, Glenn Phillips, Washington Sundar, Jaydev Unadkat, Mayank Agarwal, Aiden Markram, Anmolpreet Singh, Upendra Yadav, Mayank Markande, Jhatavedh Subramanyan, Fazalhaq Farooqi, Marco Jansen, Akash Maharaj Singh</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1716214129511,
    "commText": "<p><b>Kolkata Knight Riders</b> Squad: Rahmanullah Gurbaz(w), Sunil Narine, Venkatesh Iyer, Shreyas Iyer(c), Rinku Singh, Andre Russell, Ramandeep Singh, Anukul Roy, Mitchell Starc, Harshit Rana, Varun Chakaravarthy, Vaibhav Arora, Manish Pandey, Nitish Rana, Srikar Bharat, Sherfane Rutherford, Dushmantha Chameera, Angkrish Raghuvanshi, Sakib Hussain, Suyash Sharma, Allah Ghazanfar, Chetan Sakariya</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]