[
  {
    "timestamp": 1711807046821,
    "commText": "<p>It's time for action as the players walk out. Dhawan leads the Punjab Kings huddle and the two batters walk out - it's de Kock and KL Rahul. Sam Curran will take the new ball, a wide slip in place</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711806615803,
    "commText": "<p>We've made no changes to our pre-toss expert XI, but have made a captaincy change in accordance with the conditions. Have a look before you lock in your fantasy XI</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711806089245,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711806061180,
    "commText": "<p><b>Punjab Kings Subs:</b> Prabhsimran Singh, Rilee Roussouw, Tanay Thagarajan, Vidwath Kaverappa, Harpreet Bhatia</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711806026804,
    "commText": "<p><b>Lucknow Super Giants Subs:</b> Ashton Turner, Naveen-ul-Haq, Amit Mishra, Deepak Hooda, K Gowtham</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805930712,
    "commText": "<p>KL Rahul has been named in the playing XI and he could be opening as well. LSG have handed out debuts for Mayank Yadav and Manimaran Siddarth. No changes for Punjab Kings with Prabhsimran Singh their probable impact substitute for Arshdeep Singh. LSG have named only 3 overseas players in their playing XI - so, it could be Naveen-ul-Haq swapping with KL Rahul</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805868777,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805867014,
    "commText": "<p><b>Lucknow Super Giants</b> (Playing XI): Quinton de Kock(w), KL Rahul, Devdutt Padikkal, Ayush Badoni, Nicholas Pooran(c), Marcus Stoinis, Krunal Pandya, Ravi Bishnoi, Mohsin Khan, Mayank Yadav, Manimaran Siddharth</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805761991,
    "commText": "<p><b>Punjab Kings</b> (Playing XI): Shikhar Dhawan(c), Jonny Bairstow, Liam Livingstone, Sam Curran, Jitesh Sharma(w), Shashank Singh, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar, Arshdeep Singh</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805638550,
    "commText": "<p><b>Shikhar Dhawan</b> - We would have bowled first, lots of dew when we came to the ground (last night). Our lines cane be tight, while batting, we can't afford to lose wickets in clusters. It's still early in the tournament and we've spoken about that in the dressing room. We'll have to make the most of the powerplay. No changes for us.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805624134,
    "commText": "<p><b>Nicholas Pooran</b> - We'll bat first. Looks like a good track, runs on the board could be vital. KL is coming back from injury and we're looking to give him a break in such a long tournament, but he'll play as an impact player today. Everyone must take the opportunitiesand perform at their best.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805458225,
    "commText": "<p><b>Lucknow Super Giants have won the toss and have opted to bat</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805359194,
    "commText": "<p>Pooran has come out for the toss, so is KL Rahul missing out tonight?</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711805066460,
    "commText": "<p><b>Marcus Stoinis</b> - One game in the first couple of weeks I've been here, but we're back at home now and we'll look to make this into a fortress. We've had a good rest, some nice training and raring to go. The home teams have done well, it's importantfor us to do well in front of our fans, hopefully, we'll put up a good show this year after a pretty successful last year. The wicket looks a bit different, but we're confident of doing well. We played a couple of practice games - one on the red soil and another on the black soil, they both played slightly differently. There was a bit of nip and swing on the red soil pitch and it should be interesting to see how it plays tonight. I've known Justin Langer well, I've played under him for Australia as well as in club cricket. It's a calm dressing room, he gives confidence to the players and the assistant coaches. We've got a few new assistant coaches as well, so it's been a collaborative approach.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711804660224,
    "commText": "<p><b>Jonny Bairstow -</b> Expecting it (stadium) to be loud, expecting the pitch to a little bit. There might be a little grass on it. It (opening) changes from venue to venue in India. Generally players who play good cricket shots have been successful here, those who haven't been too inventive at the top, and players who haven't been too creative. We got to be switched on, the other night we got close to beating RCB, but we come into this game with a lot of confidence and positives from that game.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711804660214,
    "commText": "<p>The square boundaries are at 61m and 68m respectively, the straight boundary is at 76m. There is a bit more grass on this wicket, it's a bit more thicker, so there might be something in it for the pacers and the spinners. But it does look good for batting with no cracks. Dew could be a factor though and the captain winning the toss could bowl first, opine <b>BC Lara and Matthew Hayden</b>, in their pitch report</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711803016073,
    "commText": "<p><b>18:20 Local Time, 12:50 GMT, 18:20 IST:</b> Lucknow Super Giants lost their opening game of the season, but since then they've been well rested and are back at home for their second game of the season, against the Punjab Kings. Punjab started well with a win against Delhi Capitals, but the euphoria went down after they were dismantled by the Royal Challengers at the Chinnaswamy. They did show plenty of spunk in that game though and they'll have to find plenty of similar fight if they're to compete in the cauldron of Lucknow.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711722512722,
    "commText": "<p><b>Preview</b> \\n \\nIt's still early days in IPL 2024 and therefore, not a time for teams to take their position on the points table too seriously. Lucknow Super Giants find themselves at the bottom, although they've just played the solitary game in which they endured a narrow defeat to Rajasthan Royals. Meanwhile, Punjab Kings started the tournament with a morale-boosting win over Delhi Capitals but then snatched defeat from the jaws of victory against Royal Challengers Bangalore. \\n \\nKL Rahul's batting position was the major talking point for LSG pre-season, only for the skipper to walk out at his favourite opening spot. The tempo to his innings also was quite similar to what we've been used to from the Karnataka batter but he did look in good touch as the innings progressed. Whether he should continue to bat at the top or move down the order and let a more free-spirited batter take the opening spot continues to be up for debate. \\n \\nLSG have a lot of power in their ranks with the likes of Nicholas Pooran, Marcus Stoinis and Quinton de Kock but the first two continue to be underused. It is a point that they will need to address sooner than later. For Punjab, both games have gone largely to plan, except for the death bowling against RCB which cost Shikhar Dhawan's men a precious win. Compared to previous seasons, PBKS do have a much stronger bowling unit that has most bases covered. \\n \\nHowever, Harshal Patel's patchy form will be a concern, given that he is their designated death bowler. The batting continues to be Punjab's strong suite with a plethora of high-intent powerhitters in their line-up. \\n \\n<b>When:</b> Saturday, March 30 at 19:30 IST \\n \\n<b>Where:</b> Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow \\n \\n<b>What to expect:</b> In the 2023 season, Lucknow was the most bowling-friendly venue with an average first innings score of 148. Both pacers and spinners thrived in unison while batters generally found quickscoring to be a tough task. The surfaces were relaid recently but it is unlikely to be a free-stroking track for batters. \\n \\n<b>Head to Head:</b> The two teams have faced each other three times with LSG having a narrow 2-1 lead over PBKS. \\n \\n<b>Team watch:</b> \\n \\n<b>Lucknow Super Giants</b> \\n \\n<b>Injury/Availability:</b> The LSG camp are without of any injury concerns for this fixture and will have their full squad to pick from. \\n \\n<b>Tactics and Matchups:</b> This could be the game for Devdutt Padikkal to kick-start his LSG career. He has had the better of Kagiso Rabada (48 runs in 29 balls, 0 dismissals) and Sam Curran (32 runs in 20 balls, 0 dismissals). He has fallen thrice to Arshdeep Singh, but has also been able to take him on - smashing 49 off 31 balls faced against the left-armer. \\n \\n<b>Probable XI:</b> KL Rahul (c&wk), Quinton de Kock, Ayush Badoni, Nicholas Pooran, Marcus Stoinis/Kyle Mayers, Krunal Pandya, Ravi Bishnoi, Mohsin Khan, Yash Thakur, Naveen-ul-Haq. [Impact substitute: Deepak Hooda] \\n \\n<b>Punjab Kings</b> \\n \\n<b>Injury/Availability:</b> PBKS also have no concerns when it comes to the fitness of their squad for this fixture. \\n \\n<b>Tactics and Matchups:</b> \\n \\nWhile Padikkal has shown he can take on PBKS' PowerPlay bowlers, KL Rahul has historically been been slow to start off against them. He has scored just 17 runs off 18 balls faced from Arshdeep, while making just 29 off 24 against Sam Curran. \\n \\n<b>Probable XI:</b> Shikhar Dhawan(c), Jonny Bairstow, Prabhsimran Singh, Jitesh Sharma(wk), Sam Curran, Liam Livingstone, Shashank Singh, Harpreet Brar, Kagiso Rabada, Rahul Chahar. [Impact substitute: Arshdeep Singh] \\n \\n<b>What they said</b> \\n \\n\"The match went till the last over, at the end also we could have bowled a bit better.\" - Shikhar Dhawan is aware of where things have gone wrong for Punjab so far. \\n \\n\"We will learn from the mistakes. We need to find ways to win games of cricket.\" - KL Rahul is confident that his side can bounce back from the loss in the opening game.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711722509620,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711722509610,
    "commText": "<p><b>Lucknow Super Giants</b> Squad: Quinton de Kock, KL Rahul(w/c), Devdutt Padikkal, Ayush Badoni, Deepak Hooda, Marcus Stoinis, Nicholas Pooran, Krunal Pandya, Ravi Bishnoi, Mohsin Khan, Naveen-ul-Haq, Yash Thakur, Mayank Yadav, Prerak Mankad, Krishnappa Gowtham, Amit Mishra, David Willey, Kyle Mayers, Ashton Turner, Shivam Mavi, Manimaran Siddharth, Yudhvir Singh Charak, Arshad Khan, Shamar Joseph, Arshin Kulkarni</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1711722413221,
    "commText": "<p><b>Punjab Kings</b> Squad: Shikhar Dhawan(c), Jonny Bairstow, Prabhsimran Singh, Liam Livingstone, Sam Curran, Jitesh Sharma(w), Shashank Singh, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar, Arshdeep Singh, Rilee Rossouw, Tanay Thyagarajan, Harpreet Singh Bhatia, Vidhwath Kaverappa, Chris Woakes, Rishi Dhawan, Sikandar Raza, Ashutosh Sharma, Atharva Taide, Nathan Ellis, Shivam Singh, Prince Choudhary, Vishwanath Singh</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]