[
  {
    "timestamp": 1714918067019,
    "commText": "<p><b>Mumbai Indians</b> Squad: Ishan Kishan(w), Rohit Sharma, Naman Dhir, Suryakumar Yadav, Tilak Varma, Nehal Wadhera, Hardik Pandya(c), Tim David, Gerald Coetzee, Piyush Chawla, Jasprit Bumrah, Nuwan Thushara, Shams Mulani, Shivalik Sharma, Dewald Brevis, Romario Shepherd, Mohammad Nabi, Kumar Kartikeya, Luke Wood, Shreyas Gopal, Harvik Desai, Arjun Tendulkar, Anshul Kamboj, Akash Madhwal, Kwena Maphaka</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714918226719,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Travis Head, Abhishek Sharma, Anmolpreet Singh, Nitish Reddy, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Marco Jansen, Pat Cummins(c), Bhuvneshwar Kumar, T Natarajan, Jaydev Unadkat, Umran Malik, Mayank Markande, Aiden Markram, Sanvir Singh, Washington Sundar, Glenn Phillips, Rahul Tripathi, Mayank Agarwal, Upendra Yadav, Jhatavedh Subramanyan, Vijayakanth Viyaskanth, Fazalhaq Farooqi, Akash Maharaj Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714918231675,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714918231685,
    "commText": "<p><b>Preview by Vijay Tagore</b> \\n \\nBhvneshwar Kumar has been going at more than 13 an over in the death overs. It was largely due to a stroke of luck that Rovman Powell missed a full toss to hand SunRisers Hyderabad a one-run victory in the SRH's previous game. The win underscores the unpredictability or, as they say, the funny nature of the Twenty20 format. The Royals needed 12 runs off the last over, and two off the last ball. \\n \\nThat win may have put their campaign back on the rails. Still, SRH have been one of the standout sides this season with their explosive openers - Travis Head and Abhishek Sharma - setting the stage on fire and fast bowling unit, led by Pat Cummins, working like an optimally functioning apparatus. The best feature yet has been the inspiring captaincy of Cummins, who has managed to handle the young Indian players efficiently. \\n \\nA rare vulnerability for the Hyderabad side, as it's been observed, is their lack of a Plan B, rather contingencies. They normally rely heavily on aggressive batting, particularly through their openers. And in instances where this approach doesn't produce the expected yields, they've struggled to adapt and recalibrate their gameplan. Spin bowling has emerged as another notable weakness, despite the presence of legend Muttiah Muralitharan in the coaching staff. As they prepare to face Mumbai Indians at the Wankhede on Monday evening, these are areas the home team look to exploit. \\n \\nThe Wankhede Stadium has traditionally been a high-scoring pitch, except for the recent exception seen in the last game, versus Kolkata Knight Riders. It wouldn't be surprising if Monday's match turns into a run-fest, reminiscent of their season's initial encounter in Hyderabad where Mumbai Indians had mounted a strong assault on SRH total and had come close to chasing down the record-breaking total of 278. \\n \\nA lot will depend on the performance of the openers from both teams. \\n \\nFor Mumbai Indians, their openers have struggled to survive the PowerPlay overs in numerous games. Rohit Sharma and Ishan Kishan have been dismissed early too often, with Rohit falling six times and Ishan seven times within the first six overs. This inconsistency might be one of the key factors to their underwhelming performance this season. They may face a stronger challenge from SRH pacers, Bhuvneshwar Kumar, Pat Cummins, T Natarajan, Jaydev Unadkat and Marco Jansen, who have all been in good nick. How the MI openers, mainly Rohit, handle the quality SRH pacers will be a point of interest from MI point of view and Indian point of view as well. \\n \\nFor SRH, this match holds significant importance in their quest to qualify for the playoffs. Currently standing within striking distance with 12 points from 10 games, they require at least two more victories in their remaining four matches. As for MI, with their playoff chances now virtually over, the big question is whether they will opt to rest Jasprit Bumrah, arguably the standout bowler of this IPL season. \\n \\n<b>When:</b> Monday, May 6, 19:30 IST \\n \\n<b>Where:</b> Mumbai Indians vs Sunrisers Hyderabad, IPL 2024, Wankhede Stadium, Mumbai \\n \\n<b>What to expect:</b> A lot depends on the nature of the pitch. Otherwise a batting strip, the Wankhede surface was tricky to score in the last game a couple of nights ago. Easy or difficult to bat, the captain winning the toss will choose to field because of the dew factor.Anything less than 200 will not be easy to defend. \\n \\n<b>Head to Head:</b> MI 12 - 10 SRH. The face-off figures, overall, are not too stark but Mumbai Indians enjoy an edge at the Wankhede Stadium, 5-2. But the Surrisers have been a different side this season. \\n \\n<b>Team Watch:</b> \\n \\n<b>Mumbai Indians</b> \\n \\n<b>Injury/Availability:</b> No injury concerns for the home team. \\n \\n<b>Tactics & Matchups:</b> Skipper Hardik Pandya will prefer to bowl Jasprit Bumrah, the best bowler of the league, upfront given the explosive starts that SRH openers, Travis Head and Abhishek Sharma, have been providing. An early breakthrough will go a long way in restricting the visitors. \\n \\n<b>Probable XI:</b> Ishan Kishan (wk), Rohit Sharma, Suryakumar Yadav, Tilak Varma, Hardik Pandya (c), Naman Dhir, Tim David, Gerald Coetzee, Piyush Chawla, Jasprit Bumrah, Nuwan Thushara [Impact Substitute: Nehal Wadhera] \\n \\n<b>Sunrisers Hyderabad</b> \\n \\n<b>Injury/Availability:</b> All players are available for Pat Cummins. \\n \\nTactics & Matchups: With Bhuvneshwar Kumar, Pat Cummins, T Natarajan, Jaydev Unadkat and Marco Jansen all in fine form, the pace will be the main form of attack. \\n \\n<b>Probable XI:</b> Travis Head, Abhishek Sharma, Anmolpreet Singh, Heinrich Klaasen (wk), Nitish Reddy, Abdul Samad, Shahbaz Ahmed, Marco Jansen, Pat Cummins (c), Bhuvneshwar Kumar, T Natarajan [Impact Substitute: Jaydev Unadkat/Umran Malik] \\n \\n<b>What they said</b> \\n \\nWe have a huge fan base and they want to see us win. Our approach, from the beginning, has been to play each game to win and it will not be any different tomorrow - MI batter Naman Dhir, when asked about their approach to the game when their chances of a play-offs berth are bleak \\n \\nLook, that's, that's [Possibility of Umran Malik's inclusion]. That's always going to be an ongoing conversation. The way that we pick our team is very much a game-to-game situation. We know the quality that someone like Umran has and we're obviously at a new venue tomorrow, new opposition tomorrow, and I'm sure through the course of the day his name may come up in selection conversation - SRH pace bowling coach James Franklin on whether Umran Mailk will get to play a game</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715000528051,
    "commText": "<p><b>6.30pm local:</b> It was close to the start of the season when these two teams played each other the last time, and Sunrisers Hyderabad shattered the ceiling of highest totals in the IPL. Mumbai's season hasn't got much better from that point. They're languishing in 10th place and are all but out of this tournament, while the Sunrisers are in a hotly contested race for the playoffs. A win today would take them very close to qualification, and it's a venue that could well be to their liking. Hello and welcome to our coverage of Match 55 at the Wankhede.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715001035505,
    "commText": "<p><b>Pitch report:</b> Five games have been played here this season, 200 has been breached twice. Not a big ground, 61m and 66m square boundaries respectively, 72m down the ground. There's a nice layer of grass, it's a lot more consistent. Majority of the pitch looks nice and flat for batting apart from the full length area. The wicket looks rock hard with no moisture. Dew will probably play a part in the second innings. 200-plus total on the cards reckons Michael Clarke. We are in for some royal entertainment at the Wankhede tonight.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715001118027,
    "commText": "<p>Mumbai Indians are on a four-match losing run coming into this fixture. Runs have dried up at the top of the order, and the bowling hasn't been able to contain the opposition when Jasprit Bumrah isn't bowling. And if they aren't on top of their game today, things could get out of hand quickly against a powerpacked batting lineup.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715001607985,
    "commText": "<p>Apart from their batting exploits, SRH will also take heart with how Bhuvneshwar Kumar found his mojo again in the previous game, and the performances of Natarajan this season. Bhuvi could be key again on this pitch which generally offers movement with the new ball. Will be interesting to see if they stick to the combination they fielded against RR which had Jansen over Markram. We'll find out shortly.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715001817907,
    "commText": "<p><b>Travis Head:</b> I have a look at the wicket and see what presents itself and then just stay nice and relaxed and be ready when you need to go. You sum up everything, how the field’s set, who’s bowling, how they might try to get me out or restrict my scoring. I try and shut it off and remember it’s a little ball coming at me and try and concentrate on that. You don’t want to waste any opportunity in the powerplay. I’d love to come off every time but since I’ve come back to T20 cricket, I’ve sort of targeted coming good 1 in 3 games. Need to try and understand your gameplans and be 100% committed to that. You have to sum up what’s happening. We haven’t done well a couple of times while chasing but I don’t think there’s enough to see it as a trend. It’s not a big enough sample size so we’re not really worried about that, not much changes in the powerplay. I like that (Australian) kit, orange for a little bit and getting back in the green will be nice.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002027199,
    "commText": "<p><b>Mumbai Indians have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002236491,
    "commText": "<p><b>Hardik:</b> We're going to bowl first. Wicket looks fresh. Might have something with the new ball, want to exploit that. Anshul Kambhoj makes his debut. It's all about playing for pride, play for the badge. And for fans who have been with us through thick and thin.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002315151,
    "commText": "<p><b>Cummins:</b> Got Agarwal coming back to the side, will bat at three. Dew is a factor here, but we have been batting well. Got four games left, will probably need to win two of those. But we're not thinking that far ahead.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002491286,
    "commText": "<p><b>Mumbai Indians</b> (Playing XI): Ishan Kishan(w), Rohit Sharma, Naman Dhir, Suryakumar Yadav, Tilak Varma, Hardik Pandya(c), Tim David, Anshul Kamboj, Piyush Chawla, Jasprit Bumrah, Nuwan Thushara</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002543616,
    "commText": "<p><b>Sunrisers Hyderabad</b> (Playing XI): Abhishek Sharma, Travis Head, Mayank Agarwal, Nitish Reddy, Heinrich Klaasen(w), Abdul Samad, Shahbaz Ahmed, Marco Jansen, Pat Cummins(c), Bhuvneshwar Kumar, T Natarajan</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002545206,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002669316,
    "commText": "<p><b>Mumbai Indians Impact Subs:</b> Nehal Wadhera, Shams Mulani, Shivalik Sharma, Dewald Brevis, Romario Shepherd</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002748447,
    "commText": "<p><b>Sunrisers Hyderabad Impact Subs:</b> Mayank Markande, Glenn Phillips, Sanvir Singh, Jaydev Unadkat, Umran Malik,</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715002834533,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715003898331,
    "commText": "<p>MI are in a huddle and the players are clapping for Anshul Kamboj who makes his debut. Out walk the two openers. Looks like it's Thushara who will take the new ball. He had a brilliant outing in the previous game against KKR. Going to be a big challenge for him against this destructive opening pair. Third is in the ring, and both the deep fielders are on the leg-side. No slip in place. Here we go</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]