[
  {
    "timestamp": 1714054148181,
    "commText": "<p><b>Kolkata Knight Riders</b> Squad: Philip Salt(w), Sunil Narine, Angkrish Raghuvanshi, Venkatesh Iyer, Shreyas Iyer(c), Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Varun Chakaravarthy, Harshit Rana, Suyash Sharma, Anukul Roy, Manish Pandey, Vaibhav Arora, Rahmanullah Gurbaz, Allah Ghazanfar, Sakib Hussain, Sherfane Rutherford, Chetan Sakariya, Nitish Rana, Srikar Bharat, Dushmantha Chameera</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714054348545,
    "commText": "<p><b>Punjab Kings</b> Squad: Sam Curran(c), Prabhsimran Singh, Rilee Rossouw, Jitesh Sharma(w), Liam Livingstone, Shashank Singh, Ashutosh Sharma, Harpreet Singh Bhatia, Harpreet Brar, Harshal Patel, Kagiso Rabada, Arshdeep Singh, Rahul Chahar, Vidhwath Kaverappa, Atharva Taide, Shivam Singh, Rishi Dhawan, Jonny Bairstow, Nathan Ellis, Tanay Thyagarajan, Shikhar Dhawan, Chris Woakes, Sikandar Raza, Prince Choudhary, Vishwanath Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714054351835,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714054351845,
    "commText": "<p><b>Preview</b> \\n \\nThe IPL 2024 season has gone along similar lines to previous years for the Punjab franchise as their side battles inconsistencies to find themselves at the bottom half of the table. With just two wins from eight games, Punjab Kings aren't far away from elimination and it is in such a scenario that they are set to visit the Eden Gardens for the clash against Kolkata Knight Riders. PBKS may have lost six of their eight games but they've been in the contest till the end in most of these games, only to end on the wrong side of it more often than not. \\n \\nThe lack of form of the top-order will be in focus for Punjab whose batting has been carried by their middle-order players with sizeable contributions from Shashank Singh and Ashutosh Sharma. Against a potent KKR bowling unit, PBKS will need their batting to fire in unison to stand a chance, particularly with the batting-friendly conditions at the venue. In comparison to their batting, the Kings' bowling has fared better and performed better relatively through the season thus far. That said, there is a definite scope for improvement with the ball too. \\n \\nKolkata Knight Riders have been near flawless at home with three wins from four games. Their only defeat at the Eden Gardens came due to a miracle knock from Jos Buttler for Rajasthan Royals. The venue has seen extremely high scores and KKR's batters led by Sunil Narine have feasted on the surfaces offered to them. Phil Salt has also warmed up to his task at the top of the order with some extremely aggressive knocks. The emergence of Angkrish Raghuvanshi and Ramandeep Singh has allowed the trio of Shreyas Iyer, Rinku Singh and Andre Russell to bat with more freedom, given the new-found depth in KKR's batting. \\n \\nThe bowling department hasn't had the usual overdependence on the spin attack but that has also got to do with the nature of tracks on offer. Narine, though, has been his frugal self once more while Varun Chakravarthy has also endured a decent season thus far. The standout for KKR's bowling has been Harshit Rana who has shouldered the responsibility with aplomb, both with the new ball and also at the death. Russell has also been a key factor with the ball for Kolkata, with the all-rounder looking much fitter and quicker than in recent seasons. \\n \\nOn paper, both sides are well-rounded although KKR do hold a narrow edge due to their recent form. This promises to be a cracking encounter between two entertaining sides. \\n \\n<b>When:</b> Kolkata Knight Riders vs Sunrisers Hyderabad, April 26, 19:30 IST \\n \\n<b>Where:</b> Eden Gardens, Kolkata \\n \\n<b>What to expect:</b> The average score batting first at the Eden Gardens this season has been a shade under 204. Surfaces have allowed for fluent ball-striking and the short side boundaries have further aided the batters. Expect more of the same although the tracks could start to get drier due to the heat wave that's prevalent in the city. \\n \\n<b>Team watch</b> \\n \\n<b>Kolkata Knight Riders</b> \\n \\n<b>Injuries/Availability:</b> Mitchell Starc didn't bowl at all in the nets and the Australian pacer is allegedly nursing a finger injury that he picked up during the clash against Royal Challengers Bangalore. There is no confirmation yet about whether he'll be available or not for this clash. \\n \\n<b>Tactics and Matchups:</b> Andre Russell has a strike rate of 196.72 in the death overs (16-20) this season. He also has a favourable matchup against Kagiso Rabada and Sam Curran, striking at 222 and 233 respectively. The West Indian's battle against the two quicks could be a crucial sub-plot in this contest. If Starc isn't fit to play, Dushmantha Chameera could slot into the XI. The Sri Lankan fast bowler did have a decent stint in the nets as a prep for this possibility. \\n \\n<b>Probable XI:</b> Phil Salt (wk), Sunil Narine, Angkrish Raghuvanshi, Shreyas Iyer (c), Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc/Dushmantha Chameera, Varun Chakravarthy, Harshit Rana, Suyash Sharma. [Impact Player: Venkatesh Iyer] \\n \\n<b>Punjab Kings</b> \\n \\n<b>Injuries/Availability:</b> Shikhar Dhawan has been on the road to recovery and could make a return to the XI in this fixture. \\n \\n<b>Tactics and Matchups:</b> Shikhar Dhawan averages 52.5 against Sunil Narine, having been dismissed just twice in 91 deliveries by the spinner. Sam Curran strikes at 169 against the West Indian with just one dismissal. The two left-handers will be critical for PBKS to neutralise Narine's defensive bowling skills. If Dhawan returns to the XI, Harpreet Singh will make way for the skipper. There is also a possibility for Jonny Bairstow to slot back in, which would mean an axe for Rilee Rossouw. \\n \\n<b>Probable XI:</b> Shikhar Dhawan (c), Jonny Bairstow/Rilee Rossouw, Prabhsimran Singh, Sam Curran, Jitesh Sharma (wk), Liam Livingstone, Shashank Singh, Ashutosh Sharma, Harpreet Brar, Kagiso Rabada, Harshal Patel. [Impact player: Arshdeep Singh] \\n \\n<b>Did you know?</b> \\n \\n- 204 of the 252 runs scored by Phil Salt this season have come at Eden Gardens. The Englishman strikes at 184 in home games, compared to 145 away \\n \\n- Ashutosh Sharma has a strike rate of 198 in death overs (16-20) this season \\n \\n<b>What they said</b> \\n \\n\"Now we know what to do, we have to win every game.\" - <b>Sam Curran</b> knows his team's task ahead is simple yet complicated \\n \\n\"We need to stick to our routines and processes and see to it that we execute the things we want.\" - <b>Shreyas Iyer</b> wants KKR to keep doing the basics right</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714054351865,
    "commText": "<p><b>6:15 pm</b>: Two teams. Two opposite fates staring them. A win for KKR will take them closer to qualification. A loss for Punjab will get them closer to elimination. KKR have been authoritative. Punjab barring Ashutosh Sharma and Shashank Singh have been timid. They have lost umpteen close contests but one can't take help but feel that their foreign players just haven't performed to the hefty expectations that the IPL demands. Led by Iyer, KKR have found a way out to win close encounters. Someone or the other have stood up for them. But for Punjab, only Shashank and Ashutosh seem to be doing all the work. They have punched above their weights but that hasn't been enough. The injury to Dhawan also hasn't helped. Punjab as usual has been the case have blown more cold than hot. They have had their moments of hysteria, but it has been orchestrated by two newbies. Their seasoned campaigners have been hapless passengers who are witnessing their campaign go off the tracks. As said before, another loss and Punjab might be closer to exit. How can they turn it around? Firstly, they need their skipper back. Secondly, Bairstow might be asked to come back. They have to go for the jugular. What KKR need to guard against? Complacency! They look a well oiled unit. The rise of Harshit Rana and the brutality of Sunil Narine at the top has helped them cover most of the cases. They have tried to paper over the cracks which has been Starc's form, Venky Iyer's lack of consistency and their spinners not really coming to the party. But KKR still have been a force to reckon with and that ideally will continue.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714137214705,
    "commText": "<p>It's absolutely scorching at mid-40 degrees which will make it slightly uncomfortable for the players. 66m and 63m square boundaries while the straight boundary is at 73m. This is going to play as it has right through the season, it has plenty of pace and bounce on offer, the pitch itself is rock hard, the silt content on this surface is around 70% or more, in general it's around 50-60%. There are a lot of patches on a good length area on both ends, the grass is abrasive and the spinners could get some help, especially in the first innings. KKR's spinners should have an advantage as they rely on pace and lateral movement. It's a high scoring venue, there's no dew, the curators have confirmed the same. The captain winning the toss could still opt to chase first, reckon <b>Katey Martin and Deep Dasgupta</b>, in their pitch report.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714137419324,
    "commText": "<p><b>Ashutosh Sharma</b> - The experience has been very good, I'm enjoying right now and hopefully it'll stay the same during the rest of the season. Our only thought is to to have the right process (on his batting partnership with Shashank Singh), if we do that we'll definitely start winning. Not thinking about it., my job is only about batting and batting well for the team. I can't talk about the top-order failures, but I can assure that we'll do well tonight.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714137975358,
    "commText": "<p><b>Mitchell Starc</b> - Coming back (into the IPL), obviously to a different team. Getting to know about the youngsters in this KKR set-up, I have played against a few, but I've seen a lot of talent in this franchise, sharing my thoughts and answering their questions, it's been enjoyable. We know that the grounds in India are smaller when compared to back at home (in Australia), the wickets are generally pretty good throughout the game, the impact player rule as well. The batters are coming in with an intention to throw their bats around. You can see that impact in the Sunrisers with Heady at the top, just going out and trying to clear the infield. It's been a challenge to come here and play in the best T20 league in the world. The wickets have played differently in the day games and the night games - it does become easier to bat under the lights, it has been a learning curve. Playing in the heat is a part of the game, fortunately it's only 20 overs in the field and you can deal with it. Things have been going well so far (for KKR), different individuals have stood up, the next two home games are very important for us before we travel. So the two points today could be very important in that regard.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138175934,
    "commText": "<p>No Shikhar Dhawan still, Sam Curran walks out for Punjab Kings</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138275300,
    "commText": "<p><b>Punjab Kings have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138428989,
    "commText": "<p><b>Sam Curran</b> - We will have a bowl. We had 4 games at home, unfortunately lost all four, guys are ready for the away games though. We know what we need to do from here, just go out and play. Liam Livingstone misses out, Jonny Bairstow is back.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138445885,
    "commText": "<p><b>Shreyas Iyer</b> - We've had different players stepping up at different times, that's the thing I'm pleased about this season. Starcy got a cut on his finger in the last game, Dushmantha Chameera replaces him. Need a great start and then convert it into a big score, hoping to continue the same form and momentum.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138526342,
    "commText": "<p>Chameera gets his maiden KKR cap. He was part of the Lucknow Super Giants last season and Gautam Gambhir was there as well. Rahul Chahar is back in the playing XI for Punjab Kings with Prabhsimran Singh expected to be their impact sub. KKR can go in with either Suyash Sharma / Vaibhav Arora as their impact sub later on. We have made one change to our pre-toss expert XI. Have a look before finalizing your final fantasy picks</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138573061,
    "commText": "<p><b>Punjab Kings</b> (Playing XI): Jonny Bairstow, Sam Curran(c), Rilee Rossouw, Jitesh Sharma(w), Shashank Singh, Ashutosh Sharma, Harpreet Brar, Harshal Patel, Kagiso Rabada, Rahul Chahar, Arshdeep Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138620507,
    "commText": "<p><b>Kolkata Knight Riders</b> (Playing XI): Philip Salt(w), Sunil Narine, Angkrish Raghuvanshi, Shreyas Iyer(c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh, Dushmantha Chameera, Varun Chakaravarthy, Harshit Rana</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138622122,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138734189,
    "commText": "<p><b>Kolkata Knight Riders Subs:</b> Suyash Sharma, Anukul Roy, Manish Pandey, Vaibhav Arora, Rahmanullah Gurbaz</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138769796,
    "commText": "<p><b>Punjab Kings Impact Subs:</b> Prabhsimran Singh, Rishi Dhawan, Vidhwath Kaverappa, Shivam Singh, Prince Choudhary</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714138850844,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714139844548,
    "commText": "<p>Danny Morrison rings the bell and we're ready for the start of Match 42. Sam Curran leads his team out and they're followed by the two KKR openers - Salt and Narine. Curran takes the new ball, he has one slip in place</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]