[
  {
    "timestamp": 1714226145063,
    "commText": "<p>The players are out in the middle and we're ready for Match 44. Will it be another run-fest at the Ekana? Trent Boult with the new ball for the RoyalsTwo slips in place</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714225550965,
    "commText": "<p>Riyan Parag is on the bench and he should be RR's impact sub. For LSG, they do have a choice between Yudhvir Charak and Manimaran Siddarth. We've made one change to our pre-toss expert XI, have a look before finalizing your fantasy picks</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714225279528,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714225173130,
    "commText": "<p><b>Lucknow Super Giants Impact Subs:</b> Amit Mishra, Arshin Kulkarni, Krishnappa Gowtham, Yudhvir Singh Charak, Manimaran Siddharth</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714225166730,
    "commText": "<p><b>Rajasthan Royals Impact Subs:</b> Riyan Parag, Shubham Dubey, Navdeep Saini, Tom Kohler-Cadmore, Tanush Kotian</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714225020391,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714225019408,
    "commText": "<p><b>Rajasthan Royals</b> (Playing XI): Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Rovman Powell, Shimron Hetmyer, Dhruv Jurel, Ravichandran Ashwin, Trent Boult, Avesh Khan, Sandeep Sharma, Yuzvendra Chahal</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714224971010,
    "commText": "<p><b>Lucknow Super Giants</b> (Playing XI): Quinton de Kock, KL Rahul(w/c), Marcus Stoinis, Deepak Hooda, Nicholas Pooran, Ayush Badoni, Krunal Pandya, Matt Henry, Ravi Bishnoi, Mohsin Khan, Yash Thakur</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714224957707,
    "commText": "<p><b>KL Rahul</b> - The wicket is good, there's not much dew in Lucknow and the wicket will play well for the entire 40 overs. We'll need to play some good cricket. It's nice to get past 200, every team would like to do so, but the dimensions of this ground favours the bowlers a bit more and we've enjoyed it. No changes for us. Every player goes through a bit of time like that when you can't get runs ( asked about Padikkal's form). He looks good in the nets and he'll have to stay positive, you saw last night when Jonny came back after getting dropped and then getting a hundred.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714224912843,
    "commText": "<p><b>Sanju Samson</b> - We will bowl first. Looks like a decent wicket to bowl, but no guarantees. This season has been a bit different, some extra days in between games, that gives us time to rest and recover. We're playing the same team. IPL has been completely different, it's normal to get carried away looking at other teams, but the talk in our camp is to stay with the flow, we have been playing some good cricket and we need to continue doing so. I don't need to talk to him, he's been a top professional and has a big role in our plans (on Ravi Ashwin)</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714224675875,
    "commText": "<p><b>Rajasthan Royals have won the toss and have opted to field</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714224449638,
    "commText": "<p><b>Rovman Powell: </b>(On so many 200+ scores) I think it is getting a bit boring now. It is getting boring in the sense there is not a lot of challenge between bat and ball, it is predominantly one-sided in favor of batters. Hopefully, through the competition it can become a bit even. (On his prep) You don’t know the situations that you will get yourself in, so you still have to prepare in a wholistic way on what may happen in the game. Teams have started putting more emphasis on the middle phase. Teams get a lot more runs in the middle phase and not leave a lot for the last five. The thought process is to be aggressive throughout. (On playoffs) We had a talk today about staying in the moment, can’t look too far. We haven’t qualified yet and we know how important it is to finish in the top two. (On his bowling) In the last few games, I whispered in Sanju’s ears saying I can bowl an over or two. When every bowler is getting hit, you try your best to spread the leaks. Not ensure that only one bowler gets all the damage.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714223580804,
    "commText": "<p><b>Yash Thakur</b> - The mode of preparations change - it's very different when compared to domestic cricket, there are international players here, so we have to spend time and have chats with the bowling coach, make use of their experience well. I believe as a bowler you should have an economy rate in the region of 8-9 rpo, that range gives you an ideal chance of putting pressure and taking wickets. I don't think too much (about plans), but looking at the amount of runs being scored in the last few games, it also gives you a chance of taking wickets. I execute all my skills at the nets and before the match starts so that I'm well prepared to face the situation during the course of the game. I go by instincts, but I generally do some homework, look at where the batter is strong and what are his weak points.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714140340355,
    "commText": "<p>It's cooling down as we get into the evening here in Lucknow. 66m and 73m square boundaries while the straight boundary is massive at 80m. It's an incredible lush outfield, the wicket is made up of black clay and it means it's not a friend of the spinners There are large chink of cracks, so there could be some movement for the pacers. There is a nice grass covering and the brown patches are well rolled as well. Expect more runs, 200+ runs have been scored by the team batting first, the average 1st innings score has gone up to 170+ this season and we can expect runs on this surface, opine <b>Matthew Hayden and Ian Bishop</b>, in their pitch report</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714140340345,
    "commText": "<p><b>6:20 pm IST</b>: ​It has been a strange IPL, as the season moves towards the business end, the pitches tend to get weary and start to play slow, bringing all kinds of bowling into the equation. But come this year, despite the ongoing heat wave, the scores have kept rattling higher and higher. No other season has seen so many 200+ scores as this season, no other season has seen the bowlers reduced to a mere sideshow than IPL 2024. It's been a run-fest and no bowler has been spared, not even Jasprit Bumrah. A few days back, RCB nearly chased down KKR's 222, a few days later CSK's 210 was made to look inadequate, GT then nearly ran down DC's 224, but the cruellest blow came yesterday night when PBKS razed down KKR's mammoth 261 with 8 balls to spare. The bowlers have become mere sideshows this season and they'll hope that tonight's game in Lucknow doesn't go the same way. The Super Giants are riding high after completing a double over the Chennai Super Kings and they should be confident going into another home game. But they're up against table-toppers, Rajasthan Royals, who have barely put a foot wrong this season. They've a four point cushion at the top of the pile and have one leg in the playoffs, another win tonight and they could all but guarantee a top-2 finish as well. It's 1 v 3 tonight and we should be in for an exciting contest on the cards.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714140340325,
    "commText": "<p><b>Preview</b> by <b>Prakash Govindasreenivasan</b> \\n \\n<b>Lucknow Super Giants</b> must've flown into their home city on Wednesday with a chip on their shoulder and a spring to their step. Not often do you beat <b>CSK in Chennai,</b> matching them phase-for-phase and outplaying them at the death. It's the sort of win that can galvanise a side pushing for the <b>playoffs,</b> but their latest homecoming comes with a tale of caution. It's not just the quality of the opposition arriving on their shores, but the added trickery of the surface where they face-off. \\n \\nLSG, like CSK this year, have been tough to overcome in their home conditions. Except on the one occasion earlier, when <b>Delhi Capitals</b> chased successfully. <b>Rajasthan Royals, who would want to put one foot in the playoffs by the end of Saturday,</b> will have their interest piqued by the fact that the pitch picked for the game is the same as the Delhi fixture - a black soil surface that saw LSG suffer a middle-overs collapse. In the 10 overs after the PowerPlay in that game, LSG got 64/5 and eventually limped to an under-par total. <b>Kuldeep Yadav</b> did the bulk of the damage that day, turning the ball both ways to take out<b> Marcus Stoinis and Nicholas Pooran</b> off successive deliveries - the architects of the Chennai thriller. \\n \\nCoincidentally, <b>LSG's assistant coach Sridharan Sriram</b> said on the eve of the game that spinners need to be able to turn the ball both ways to avoid being predictable and be taken for plenty in the middle-overs where batters have continued to power through this season. Over to the likes of <b>R Ashwin and Ravi Bishnoi</b> then, to bring their variations and wrong 'uns to this phase to dictate the direction the game takes. <b>Yuzvendra Chahal</b> too could do with increasing the frequency of googlies, particularly to a batter like <b>Pooran</b> who can hurt them if he makes his way to the death overs. \\n \\nThe middle-overs (overs 7-16) numbers this season so far make for an interesting reading. Between them, <b>RR have struck at a better rate (144.76 to LSG's 138.79) while LSG have been tighter with the ball (Economy rate of 8.23 to RR's 8.92).</b> Brace yourself, then, for an intriguing middle-overs bout. \\n \\n<b>When:</b> Lucknow Super Giants vs Rajasthan Royals, <b>April 27, 2024, 07:30 PM IST</b> \\n \\n<b>Where:</b> Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow \\n \\n<b>What to expect:</b> Not a run-fest? The game on Saturday will be played <b>on one of the four black soil pitches at the venue.</b> It's the surface where LSG needed <b>Ayush Badoni's</b> 35-ball 55 to recover from the precarious position of 94/7 in the defeat to DC. \\n \\n<b>Head to head:</b> RR 3 - 1 LSG. Winners in all of these games batted first. \\n \\n<b>Team Watch</b> \\n \\n<b>Lucknow Super Giants</b> \\n \\n<b>Injuries/Availability:</b> <b>Mayank Yadav</b> bowled at full tilt on the eve of the game. LSG kept their cards close to their chest regarding his availability as <b>Sriram</b> reckoned \"he's pretty close\" to coming back. \\n \\n<b>Tactics & Matchups:</b> \\n \\nIf <b>Mayank</b> is ready to be back in the XI, LSG could take one of the two routes - bring him in for <b>Mohsin Khan or Yash Thakur,</b> or go with an all-India pace attack and make room for <b>Kyle Mayers</b> as the fourth-overseas pick in place of a misfiring <b>Devdutt Padikkal.</b> The West Indian is a good match-up option against <b>Yuzvendra Chahal,</b> who he has smashed for <b>23 runs in 10 balls in the IPL.</b> <b>Stoinis</b> batted at #3 and got a century in Chennai but <b>Mayers's</b> inclusion will give them a fiery and flexible 3-4-5 axis (Stoinis-Mayers-Pooran). \\n \\n<b>Probable XI:</b> Quinton de Kock, KL Rahul, Devdutt Padikkal/Kyle Mayers, Marcus Stoinis, Nicholas Pooran, Deepak Hooda, Ayush Badoni, Krunal Pandya, Ravi Bishnoi, Matt Henry/Mohsin Khan, Yash Thakur <b>[Impact substitute: Mayank Yadav]</b> \\n \\n<b>Rajasthan Royals</b> \\n \\n<b>Injuries/Availability:</b> No injuries to report for the table-toppers \\n \\n<b>Tactics & Matchups:</b> \\n \\n<b>Trent Boult</b> will be licking his lips at the prospect of bowling to some of the LSG batters - <b>Quinton de Kock, Ayush Badoni, Devdutt Padikkal</b> - who have all struggled against left-arm quicks this season. His duel against <b>KL Rahul</b> though, could tilt in the favour of the batter. The LSG captain has scored at <b>168.75 against left-arm pacers this season [108 Runs | 64 balls].</b> Against <b>Boult</b> in the IPL, he has <b>92 runs in 62 balls at 148.4,</b> but has been dismissed twice. <b>Sandeep Sharma</b> meanwhile, has been prolific against both of LSG's openers. <b>Quinton De Kock has 43 runs in 35 balls</b> - and two dismissals - against the pacer while <b>Rahul</b>, who has put concerns regarding his strike rate to rest this season, has scored at only <b>113.1 against him [83 balls | 73 runs | 1 dismissal].</b> \\n \\n<b>Ashwin</b> has been <b>expensive, and wicketless in the last six fixtures</b> but all will be forgotten if he continues his one-upmanship against <b>Stoinis and Pooran.</b> <b>Stoinis</b> has struggled against the offie in IPL, scoring <b>23 off 27 balls</b> and getting dismissed once. <b>Pooran</b> has 25 runs off as many balls and a dismissal. Even <b>Chahal</b> could be the way to go against the <b>Australian,</b> who has been dismissed five times by spinners this season. \\n \\n<b>Probable XI:</b> Yashasvi Jaiswal, Sanju Samson, Riyan Parag, Dhruv Jurel, Shimron Hetmyer, Rovman Powell, Ravichandran Ashwin, Trent Boult, Avesh Khan, Sandeep Sharma, Yuzvendra Chahal [Impact Substitute: Jos Buttler] \\n \\n<b>Did you know?</b> \\n \\n-<b> Nicholas Pooran</b> has hit nine fours and 11 sixes in the death overs this season [129 runs in 72 balls @ 179.16] \\n \\n-<b> Sanju Samson</b> has scored the bulk of his runs at home this season, and at a good strike rate. Away from home, he has just 42 runs in 3 innings. \\n \\n<b>- Ravi Bishnoi</b> has picked 13 wickets in 11 matches in Lucknow and has maintained an economy rate of just 7.40 \\n \\n<b>What they said:</b> \\n \\n\"I think he's a pretty grounded person. I've worked with him for the last month or so. He seems very mature and knows his body quite well, <b>which is very good for a young, rookie fast bowler. Coming from Delhi,</b> he has got that cricket culture with him that he knows how to look after himself. He's got a good cricketing sense in terms of the areas that he bowls, his execution has been very good. <b>More than the pace that he's provided, it's the execution, and the lengths that he's hit has been the standout for me.The number 155 (kmph)</b> is a by-product of his rhythm, run-up speed and arm speed but the accuracy with which he's bowled is what has stood out. For me that is critical. <b>\" - Sriramon the cynosure of all eyes - Mayank Yadav.</b> \\n \\n\"The benefits are there. He knows about their batters, he would've bowled to them in the nets [last year]. So there is a benefit. At the death, I feel <b>Avesh</b> is bowling the best, he's nailing his <b>yorkers.\"</b> - <b>Dhruv Jurel</b> on the 'benefit' of having former LSG bowler Avesh Khan on his side.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714140340315,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714140335706,
    "commText": "<p><b>Rajasthan Royals</b> Squad: Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Riyan Parag, Dhruv Jurel, Shimron Hetmyer, Rovman Powell, Ravichandran Ashwin, Trent Boult, Avesh Khan, Sandeep Sharma, Yuzvendra Chahal, Keshav Maharaj, Shubham Dubey, Navdeep Saini, Tom Kohler-Cadmore, Kuldeep Sen, Nandre Burger, Tanush Kotian, Donovan Ferreira, Abid Mushtaq, Kunal Singh Rathore</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714140249461,
    "commText": "<p><b>Lucknow Super Giants</b> Squad: Quinton de Kock, KL Rahul(w/c), Marcus Stoinis, Devdutt Padikkal, Nicholas Pooran, Deepak Hooda, Ayush Badoni, Krunal Pandya, Matt Henry, Ravi Bishnoi, Mohsin Khan, Yash Thakur, Arshin Kulkarni, Krishnappa Gowtham, Yudhvir Singh Charak, Manimaran Siddharth, Arshad Khan, Prerak Mankad, Amit Mishra, Kyle Mayers, Shamar Joseph, Ashton Turner, Naveen-ul-Haq, Mayank Yadav</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]