[
  {
    "timestamp": 1715695168039,
    "commText": "<p>The players are out in the middle. Last time Lucknow were bowling one Australian and an Indian took them apart. Here too there's an Australian and he's in pretty good form. Can they contain him? Arshad with the new ball. We are ready to go..</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715695103264,
    "commText": "<p><b>Marcus Stoinis:</b> It has been a pretty good campaign. Up to us to win these two games and give us the best chance to qualify. I batting 4,5 and 6 you make an impact on the game. At the end of the day you want to make an impact. Justin has been super organised. Good mixture of experience to help KL. You bowl good balls early.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715694206101,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715694170677,
    "commText": "<p><b>Delhi Capitals Impact Subs:</b> Ishant Sharma, Kumar Kushagra, Praveen Dubey, Swastik Chikara, Lalit Yadav</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715694091685,
    "commText": "<p><b>Lucknow Super Giants Impact Subs</b>: Manimaran Siddharth, Devdutt Padikkal, Ayush Badoni, Prerak Mankad, Krishnappa Gowtham</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715693968262,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715693967301,
    "commText": "<p><b>Delhi Capitals</b> (Playing XI): Abishek Porel, Jake Fraser-McGurk, Shai Hope, Rishabh Pant(w/c), Tristan Stubbs, Axar Patel, Gulbadin Naib, Rasikh Dar Salam, Mukesh Kumar, Kuldeep Yadav, Khaleel Ahmed</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715693920933,
    "commText": "<p><b>Lucknow Super Giants</b> (Playing XI): KL Rahul(c), Quinton de Kock(w), Marcus Stoinis, Deepak Hooda, Nicholas Pooran, Krunal Pandya, Yudhvir Singh Charak, Arshad Khan, Ravi Bishnoi, Naveen-ul-Haq, Mohsin Khan</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715693652044,
    "commText": "<p><b>Rishabh Pant:</b> We would have batted first. There are a lot of things going on (regarding qualification) but you can only focus on winning the game. If you had not lost too many wickets we would have won that game, but easier to say that from sitting out. That is a concern throughout the season but as a captain you can ask the players to give their best and they are doing that. We have two changes - myself and Naib come in, Warner misses out.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715693296586,
    "commText": "<p><b>KL Rahul:</b> We will bowl first. It is because of how our team is placed and what will help our team. We are a young bowling attack and get them into the game early, we have experienced batters and they can take the pressure. It is pretty clear for us, we have to win both games. The last two games we have not been up to the mark and have been blasted out of the game. The bowlers have to be brave, as a bowling unit you might fear using change ups but they have to do just back themselves. Couple of changes.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715651389253,
    "commText": "<p><b>Lucknow Super Giants have won the toss and have opted to field</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609481970,
    "commText": "<p><b>Pitch and Conditions:</b> \"It is a small and high-scoring ground. To the one side 60 meters and slightly bigger 66 meters on the other. There is a bit of breeze as well blowing across the ground. This pitch no. 6 and it is a high-scoring pitch. The length ball flies out of the ground. The average score is over 250 runs. But we have to see since it is reused will it be the same,\" questions Graeme Swann. There's a bit of sheen and it is more of the same. Batting first has helped over here,\" concludes Murali Kartik.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609481960,
    "commText": "<p>How much did Delhi Capitals miss Rishabh Pant in their previous game? It was a crunch game and the Capitals needed their skipper but he was suspended due to breaching the over-rate multiple times this season and that loss to RCB has put their season in jeopardy. There is still a miniscule chance of them qualifying for the playoffs and for that they have to first win this game by a good margin and hope other results go their way. Pant will be back and that will certainly give them a boost. They are playing at home and have won 3 of their 4 games. Also this is their final league game and would like to finish on a high in front of their home fans. Lots of reasons for the Capitals to win today. Can they? The pitch report coming up followed by toss and team news.. Stay tuned</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609481950,
    "commText": "<p><b>18:30 Local Time, 13:00 GMT:</b> Lucknow Super Giants are back in action after the annihilation in Hyderabad last Wednesday. How does any team recover from such a hammering? Head and Abhishek massacred the bowling attack and chased down 167 in 9.4 overs. They have had almost a week to get over that game and hopefully it has helped because they're still in the playoff race. The Super Giants' season has been inconsistent because their bowlers have had an up and down time; KL Rahul, Stoinis and Pooran have been amongst the runs but not on a consistent basis, the bowling too lacked penetration and ideas when the SRH openers were going hammer and tongs. They need to show up today because it is a must-win game and a loss will mean their playoff hopes is all but over.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609481930,
    "commText": "<p><b>Preview</b> by <b>Purnima Malhotra</b> \\n \\nTheir IPL math is at a stage where just a win won't suffice but, before turning to prayers, both Delhi Capitals and Lucknow Super Giants would be eager to get that 'W' against their name to fuel their dimming playoffs hopes. \\n \\nA fumble towards the business end has left both DC and LSG at 12 points ahead of their clash in Delhi on Tuesday, although the visitors have an extra game in hand. Even then, two wins will only take LSG to 16 points from where they will have to hope for both CSK and SRH to drop all their remaining games. Likewise for DC, two losses in last three games have left them precariously placed and with an outlandish scenario to qualify - not only do they have to win big against LSG, DC are also hoping for SRH go down by significant margins to stay ahead on NRR in case of a 14-point tie. A narrow win for DC will almost certainly knock both them and LSG out of the race. \\n \\nDelhi have only themselves to blame for their fate, going down to RCB on Sunday evening despite having restricted them to a sub-par 187/9. While the bowlers helped stage a remarkable comeback in the second half of the innings, DC had let the game slip early with the two dropped chances each off RCB's two top-scorers in the game. Axar Patel led from the front, standing-in, but Delhi will be eager to welcome their regular captain Rishabh Pant back into the XI after serving a one-match suspension for the team's third over-rate offence of the season - in the game against RR at home. \\n \\nThe spotlight would equally be on his counterpart with LSG playing their first game since KL Rahul was seen to be at the receiving end of an animated chat with the team owner after the big defeat in Hyderabad. His intent in the PowerPlay has often come under scrutiny and alongwith Quinton de Kock's indifferent form, mounted pressure on the misfiring middle-order. LSG could muster only 165 against SRH, and the home team's in-form openers took just 9.4 overs to chase it down while severely denting LSG's NRR that's now the poorest (-0.769) among the three teams on 12 points. \\n \\nNot only powerplays, where they have the second-lowest run-rate of 8.15 in IPL 2024, LSG have also fared poorly at the death - their last five-over average of 10.35 is the least among the ten teams. Incidentally, DC are no better, though, having fared only marginally above LSG in death overs at 10.65. DC have lost the most number of wickets - 27 - in PowerPlays and have used the maximum number of players in their top-three (9), which was partly due to the number of injuries to hit their camp. \\n \\nHowever, the one silver-lining to that was the emergence of Jake Fraser-McGurk. Of the 293 batters to have faced at least 100 balls in IPL history, Fraser-McGurk is the only one with a strike-rate above 200 (237.41). And it all started in Lucknow when, coming in at one-down, the Australian hit a 31-ball fifty on debut that eventually led to Delhi's mid-season resurgence. \\n \\n<b>When:</b> Delhi Capitals vs Lucknow Super Giants, May 14 at 19:30 IST \\n \\n<b>Where:</b> Arun Jaitley Stadium, Delhi \\n \\n<b>What to expect:</b> Another run-fest. The first innings average at the Arun Jaitley stadium has been 242 in IPL 2024. With both teams still chasing qualification, bowling first could be the way to go, whether or not dew will make an appearance. \\n \\n<b>Head to Head:</b> 3-1 to Lucknow. Incidentally, the win in the reverse fixture in Lucknow was Delhi's first against LSG in three seasons. \\n \\n<b>Teams Watch</b> \\n \\n<b>Delhi Capitals</b> \\n \\n<b>Injuries & Availability:</b> Pant returns after sitting out against RCB for a slow over-rate related suspension. \\n \\n<b>Tactics & Matchups:</b> Kuldeep Yadav has had the wood over Nicholas Pooran in T20 cricket. The wristspinner handed Pooran a golden duck in their previous meeting in IPL 2024, and has dismissed him a total of five times in all T20s. The otherwise big-hitting Pooran's strike-rate also drops to just about 91 against Kuldeep in this format, making it an exciting middle-overs match-up to watch out for. \\n \\n<b>Probable XI:</b> David Warner, Jake Fraser-McGurk, Abishek Porel, Rishabh Pant (C, wk), Shai Hope, Tristan Stubbs, Axar Patel, Kuldeep Yadav, Mukesh Kumar, Ishant Sharma, Khaleel Ahmed [Impact sub: Rasikh Salam] \\n \\n<b>Lucknow Super Giants</b> \\n \\n<b>Injuries & Availability:</b> Mohsin Khan sat out the last game due to an injury and could return to the XI in Delhi. \\n \\n<b>Tactics & Matchups:</b> LSG would be well aware of Pant's declining strike-rate (~115) against spinners in IPL 2024, and his troubles against legspin in particular. The DC captain was dismissed by Ravi Bishnoi in the reverse fixture, making it an exciting re-match. Pant strikes at only 112.5 against him, and has lost his wicket to Bishnoi twice. He's also been dismissed thrice by Krunal Pandya in IPL, though his strike-rate against the left-arm spinner is a staggering 179.5. \\n \\n<b>Probable XI:</b> Quinton de Kock, KL Rahul (C, wk), Marcus Stoinis, Nicholas Pooran, Ayush Badoni, Deepak Hooda, Krunal Pandya, Mohsin Khan/Arshin Kulkarni, Yash Thakur, Ravi Bishnoi, Naveen-ul-Haq [Impact sub: Arshin Kulkarni/K Gowtham] \\n \\n<b>Did you know?</b> \\n \\n- KL Rahul is four away from registering 400 fours in IPL. He's 40 away from entering the 500-run club this year \\n \\n- Axar Patel will be playing his 150th IPL match \\n \\n<b>What they said</b> \\n \\n\"We are aware that it's a high-scoring ground but high-scoring grounds normally take care of themselves. Good surface, a fast outfield on a smallish ground - that's just naturally what happens. So, I don't think you have to suddenly transform faster than you need to. I'm sure we can get batters to come in with a decent platform to launch of, we'll be good. That's probably something that we need to just focus on - making sure we're not losing wickets at stages where we feel we constantly need to be rebuilding.<b>\" - Lance Klusener.</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609481920,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609478687,
    "commText": "<p><b>Lucknow Super Giants</b> Squad: KL Rahul(w/c), Quinton de Kock, Marcus Stoinis, Krunal Pandya, Nicholas Pooran, Ayush Badoni, Deepak Hooda, Krishnappa Gowtham, Ravi Bishnoi, Naveen-ul-Haq, Yash Thakur, Yudhvir Singh Charak, Ashton Turner, Manimaran Siddharth, Amit Mishra, Devdutt Padikkal, Arshin Kulkarni, Mohsin Khan, Kyle Mayers, Matt Henry, Prerak Mankad, Arshad Khan, Shamar Joseph</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609347377,
    "commText": "<p><b>Delhi Capitals</b> Squad: David Warner, Jake Fraser-McGurk, Abishek Porel, Shai Hope, Rishabh Pant(w/c), Kumar Kushagra, Axar Patel, Tristan Stubbs, Rasikh Dar Salam, Kuldeep Yadav, Mukesh Kumar, Ishant Sharma, Khaleel Ahmed, Praveen Dubey, Sumit Kumar, Ricky Bhui, Vicky Ostwal, Gulbadin Naib, Lalit Yadav, Prithvi Shaw, Lizaad Williams, Jhye Richardson, Anrich Nortje, Yash Dhull, Swastik Chikara</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]