[
  {
    "timestamp": 1714917577559,
    "commText": "<p>All in readiness. Stoinis to kickstart proceedings with the ball. One slip in place. Off we go...</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916845715,
    "commText": "<p>I0$ We have made one change to our expert XI. Do remember to check out our FantasyHandbook guide before locking in your team(s).</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916346679,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916308886,
    "commText": "<p><b>Lucknow Super Giants Impact Subs:</b> Arshin Kulkarni, Manimaran Siddharth, Krishnappa Gowtham, Yudhvir Singh, Devdutt Padikkal</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916266245,
    "commText": "<p><b>Kolkata Knight Riders Impact Subs:</b> Anukul Roy, Manish Pandey, Srikar Bharat, Sherfane Rutherford, Vaibhav Arora</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916191372,
    "commText": "<p><b>Teams:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916189791,
    "commText": "<p><b>Kolkata Knight Riders</b> (Playing XI): Philip Salt(w), Sunil Narine, Angkrish Raghuvanshi, Shreyas Iyer(c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Varun Chakaravarthy, Harshit Rana</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916131584,
    "commText": "<p><b>Lucknow Super Giants</b> (Playing XI): KL Rahul(w/c), Marcus Stoinis, Deepak Hooda, Nicholas Pooran, Ashton Turner, Ayush Badoni, Krunal Pandya, Ravi Bishnoi, Naveen-ul-Haq, Mohsin Khan, Yash Thakur</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714916005879,
    "commText": "<p><b>Shreyas Iyer:</b> We would have bowled as well. Defending that total with five bowlers in the last game gives us a lot of confidence. There's a lot of self-belief in the team. We are going with the <b>same team</b>. Hopefully we continue with the same form. He has been optimistic from game one and just that he wasn't able to execute. He (Venkatesh Iyer) got tremendous and charater and happy for the way he executed. It's important to stay in the present.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714915859624,
    "commText": "<p><b>KL Rahul:</b> We will bowl first. I'm not a best reader of a wicket, we just like chasing. The good thing is we have been able to adapt really well and quickly to the conditions, there have been quite a few brilliant individual performances as well. There's been a lot of talk about strike-rate, and T20 cricket has changed a lot in the last couple of years. He was injured in the last game, <b>Yash Thakur comes in for Mayank Yadav</b>.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714915855520,
    "commText": "<p><b>Lucknow Super Giants have won the toss and have opted to field</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714915826724,
    "commText": "<p><b>Toss time:</b> Shreyas Iyer calls tails and it comes down as \"heads\"</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714915521615,
    "commText": "<p><b>Varun Chakravarthy:</b> The whole team has prepped well. The plans, the hardwork that was going behind the scenes, all those things have come very handy this time. I definitely tend to bowl better when there is some challenge ahead of me. When I don't see a challenge ahead of me, I tend to try something new and I falter there. If I know what I have to do, I do it better. The wickets are slowing down a little, but I won't say very much. Just because the trend was 260s, now 180s are looking very low, but that's not the thing. They are still scoring 180s. Personally, I have played a lot of domestic games at this ground in the Syed Mushtaq Ali tournament. Many people in the team were asking me how's the ground and how's the pitch going to be because none of them have come here. We have seen a few footage, we've planned and prepped well, let's see how it turns out today. (How to beat LSG?) Do better than the last game.</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714914903070,
    "commText": "<p><b>Pitch Report | Ravi Shastri and Aaron Finch:</b> \"A gentle breeze blowing across the ground. This is one of the biggest grounds in India. Straight down the ground is 76m, square boundaries - 68m and 61m. The dimensions will make a bit of a difference, we've seen the ball into the surface being used particularly with one side bigger than the other right throughout this tournament. When we come to the wicket, this is the third time that this surface is being used. There's a hint of green grass on it, but there are some bare red patches. We expect it to slow down a little bit more than what it might have in the past. Anywhere around that 190-200 will be a good score batting first. First time 199 was defended, second time 176 was easily chased down. The last time when Lucknow played here, the ball just held in the surface, particularly for the spinners. With a real good quality spin attack in both line-ups, that will play a big part in tonight's game. I reckon the team that wins the toss will still want to field first because of the dew factor and teams have chased big scores down.\"</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714914034825,
    "commText": "<p><b>18:30 local, 13:00 GMT:</b> Just 2 more double-headers after today, and we have officially reached I0$ stage of the tournament. Every game carries a lot of significance; not just to the two teams playing, but those whose playoff chances are dependent on the other results. Hello and warm welcome. It's a top-half table clash in Lucknow which is all set to host the in-form Kolkata Knight Riders. A win for KKR will take them to the top, while a win for LSG will most likely see them remain unmoved at the third spot. That said, a win will help the hosts inch really close to that playoff spot. A crucial, crucial game for both teams. Stick around for further updates...</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714831936301,
    "commText": "<p><b>Preview</b> \\n \\nKolkata Knight Riders will have strutted into town for their first-ever IPL game in Lucknow. Short-turn around time in IPL can be daunting, but not for a side that is coming off its first win at the hallowed Wankhede since 2012. Granted Mumbai Indians are in quite a mess this year, but Shreyas Iyer's side recovered commedbly well from a top-order collapse through a fantastic bowling effort. The win opened up a crucial two-point gap between them and their opponents for Sunday evening, as the season hurtles towards the business end. \\n \\nIt's the same gap LSG will hope to gain over the chasing pack, even if they have one more in the games played column. They had a three-game winning run early in the season but since then it has been two steps forward, one back for Rahul's side. The losses haven't derailed their season, but another one could throw them into the mid-table dogfight. They'll hope to stay away from it by capping off the Lucknow leg of the season with a fifth win in seven games. \\n \\n<b>When:</b> Lucknow Super Giants vs Kolkata Knight Riders, May 5, 2024, 19:30 IST \\n \\n<b>Where:</b> Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium, Lucknow \\n \\n<b>What to expect:</b> The previous fixture gave bowlers a respite as the centre-wicket was chosen to deny batters the advantage of one shorter side. Runs will flow or not on Sunday depending on which pitch they pick for it. The big ground dimensions has made six-hitting tougher than other venues, but KKR could come to challenge that. \\n \\n<b>Head to Head:</b> LSG 3 - 1 KKR. This will be the first game between these two sides in Lucknow. \\n \\n<b>Team Watch:</b> \\n \\n<b>Lucknow Super Giants</b> \\n \\n<b>Injuries/Availability:</b> Mayank Yadav suffered another setback in LSG's game against MI and is unlikely to feature again this year. \\n \\n<b>Tactics & Matchups:</b> Phil Salt's highest score this season - a devastating 89 off 47 - came against LSG in the reverse fixture. But the KKR opener has been ordinary away from home (53 runs in 4 innings). In that game, he had the measure of both Mohsin Khan and Yash Thakur, so LSG might need a different route. Mohsin, however, could be the way to getting rid of Sunil Narine early. The KKR opener has been dismissed thrice by left-arm quicks this season, scoring 61 off 46 balls. Ekana stadium's big square boundaries should aid the hosts in luring Narine into playing a false shot. \\n \\n<b>Probable XI:</b> KL Rahul (C, wk), Marcus Stoinis, Deepak Hooda, Nicholas Pooran, Ashton Turner, Ayush Badoni, Krunal Pandya, Ravi Bishnoi, Naveen-ul-Haq, Mohsin Khan, Yash Thakur [Impact substitute: Arshin Kulkarni] \\n \\n<b>Kolkata Knight Riders</b> \\n \\n<b>Injuries/Availability:</b> Harshit Rana served his one-match ban in KKR's game against MI and should slot right back into the XI. \\n \\n<b>Tactics & Matchups:</b> Narine and Varun Chakravarthy come into this game having conceded just 44 runs for 4 wickets in eight overs combined (2 for 22 each) just a day ago. Both have a favourable match-up against two of LSG's biggest match-winners in Marcus Stoinis and Nicholas Pooran. Stoinis has been dismissed six times by spin this season, including once by Chakravarthy in the home game. Andre Russell, who had to bowl his entire quota of overs against MI, has also been effective against the LSG pair. \\n \\nShould LSG bring back Quinton de Kock after benching him in the previous fixture, KKR will unleash Mitchell Starc on him. The Aussie is coming fresh off a four-wicket haul and is the kind of bowler - left-arm pacer - that has troubled the South African batter all season (6 dismissals). \\n \\n<b>Probable XI:</b> Philip Salt (wk), Sunil Narine, Shreyas Iyer (C), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Harshit Rana, Vaibhav Arora, Varun Chakaravarthy [Impact substitute: Angkrish Raghuvanshi/Manish Pandey] \\n \\n<b>Did you know?</b> \\n \\n- KL Rahul has six 50-plus scores in 14 innings against KKR, scoring runs at a strike rate of 138.41 against the two-time champions \\n \\n- Together, Narine and Varun have 26 wickets in 77 overs across 10 matches, conceding at just 7.65</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714831936291,
    "commText": "<p><b>Squads:</b></p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714831935041,
    "commText": "<p><b>Kolkata Knight Riders</b> Squad: Philip Salt(w), Sunil Narine, Angkrish Raghuvanshi, Shreyas Iyer(c), Venkatesh Iyer, Rinku Singh, Andre Russell, Ramandeep Singh, Mitchell Starc, Vaibhav Arora, Varun Chakaravarthy, Anukul Roy, Manish Pandey, Srikar Bharat, Sherfane Rutherford, Chetan Sakariya, Dushmantha Chameera, Nitish Rana, Rahmanullah Gurbaz, Harshit Rana, Sakib Hussain, Suyash Sharma, Allah Ghazanfar</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1714831764705,
    "commText": "<p><b>Lucknow Super Giants</b> Squad: KL Rahul(w/c), Marcus Stoinis, Deepak Hooda, Nicholas Pooran, Ashton Turner, Ayush Badoni, Krunal Pandya, Ravi Bishnoi, Naveen-ul-Haq, Mohsin Khan, Arshad Khan, Arshin Kulkarni, Krishnappa Gowtham, Manimaran Siddharth, Yudhvir Singh Charak, Prerak Mankad, Mayank Yadav, Amit Mishra, Kyle Mayers, Quinton de Kock, Matt Henry, Yash Thakur, Devdutt Padikkal, Shamar Joseph</p>",
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]