[
  {
    "timestamp": 1712240132452,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Mayank Agarwal, Travis Head, Abhishek Sharma, Aiden Markram, Heinrich Klaasen(w), Shahbaz Ahmed, Abdul Samad, Washington Sundar, Pat Cummins(c), Bhuvneshwar Kumar, Mayank Markande, Jaydev Unadkat, Umran Malik, Glenn Phillips, Nitish Reddy, Upendra Yadav, Rahul Tripathi, T Natarajan, Anmolpreet Singh, Jhatavedh Subramanyan, Sanvir Singh, Fazalhaq Farooqi, Marco Jansen, Akash Maharaj Singh</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712240287494,
    "commText": "<p><b>Chennai Super Kings</b> Squad: Ruturaj Gaikwad(c), Rachin Ravindra, Ajinkya Rahane, Daryl Mitchell, Shivam Dube, Sameer Rizvi, Ravindra Jadeja, MS Dhoni(w), Deepak Chahar, Tushar Deshpande, Matheesha Pathirana, Mustafizur Rahman, Shardul Thakur, Shaik Rasheed, Moeen Ali, Mitchell Santner, Devon Conway, Ajay Jadav Mandal, Prashant Solanki, Mukesh Choudhary, Simarjeet Singh, RS Hangargekar, Maheesh Theekshana, Nishant Sindhu, Aravelly Avanish</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712240288902,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712240288912,
    "commText": "<p><b>Preview</b> by <b>Prakash Govindasreenivasan</b> \\n \\nChennai Super Kings and Sunrisers Hyderabad are starting to look like two peas of the same batting pod. Words like intent, freedom and aggression are reverberating in the SRH dressing room too, as the face-lift after last year's 10th-place finish starts to take shape under Pat Cummins. Bare in mind, their opponents for Friday are a year senior in this gambit. They aced the long-batting order and hit through phases on their way to a fifth IPL title in 2023, and seem to have upskilled further with respect to this explosive batting intent. \\n \\nThe narrative, for both these sides, is rather delicious. They are after all, two teams that built championship-winning sides on the shoulders of their bowlers. CSK squads always knew how to maximise Chepauk's slow conditions and SRH - in 2016 - defended considerably low totals on their way to glory. They've then gone on to embrace this batting chaos with the arrival of the impact substitute, and promise a You-Blink-I-Smash contest on Friday. Or do they? \\n \\nBoth the teams arrived in Hyderabad looking for the hitting comforts of the venue, but will have to contend with a black soil pitch that could bring spinners into play and push the pacers to annoy some of the cleanest hitters of the ball with cutters and slow bouncers that will grip. Daniel Vettori reckoned he was still 'gearing up for another 200' game but Michael Hussey didn't commit to the idea of a high-scorer. He rather hoped his team read conditions quicker, and put the onus on the openers to figure out and pass on the information. \\n \\n<b>When:</b> Sunrisers Hyderabad vs Chennai Super Kings, IPL 2024, April 5, 19:30 IST \\n \\n<b>Where:</b> Rajiv Gandhi International Stadium, Hyderabad \\n \\n<b>What to expect:</b> Uncertainty. The venue produced a 277-v-246 game just eight days ago, and CSK and SRH have hit half the 200-plus totals so far (CSK 1, SRH 2). But a black soil pitch means hitting through the line will not be as easy. \\n \\n<b>Head to Head:</b> CSK 14 - 5 SRH. This is the most one-sided duel, with CSK's win percentage of 73.68% being the best for a team against a single opponent (criteria: > 10 matches). \\n \\n<b>Team Watch</b> \\n \\n<b>Sunrisers Hyderabad</b> \\n \\nInjury/Availability:Wanindu Hasaranga remains an absentee. Rest of the squad is available for selection. \\n \\n<b>Tactics & Matchups:</b> Ruturaj Gaikwad has fallen to left-arm pace in all of CSK's games so far. SRH might find it hard to fit Marco Jansen into the XI, but will perhaps rely on Jaydev Unadkat to keep the trend going. The veteran left-armer has 13 wickets in 22 overs at the venue. \\n \\n<b>Probable XI:</b> Mayank Agarwal, Travis Head, Abhishek Sharma, Aiden Markram, Heinrich Klaasen, Abdul Samad, Shahbaz Ahmed, Pat Cummins, Bhuvneshwar Kumar, Mayank Markande, Jaydev Unadkat [Impact Sub: Washington Sundar/Umran Malik] \\n \\n<b>Chennai Super Kings</b> \\n \\n<b>Injury/Availability:</b> Mustafizur Rahman is in the US to process his visa for the T20 World Cup that comes right after the IPL in June and will be unavailable for the SRH game. \\n \\n<b>Tactics & Matchups:</b> CSK have a decision on their hands. A slow surface could pave the way for Maheesh Theekshana's return but SRH have multiple spin hitters. Klaasen has smashed their ilk at a strike rate of 200 since IPL 2022, while Abhishek Sharma has hit them at 167.50 in the same period - bettered only by Klaasen and Glenn Maxwell (173.89). \\n \\nIf the anticipation is of a batting belter, CSK could replace Mustafizur with Shardul Thakur, who they bought back in the recent auction but haven't fielded in their XII yet. Besides further lengthening CSK's batting, Thakur also brings a favourable match-up against Abhishek Sharma, who smashed 63 off 23 in the last game at this venue. In the 14 balls bowled to top-order batter from Punjab, Thakur has given away just 16 runs and dismissed him twice. Shardul has also dismissed Klaasen twice in 11 deliveries in IPL. \\n \\n<b>Probable XI:</b> Rachin Ravindra, Ruturaj Gaikwad, Ajinkya Rahane, Shivam Dube, Daryl Mitchell, Sameer Rizvi, Ravindra Jadeja, MS Dhoni, Deepak Chahar, Tushar Deshpande, Matheesha Pathirana/Shardul Thakur [Impact Sub: Maheesh Theekshana/Matheesha Pathirana] \\n \\n \\n<b>Did You Know:</b> \\n \\n-Since 2023, Klaasen has hit 696 runs off 359 balls against spin, with 30 fours and 58 sixes. He also has 334 runs in 6 IPL innings in Hyderabad, striking at 197.63. \\n \\n- Matheesha Pathirana has picked 23 wickets since IPL 2023, with 19 of them at the death (Overs 16-20) - the joint-most for that phase with Mohit Sharma. \\n \\n<b>What They Said:</b> \\n \\n\"In terms of Mayank, in the first game he gave us exactly what we wanted. In the last two games he missed out but that's the nature of batting. We want our batters to have the freedom to be able to be aggressive and playing their style. For Mayank, it is around countering what the opposition brings. He's obviously had three similar dismissals [off short balls], so that's something that he's working hard on to rectify.\" - <b>Daniel Vettori</b> \\n \\n\"One thing we want to improve is assessing the conditions slightly quicker than we did in the last match. It is important for players who start in the middle to assess the conditions quickly and send the messages back.\" - <b>Michael Hussey</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712321111635,
    "commText": "<p><b>18:15 Local Time, 12:45 GMT, 18:15 IST:</b> It has been a tough start for the Sunrisers Hyderabad in the 2024 edition of the Indian Premier League with losses against the Knight Riders and the Titans from their first three matches. Their only win so far has been against the hapless Mumbai Indians, but they're back at home for a huge clash against the mighty Super Kings from Chennai today. MS Dhoni showed some flashes of brilliance in their last match against the Capitals from Delhi, but it came too late and when the match was already lost. They wouldn't be fretting over one-off losses, but they would love to get back into winning ways. The only match at this venue so far this season yielded a record 523 runs with SRH breaking the all-time IPL record for the highest score by making 277 against Mumbai Indians. Can we expect a similar batting paradise tonight at the Rajiv Gandhi international stadium?</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712322397813,
    "commText": "<p><b>Deepak Chahar</b> - I think the ball is swinging less, the wickets are pretty flat, last match in Vizag, I asked the curator if he wanted to see 300 runs being scored,. he just said that he wanted to break the 277-run record set in Hyderabad (laughs). Last match, KKR made 272 there. I think this mentality should change, they should prepare 200-run pitches. For me, the pitch doesn't matter, the ball does swing in the 1st over. I've played a lot of games, the bounce is always good, there's something in this wicket for the pacers, it's not flat. It's better in the middle overs (about the 2 bouncer rule). Anyway, you don't bowl a lot of bouncers with the new ball. But we did see with Mayank Yadav, he got protection in the deep, the batters will be left thinking, so it does help in the middle and death overs, especially if you use your variations. Last time the crowd support was 90-10 in favour of CSK, today I think it's around 80-20.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712322397823,
    "commText": "<p><b> Abhishek Sharma: </b> We are viewing this one as a normal match, if you see the crowd, CSK fans are everywhere, I think it will be a good battle, at this venue, they have won a couple of games, we have won a couple of games, I think it will be a very good game. It has been very good, from the first day Pat Cummins and Daniel Vettori have had the same plan from day one, they have asked the batters to play their natural game and play with a positive mindset, we will back you guys so it’s a good thing for us. Especially in this tournament, he (Yuvraj Singh) has complimented me a bit but he wasn’t happy with my performances, because in a game I gave away my wicket, I will try that kind of thing doesn’t happen in this game.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712323151112,
    "commText": "<p>It's Match 18 and it's SRH v CSK. One side is slightly bigger then the other. Both square boundaries are sub-70-m, the straight boundary is slightly bigger. It's a different surface tonight, but there are a lot of runs. Some visible cracks, but it's not going to affect the game. The captain winning the toss would like to bat first. Even 200 on this pitch isn't a safe score and the batting team will be disappointed at their effort, reckon <b>Brian Lara and Samuel Badree</b>, in their pitch report.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712323855160,
    "commText": "<p><b>Sunrisers Hyderabad have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324003074,
    "commText": "<p><b>Pat Cummins</b> - We'll bowl first. Looks like a good wicket and should stay the same for the whole match. We've got a great squad. Mayank Agarwal is unwell, he's replaced by Nitish Reddy. Natarajan is back as well. Last time, there were 500 runs scored, this looks like a good wicket as well.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324012979,
    "commText": "<p><b>Ruturaj Gaikwad</b> - It's going pretty well, the group is responding well. Nothing much changes for me, obviously this is a new challenge, but I'm feeling good. Pathirana has a niggle - three changes for us, Moeen Ali,Theekshana and Mukesh Chowdhary come in. The bowlers are ready to go and so are the youngsters.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324297836,
    "commText": "<p><b>Sunrisers Hyderabad</b> (Playing XI): Abhishek Sharma, Aiden Markram, Heinrich Klaasen(w), Abdul Samad, Nitish Reddy, Shahbaz Ahmed, Pat Cummins(c), Jaydev Unadkat, Bhuvneshwar Kumar, Mayank Markande, T Natarajan</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324355081,
    "commText": "<p><b>Chennai Super Kings</b> (Playing XI): Ruturaj Gaikwad(c), Rachin Ravindra, Ajinkya Rahane, Moeen Ali, Daryl Mitchell, Shivam Dube, Ravindra Jadeja, MS Dhoni(w), Deepak Chahar, Tushar Deshpande, Maheesh Theekshana</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324357491,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324455307,
    "commText": "<p>SRH have named only three overseas players, but it should be Travis Head who could be the impact player. Mukesh Chowdhary was named at the toss by Gaikwad and it'll be a surprise if he isn't CSK's impact sub. Have a look at our expert XI before you lock in your fantasy team</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324553122,
    "commText": "<p><b>Chennai Super Kings Subs:</b> Shardul Thakur, Shaik Rasheed, Mitchell Santner, Sameer Rizvi , Mukesh Choudhary</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324607126,
    "commText": "<p><b>Sunrisers Hyderabad Subs:</b> Travis Head, Umran Malik, Washington Sundar, Glenn Phillips, Rahul Tripathi</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712324758496,
    "commText": "<p><b>Here are the impact subs for both teams</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1712325238825,
    "commText": "<p>Lots of yellow in the crowd as we get ready for Match number 18. The pitch looks flat and both teams are filled with plenty of proper hitters. No pathirana for CSK, no Mustafizur as as well, a pretty young pace attack and they're up against a team that just smashed 277 the last time they played here. CSK are batting first and they might want an above par score to let their inexperienced bowling line-up prosper. SRH are starting with left-arm spin and it's Abhishek Sharma - long-on and deep mid-wicket in place, a slip as well</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]