[
  {
    "timestamp": 1713535664084,
    "commText": "<p><b>Delhi Capitals</b> Squad: Prithvi Shaw, Jake Fraser-McGurk, Abishek Porel, Shai Hope, Rishabh Pant(w/c), Sumit Kumar, Tristan Stubbs, Axar Patel, Kuldeep Yadav, Mukesh Kumar, Ishant Sharma, Khaleel Ahmed, Kumar Kushagra, Praveen Dubey, Lalit Yadav, Lizaad Williams, David Warner, Jhye Richardson, Anrich Nortje, Yash Dhull, Mitchell Marsh, Ricky Bhui, Rasikh Dar Salam, Vicky Ostwal, Swastik Chikara</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713535823019,
    "commText": "<p><b>Sunrisers Hyderabad</b> Squad: Abhishek Sharma, Travis Head, Heinrich Klaasen(w), Aiden Markram, Abdul Samad, Nitish Reddy, Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Jaydev Unadkat, T Natarajan, Mayank Markande, Umran Malik, Anmolpreet Singh, Glenn Phillips, Rahul Tripathi, Washington Sundar, Upendra Yadav, Jhatavedh Subramanyan, Sanvir Singh, Vijayakanth Viyaskanth, Fazalhaq Farooqi, Marco Jansen, Akash Maharaj Singh, Mayank Agarwal</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713535826701,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713535826711,
    "commText": "<p><b>Preview</b> \\n \\nFor the first time in this season, Delhi Capitals have managed to string together two victories in a row and have placed themselves fairly well on the points table (currently sixth) considering they had just one victory in their first five matches. But as they gear up for the first match at the Arun Jaitley Stadium in IPL 2024, their task of sustaining the momentum won't be that easy. For their opponents are Sunrisers Hyderabad, who have redefined T20 batting with their belligerent approach and are entering this game after surpassing their own record for the highest IPL total. \\n \\nThe bowling has been the stand-out aspect for the Capitals in their recent wins, with the Indian seam trio of Ishant Sharma, Khaleel Ahmed and Mukesh Kumar doing a good job. With the ever reliable Kuldeep Yadav and Axar Patel manning the spin department, the Capitals have finally found their way forward in the competition. In the batting department, the arrival of Jake Fraser-McGurk has infused a breath of fresh air to the top order while Rishabh Pant and Prithvi Shaw have been delivering with the bat as well. DC, however, will be concerned with the form and fitness of David Warner who missed the previous game. \\n \\nThe Sunrisers batters have been firing on all cylinders from start to finish, led by Travis Head at the top and Heinrich Klaasen at the back end of the innings. Together, they've accounted for five of the eight fifty-plus scores by Sunrisers in this edition so far, and the team will be hoping they continue the good work. Sunrisers, though, will be keen to tighten up their bowling, having let teams get close despite posting mammoth totals. Skipper Pat Cummins (9 wickets and economy of 7.87) and T Natarajan (6 wickets and economy of 9.43) have done well but the rest of the bowlers all have economy on the higher side and SRH will be eager to address this soon. \\n \\n<b>When: </b>Saturday, April 20, 2024 at 19:30 IST \\n \\n<b>Where: </b>DC vs SRH, IPL 2024, Arun Jaitley Stadium, Delhi \\n \\n<b>What to expect: </b>This will be the first match of the season in Delhi, with the venue taking a break after hosting the second half of the Women's Premier League. There were a few high-scoring games in the initial stages of the WPL in Delhi but the pitch became slower as the tournament progressed, leading to smaller totals. It remains to be seen how the unknown conditions of the venue will influence decision at the toss. \\n \\n<b>Head to head: </b>11-12 (including one Super over finish which DC won in 2021). DC have a good record in recent years, having won five of the last six clashes against SRH. \\n \\n<b>Teams watch: </b> \\n \\n<b>Delhi Capitals</b> \\n \\n<b>Injury/Availability: </b>Warner picked up a finger injury during the match against Lucknow Super Giants and subsequently missed the game against Gujarat Titans. His X-Ray came back all clear but had some swelling around the knuckle of his left hand, said head coach Ricky Ponting before the match against GT. The latest update is that he is still being assessed and a call on his participation against SRH will be taken closer to the game. \\n \\n<b>Tactics & Matchups: </b>Heinrich Klaasen has scored 102 runs off 48 deliveries against spin in this IPL, a fact that might force DC to bowl out Kuldeep and Axar before he arrives. With Travis Head having been dismissed twice by spinners, it makes sense to use Kuldeep early, and Khaleel could also prove important as he has dismissed left-handed batters five times this season. Axar is a good option against Aiden Markram as the left-arm spinner has accounted for the South African batter twice in six deliveries in T20 cricket. \\n \\n<b>Probable XI: </b>Prithvi Shaw, David Warner/Sumit Kumar, Jake Fraser-McGurk, Tristan Stubbs, Shai Hope, Rishabh Pant (c & wk), Axar Patel, Kuldeep Yadav, Ishant Sharma, Mukesh Kumar, Khaleel Ahmed. [Impact sub: Abishek Porel]. \\n \\n<b>Sunrisers Hyderabad</b> \\n \\n<b>Injury/Availability: </b>Sunrisers do not have any injury concerns to report at the moment. \\n \\n<b>Tactics & Matchups: </b>Should Warner feature in the game, Pat Cummins is a good option against him since the SRH captain has accounted for left-handers five times so far and has an economy of 5.35 against them. Bhuvneshwar Kumar has kept Warner quiet in the past, conceding only 18 runs in 29 deliveries and has dismissed him once. He is also a good option against Shaw, having dismissed him two times in 36 balls at the expense of only 35 runs. But Bhuvneshwar against Pant may not be a good option as the DC skipper has scored 79 runs off him at a strike rate of 219.44. \\n \\n<b>Probable XI: </b>Travis Head, Abhishek Sharma, Aiden Markram, Heinrich Klaasen (wk), Abdul Samad, Nitish Reddy, Shahbaz Ahmed, Pat Cummins (c), Bhuvneshwar Kumar, Jaydev Unadkat, T Natarajan. [Impact sub: Mayank Markande]. \\n \\n<b>Did you know? </b> \\n \\n- Sunrisers Hyderabad have scored 409 runs against spinners in six matches in this IPL, which is the second most after Gujarat Titans, although the latter have played one match more. The overall economy of spinners against SRH is 9.64, which the highest in this IPL, followed by 9.42 against Kolkata Knight Riders \\n \\n- Sunrisers are third on the list of teams with most runs in this IPL, with 1278 runs in six matches. MI and RCB, with 1344 and 1327 respectively, are at the top but have played seven matches each. SRH's scoring rate of 10.81 is the best in this IPL, with KKR a close second at 10.56 \\n \\n<b>What they said? </b> \\n \\n\"We're running into the freight train next game, which is SRH. We've already started preparing for that. So we're hopeful if we have a good week and a half we are going to be right around the top-four\" - <b>James Hopes</b>, DC bowling coach.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713618084456,
    "commText": "<p><b>18:30 Local Time, 13:00 GMT, 18:30 IST:</b> The IPL caravan has set up shop at Delhi as the Capitals get set to host the Sunrisers. In what will be their first \"home\" game at the Arun Jaitley Stadium, the Capitals will come in looking to extend their winning run. After getting back on track with a win against Lucknow, the Capitals backed it up with a strong performance against Gujarat. A superb bowling performance saw them restrict the Titans to just 89 before chasing it down quite easily to move up to 6th on the points table. After starting slow, it seems like Delhi have warmed up and have just started to play some of their best cricket exactly when it matters. And tonight, they face a stiff challenge from the high-flying Sunrisers.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713618542357,
    "commText": "<p>Where the Sunrisers go, they leave behind a wreck of all the records they break. As far as confidence goes, no side could probably come into a game feeling as good as the Sunrisers tonight. After posting the highest ever total in the IPL just a few weeks ago against MI, the Sunrisers did the unthinkable by surpassing their own record against RCB in their previous game. Led by a merciless hundred from Travis Head and blitzes from Klaasen and Samad, SRH reached new heights by scoring 287. With their batting order firing on all cylinders, the Sunrisers will have their sights set on consolidating their position in the top-half of the points table.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713618653792,
    "commText": "<p><b>Pitch report:</b> A 67m boundary on one side and a very short boundary at 59m on the other. The straight boundary is at 74m. You can expect a run-fest tonight. This pitch looks completely different to what was served up last year. This is a pitch that'll suit the Delhi Capitals pacers. It has got a lot of grass, it's really hard, there's plenty of runs on offer and there will be a bit of carry as well. So, both batters and bowlers will like this. You're going to get hit with the small dimensions, but you'll have to stick to your strengths as a bowler. Dew could be a factor as well and the captain winning the toss should be bowling first, reckon Kevin Pietersen and Matthew Hayden, in their pitch report</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713618653802,
    "commText": "<p><b>Klaasen:</b> It's always fun hitting some big sixes, it's going on nicely. I think the standard the boys are setting up the order, the intensity they are playing with, the amount of pressure they are putting on the bowlers, just need to keep on going. Even if we fail, we can still get to 160-180. The boys are playing with a lot of freedom in the tournament. Nice to see everyone backing themselves. If your intensity is nice and if your put pressure on the bowlers you can score runs big enough. All that we speak about is to be nice and free.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713618653812,
    "commText": "<p><b>Ishant Sharma:</b> I'm feeling good, we played two home matches in Vizag, the pitch there was slow and flat, we'll have to look at the pitch here and then adapt to the conditions. I have to be thankful to Patrick (Farhart, the DC physio), the day I twisted my ankle, myself and him stayed up the entire night as icing had to be applied. Even now, I have to take 3 pills a day so that I don't feel the pain during either practice or in the match. We get used to it, we'll have to know when to switch on and switch off (from the routines), so going to your house helps a lot, it'll help you keep you mentally fresh going into the game. I have never looked at myself, even when you're doing well or doing badly, this format doesn't allow you to think too much, just keep it as simple as possible.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713619247345,
    "commText": "<p><b>Delhi Capitals have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713619840897,
    "commText": "<p><b>Rishabh Pant:</b> We're going to bowl first. Wicket looks pretty good, we would like to chase because we are playing more as a batting unit. We have more batters. Maybe there will be dew. The only thing we said is \"stay in the contest\". Yes they've been playing really good cricket but you can't let them get away with it. Ground doesn't matter, end of the day you have to play good cricket. We're looking to improve each and every match. Instead of Sumit, Lalit comes in. Instead of <b>Ishant, who had a back spasm just 5 minutes back,</b> Nortje comes in.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620064647,
    "commText": "<p><b>Pat Cummins:</b> We were thinking of having a bowl first as well, looks like a good wicket. The way the boys have been batting, we know teams are going to come hard at us. Same batting lineup, we'll have a look at the bowling a little later on.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620245199,
    "commText": "<p><b>Sunrisers Hyderabad</b> (Playing XI): Abhishek Sharma, Travis Head, Aiden Markram, Heinrich Klaasen(w), Abdul Samad, Nitish Reddy, Shahbaz Ahmed, Pat Cummins(c), Bhuvneshwar Kumar, Mayank Markande, T Natarajan</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620314523,
    "commText": "<p><b>Delhi Capitals</b> (Playing XI): David Warner, Jake Fraser-McGurk, Abishek Porel, Rishabh Pant(w/c), Tristan Stubbs, Axar Patel, Lalit Yadav, Kuldeep Yadav, Anrich Nortje, Khaleel Ahmed, Mukesh Kumar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620316018,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620450029,
    "commText": "<p><b>Delhi Capitals Subs:</b> Prithvi Shaw, Shai Hope, Praveen Dubey, Rasikh Dar Salam, Sumit Kumar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620489125,
    "commText": "<p><b>Sunrisers Hyderabad Subs:</b> Umran Malik, Anmolpreet Singh, Akash Maharaj Singh, Glenn Phillips, Washington Sundar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620508673,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713620528221,
    "commText": "<p>Unsure of whom to pick in your Fantasy XI? Make sure you check out our Expert XI on <b>#FantasyHandbook</b> before you lock your team in.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1713621194773,
    "commText": "<p>The track looks good and SRH are batting first - so far that's been a combo that's guaranteed some epic action. Things have lined up quite perfectly for the SRH batting unit. Head and Abhishek have been in red hot form and have given them rapid starts, Markram in the middle has provided great solidity and stability while Klaasen just been on another level with his finishing. It doesn't get much better than that. Now, what can they do against a Delhi bowling attack that's done very well in the last two games? Time to find out!</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]