[
  {
    "timestamp": 1715525260573,
    "commText": "<p><b>Kolkata Knight Riders</b> Squad: Philip Salt(w), Sunil Narine, Venkatesh Iyer, Shreyas Iyer(c), Rinku Singh, Nitish Rana, Andre Russell, Ramandeep Singh, Mitchell Starc, Harshit Rana, Varun Chakaravarthy, Vaibhav Arora, Anukul Roy, Suyash Sharma, Rahmanullah Gurbaz, Angkrish Raghuvanshi, Manish Pandey, Dushmantha Chameera, Srikar Bharat, Chetan Sakariya, Sherfane Rutherford, Sakib Hussain, Allah Ghazanfar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715525459540,
    "commText": "<p><b>Gujarat Titans</b> Squad: Shubman Gill(c), Sai Sudharsan, Shahrukh Khan, David Miller, Matthew Wade(w), Rahul Tewatia, Rashid Khan, Noor Ahmad, Umesh Yadav, Mohit Sharma, Kartik Tyagi, Sandeep Warrier, Abhinav Manohar, Sharath BR, Darshan Nalkande, Jayant Yadav, Joshua Little, Ravisrinivasan Sai Kishore, Spencer Johnson, Azmatullah Omarzai, Manav Suthar, Sushant Mishra, Vijay Shankar, Kane Williamson, Wriddhiman Saha</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715525466903,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715525466913,
    "commText": "<p><b>Preview</b> by <b>Vijay Tagore</b> \\n \\n\"I have seen miracles happen with this team in the past couple of years and we all do believe in that,\" remarked Shubman Gill following an imperious victory against the Chennai Super Kings. Echoing this sentiment, Umesh Yadav said on Sunday, the eve of GT's clash against KKR: \"Just as Gill mentioned, miracles can happen and we will give our best to win both our remaining games.\" \\n \\nThe previous encounter between the sides at the Narendra Modi Stadium witnessed a feat which was nothing short of a cricketing spectacle, albeit with the tables turned. Rinku Singh had sensationally smashed five sixes off the final five deliveries to lead KKR to an improbable victory . Therefore, the Titans are justified in hoping for a similarly unexpected turn of events. \"Definitely, there are many possibilities. Our plan is to play our best and win both games. If we win with good margins, you never know,\" Umesh remarked. \\n \\nWith the prospect of a team qualifying for the playoffs with 14 points still a realistic possibility, the Titans, who can achieve a maximum of 14 points, find themselves in contention. Undoubtedly, they require a stroke of luck from elsewhere so that the outcomes of other matches align in their favour. KKR have already qualified but this match presents the opportunity to add two more points and strengthen their chances of finishing in the top-two spots. \\n \\nHead to head, the Titans enjoy an edge, having won one more than the Knight Riders but the Kolkata side has been one of the surprise packages of the season. \"I never expected KKR to be the first team to qualify for the last 4. I thought Mumbai Indians or Chennai Super Kings would be the sides to achieve that,\" Ambati Rayudu said on air after the Shreyas Iyer team beat Mumbai Indians on Saturday night. \\n \\nThe Knight Riders' commanding showing has largely been due to their free-flowing, stroke-making openers - Sunil Narine and Phil Salt - and their two spinners - Narine and Varun Chakaravarthy. More authentically, five of their bowlers - Chakaravarthy (18), Harshit Rana (16), Narine (15), Andre Russell (15) and Mitchell Starc (12) - have more than 12 wickets, the only side to have such a consistent bowling line-up. \\n \\nThe Titans have suddenly found their mojo, after a period of lull. The captain and fellow opener, Sai Sudarshan, are in good nick and most importantly, Mohit Sharma, their dependable pacer, is back in form. And above all, they have two world class spinners in Rashid Khan and Noor Ahmed. Expect a tight contest between the in-form side and a resurgent team. \\n \\n<b>When: </b>Gujarat Titans vs Kolkata Knight Riders, IPL 2024, May 13, 19:30 IST \\n \\n<b>Where: </b>Narendra Modi Stadium, Ahmedabad \\n \\n<b>What to expect: </b>Captain winning the toss may prefer to bowl first but the Titans have been quite inconsistent on their home ground this season. With the pitch expected to assist the batters, it should be a high scoring game unless of course, one of the world class spinners among the Titans or the KKR thinks otherwise. \\n \\n<b>Head to Head: </b>GT 2 - 1 KKR. The last game between the sides was won miraculously by the Knight Riders with Rinku Singh doing the star-turn. \\n \\n<b>Team Watch</b> \\n \\n<b>Gujarat Titans</b> \\n \\n<b>Injury and availability: </b>There are no injury concerns for the Titans. \\n \\n<b>Tactics and Match-up: </b>David Miller will be key for the hosts in the middle and death overs when he goes up against Sunil Narine [51 runs in 37 balls and 0 dismissals] and Andre Russell [24 off 11 balls, no dismissals]. \\n \\n<b>Probable XI: </b>Shubman Gill (c), Sai Sudharsan, Shahrukh Khan, David Miller, Matthew Wade (wk), Rahul Tewatia, Rashid Khan, Noor Ahmad, Umesh Yadav, Mohit Sharma, Kartik Tyagi. \\n \\n<b>Kolkata Knight Riders</b> \\n \\n<b>Injury and Availability: </b>No injury worries for the Knight Riders. \\n \\n<b>Tactics and Match-up: </b>Gill is usually at his best in Ahmedabad and matches up well against most KKR bowlers... except Sunil Narine [13 Runs | 12 Balls | 2 Wickets]. An early shift for the West Indies could be in the offing to offset the GT captain, who arrives fresh from a 50-ball century. \\n \\n<b>Probable XI: </b>Philip Salt (wk), Sunil Narine, Venkatesh Iyer, Shreyas Iyer (c), Rinku Singh, Nitish Rana, Andre Russell, Ramandeep Singh , Mitchell Starc, Harshit Rana, Varun Chakaravarthy \\n \\n<b>Did you know: </b> \\n \\n- Shubman Gill has scored 4 centuries and 4 50-plus scores in 16 T20 innings in Ahmedabad \\n \\n- KKR have picked 33 wickets through spin - the most for a team this season \\n \\n<b>What they said: </b> \\n \\n\"There are not many variations to be played in the IPL. Be it Test cricket, ODIs or T20s, the length for a new ball has always been the same. If you don't bowl at the right length, then there will be problems.\" - <b>Umesh Yadav</b> on the importance of length in T20s \\n \\n\"Tactically we are similar, but technically we are slightly different.\" - <b>Varun Chakaravarthy</b> on a comparison between him and <b>Sunil Narine</b>.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715605243205,
    "commText": "<p><b>6.30pm local:</b> Hello and welcome to our coverage of Match 63 with GT taking on table-toppers KKR. A win here will confirm a top-two finish for Shreyas Iyer's side who have been flying high in the tournament. Thanks to some great depth in the batting along with a diverse bowling attack with five of their bowlers having picked more than 12 wickets, they've won nine of the 12 matches played so far. Titans, on the other hand, have won just five games, and the maximum they can reach is seven - which is likely not going to be enough given their poor NRR. There has been some rain in Ahmedabad today. Let's hope it clears up in time.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715605808414,
    "commText": "<p>Varun Chakaravarthy didn't have a great start to the season, but is hitting his best form at the right time. All the focus has been on the all-round exploits of Sunil Narine, and rightly so, but Chakaravarthy has quietly moved up to 18 wickets for the season and is third on the list for the purple cap. His pairing with Narine has made life difficult for many oppositions in the middle overs. In contrast, Rashid Khan and Noor Ahmad haven't quite delivered in the same way for Gujarat Titans. Returning from injury, Rashid has had one of his worst IPL seasons so far which has been a major factor in Gujarat's struggles. To make things worse, even Mohit Sharma is going at close to 11 an over this season. What was one of the best bowling attacks in the IPL since their inception, they haven't clicked at all in the third year.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715606588905,
    "commText": "<p><b>6.55pm local:</b> Oops, the toss has been delayed in Ahmedabad. Don't think it's raining right now, but the main cover is on and there is some lightning around.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715607542043,
    "commText": "<p><b>7.10pm local:</b> Covers are coming off.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715608036930,
    "commText": "<p><b>Player availability updates:</b> Jos Buttler has left the Rajasthan Royals camp, and will be joined by Will Jacks and Reece Topley as the England players start returning home ahead of the T20 World Cup. KKR will soon lose Phil Salt for the same reason.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715608896597,
    "commText": "<p><b>7.30pm local:</b> The square is under covers once again. The wait continues.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609004564,
    "commText": "<p><b>Phil Salt:</b> (On finishing in top 2) It is big for us. Chat before the game today was about not letting up, turn up with the right attitude. GG (Gautam Gambhir) has been pretty solid with how he wants us to play as a team. He stressed on us to come here and still look for two points. (On comparisons with Chris Lynn) I’ve got a bit more lean muscle than him. When you come into a new team, you want to come in and do well. Lynn did it for a few years here, but for me it has been more about myself and how I can better my abilities. (On IPL experience) Lots of different surfaces in India. But it doesn’t vary too much really. I’ve been going about it at Eden Gardens but we’ve got some good wickets away as well, it is just about assessing and adapting on the day. (On the KKR team) Our point of difference is we’ve got Sunny (Narine). He’s like playing with 13 players with his skill with bat and ball. So that really frees the rest of us to play the way we want to. Sunny is very chill, as am I in the middle. We know what we do well and we remind each other of that. Hopefully we can keep it going. (On Gujarat) They are a good side, not to be taken lightly. We know they are a top side with some quality players.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609013755,
    "commText": "<p><b>Matthew Wade:</b> Not a change of approach, if we did what we did with the bat in the last game, it’ll give us a chance to improve our NRR. We’ve had such a successful couple of years, it’s been good to see how the team evolves in challenging situations. In other environments you may see teams drop off but we’ve certainly got a fighting spirit. We’ve got a blueprint of how we want to go about it but we just haven’t been able to hit all our markers. It’s amazing to have my family here for the last two weeks. (On combating KKR’s spinners) Our ground has different dimensions, shorter straight and longer square boundaries, we can pick up our twos. Bit different to other teams where they just attack, guys like Sai and Gill pick up their twos and get the boundaries when we need them. We have some left-handers in our line-up so that’s something different as well. We feel like we’ve got the resources to combat them.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609311098,
    "commText": "<p><b>7.40pm local:</b> The floodlights have only partially been switched on. Covers remain firmly placed on the square.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715609311109,
    "commText": "<p>****</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715610518284,
    "commText": "<p><b>7:58 PM Local Time:</b> The rain has picked up and the covers are firmly in place. Seems like a heavy downpour which will significantly delay the start time of this clash. The waiting game continues.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715611530660,
    "commText": "<p><b>8:15 PM Local Time:</b> No real respite from the rains. It continues to pour and the fans are taking cover under the roof. We're surely not getting a full game now, and if this downpour continues, we might have our first washout in IPL 2024. This is bad news for the hosts who can at max reach 13 points then and <b>will be eliminated today itself</b> if the game ends up in a washout. KKR are sitting pretty at the top and shared points today will only solidify a top 2 finish for them.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715611807694,
    "commText": "<p><b>8:22 PM Local Time:</b> Good news, the rain has subsided now. The pitch is still under covers and has been well covered, but the outfield would have taken a beating. No signs of a pitch inspection or a start time yet.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715612477454,
    "commText": "<p><b>20:31 Local Time, 15:01 GMT, 20:31 IST:</b> Well, there's still a steady drizzle and the main cover is still on. The umpires can be seen around having a chat with the groundstaff while a super-sopper does rounds around the ground. Looks like it'll still be a while before we can get started. Reminder that the<b> cut-off time for a 5 over contest is 10:56pm</b>, so lots of time left</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715613006692,
    "commText": "<p><b>20:40 Local Time, 15:10 GMT, 20:40 IST:</b> Just hearing that it has started to rain again.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715614267273,
    "commText": "<p><b>21:01 Local Time, 15:31 GMT, 21:01 IST:</b> Not much seems to have changed at the ground. The big cover is still on. Can see some puddles at the edge of the covers as well, this will take some time to clean up even after the drizzle stops. In the meantime, send in your thoughts through the I0$ feature available on our desktop site. What teams do you think will make it through to the playoffs?</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715615125880,
    "commText": "<p><b>21:15 Local Time, 15:45 GMT, 21:15 IST:</b> \"Drizzle has become stronger. Chances of a game look bleak\" reports Vijay Tagore who's at the venue.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715616069692,
    "commText": "<p><b>21:31 Local Time, 16:01 GMT, 21:31 IST:</b> Nothing positive to report on I'm afraid. Pictures from the ground show that the rain has intensified once more. Lots of people still waiting around in the stands but the chances of a game happening are growing slimmer by the minute.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715617792518,
    "commText": "<p><b>9.55pm local:</b> It's still raining. Not much time left now for groundstaff to work with. They need at least 30-40 minutes to get the ground ready once it stops raining, and cutoff is at 10.56pm.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715618089198,
    "commText": "<p><b>10.10pm local:</b> Gill and Nehra are walking out to have a chat with the officials. Shreyas Iyer is out there as well. No umbrellas at the moment, so looks like the drizzle has faded to a great extent.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715618929171,
    "commText": "<p><b>10.20pm local:</b> Plenty of discussions happening in the middle. No official word yet. Can still see some rain falling on the covers so it shouldn't be too long before we get a confirmation.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715619136797,
    "commText": "<p><b>10.22pm local:</b> Wow the covers are being taken off quite frantically by the groundstaff. Gill seems to have changed into his match shirt and the super sopper is spurred into action. There is still a slight drizzle but the groundstaff are trying their best.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715619655856,
    "commText": "<p><b>10.30pm local:</b> Pitch cover has also come off, and Nehra and Gill are having a look. Are they trying to get a game in despite the drizzle? KKR players seem a bit puzzled. All players, officials, groundstaff are out there and there are plenty of discussions still happening.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715620000426,
    "commText": "<p><b>10.36pm local:</b> So everything that went on in the last 10 minutes has amounted to nothing. <b>Match has been called off.</b> Gujarat Titans are officially out of the tournament, while a top-two finish is confirmed for KKR. The two captains exchange ribbons as part of Titans' breast cancer awareness initiative, and follow it up with handshakes.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715620000436,
    "commText": "<p>- KKR confirmed the place in Qualifier 1 and GT has been eliminated from the playoffs race. \\n \\n- The last two times when KKR finished in the top two in the points table, they won the IPL trophy (2012 & 2014).</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715620256574,
    "commText": "<p>Fireworks are going off in the sky as this marks the end of Titans home leg, and the players are taking a lap around the ground to thank the crowd. Despite the rain, plenty of fans have stuck around in the hope of getting a game, but that's not happening. A disappointing season overall for Gujarat Titans. After winning the title in their maiden season, and finishing runner-ups in the second, they've just not clicked this time around. KKR, meanwhile, have booked their place in the first Qualifier. That's all from us here. Until tomorrow, it's goodbye.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]