[
  {
    "timestamp": 1715437593439,
    "commText": "<p><b>Delhi Capitals</b> Squad: Jake Fraser-McGurk, Abishek Porel, Shai Hope(w), Tristan Stubbs, Gulbadin Naib, Axar Patel(c), Kuldeep Yadav, Mukesh Kumar, Ishant Sharma, Khaleel Ahmed, Rasikh Dar Salam, Kumar Kushagra, Praveen Dubey, Sumit Kumar, Lalit Yadav, Prithvi Shaw, Lizaad Williams, David Warner, Ricky Bhui, Jhye Richardson, Anrich Nortje, Yash Dhull, Vicky Ostwal, Swastik Chikara</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715437699013,
    "commText": "<p><b>Royal Challengers Bengaluru</b> Squad: Faf du Plessis(c), Virat Kohli, Will Jacks, Rajat Patidar, Cameron Green, Mahipal Lomror, Dinesh Karthik(w), Swapnil Singh, Karn Sharma, Mohammed Siraj, Lockie Ferguson, Yash Dayal, Anuj Rawat, Suyash Prabhudessai, Vijaykumar Vyshak, Mayank Dagar, Glenn Maxwell, Akash Deep, Reece Topley, Tom Curran, Alzarri Joseph, Manoj Bhandage, Saurav Chauhan, Rajan Kumar, Himanshu Sharma</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715437700500,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715437700510,
    "commText": "<p><b>Preview</b> by <b>Ganesh Chandrasekaran</b> \\n \\nIf the points table was the only indicator then the clash between two middling sides would promise only a lukewarm battle. However, their recent form paints a completely different story. Delhi Capitals have won three of their last four games. They've found some much-needed impetus through the record-breaking Jake Fraser-McGurk mainly with the likes of Rishabh Pant and Abishek Porel making useful contributions to shore up the batting order. It has allowed their bowlers to create a bigger impact overall, keeping them alive in the race for playoffs. \\n \\nThe scenario is not too different for RCB who come into this match with four wins on the trot. That too has been in part due to a batting revolution. The introduction of Will Jacks, the reinvention of sorts for Virat Kohli as a spin-hitter and timely cameos from the lower-order has given their batting unit a formidable face. It has allowed them to bring in a India-heavy bowling unit that has so far stood up to the task. \\n \\nIt sets up Sunday's clash on a relatively even-scale although Delhi will be hampered by the ban imposed on their skipper Rishabh Pant. Delhi Capitals have confirmed that Axar Patel will be leading in Pant's absence which would make room for an Indian middle-order batter to walk into the line-up. David Warner's availability is subject to how he'd pull through in the practice sessions and Delhi would be gunning to cover all their bases well to not lose out on the momentum built up. \\n \\nThe high stakes, however, could be dampened if rain plays spoilsport. It would mean that an already convoluted race of making it to the playoffs will have an additional metric thrown into the works. Delhi might still have a chance in case of a washout, but RCB would stand eliminated if there is a no result. \\n \\n<b>When:</b> Royal Challengers Bengaluru vs Delhi Capitals, May 12, 2024 at 19:30 IST \\n \\n<b>Where:</b> M Chinnaswamy Stadium, Bengaluru \\n \\n<b>What to expect:</b> The city has seen showers in the days leading up to the fixture which could once again play a part on the match day. Traditionally the ground has seen high scores come at great frequency given the boundary sizes but the effects of rain could play a vital factor. \\n \\n<b>Head to head:</b> RCB 18 - 11 DC \\n \\n<b>Teams Royal Challengers Bengaluru</b> \\n \\n<b>Injuries/unavailability:</b> No reported worries for RCB. \\n \\n<b>Tactics & Match-ups:</b> While Delhi's spin duo of Kuldeep Yadav and Axar Patel have been outstanding so far in the season, their pace front has cut a sorry figure with Khaleel Ahmed's E/R of 9.68 being the best. It offers a chance for RCB to target the bowlers based on form on a ground with small boundaries. On the bowling front, Karn Sharma could be at the center of bowling plans to the likes of Tristan Stubbs and Jake-Fraser McGurk who have been dismissed five times combined against legspin in IPL 2024 despite having high strike-rates against this kind of bowling. \\n \\n<b>Probable XI:</b> Faf du Plessis, Virat Kohli, Will Jacks, Rajat Patidar, Cameron Green, Dinesh Karthik, Swapnil Singh, Karn Sharma, Mohammad Siraj, Lockie Ferguson, Yash Dayal [Impact Sub: Mahipal Lomror] \\n \\n<b>Delhi Capitals</b> \\n \\n<b>Injuries/Availability:</b> The absence of Rishabh Pant will force DC to make changes. The chances of Prithvi Shaw replacing him as an Indian batter is an option while they could also try to fit in David Warner [injury permitting] to get some experience in the absence of Pant. Head coach Ricky Ponting also floated the idea of fielding Jhye Richardson as an option upfront to counter RCB's top-order. \\n \\n<b>Tactics & Match-ups:</b> The introduction of Axar Patel in the powerplay is a possibility given the match-up option he offers against RCB's openers Faf du Plessis and Virat Kohli who both have a strike-rate hovering around just 110 against the spinner. The latter though has shown marked improvement in spin hitting but it's a gamble that DC might take. On the bowling front, there could be a ploy to exploit Rajat Patidar's seeming weakness against pace having been dimissed 8 times against their kind, with four of them being against left-arm pace. \\n \\n<b>Probable XI:</b> Jake Fraser-McGurk, Prithvi Shaw, Abishek Porel, David Warner/Shai Hope, Tristan Stubbs, Gulbadin Naib/Jhye Richardson, Axar Patel, Rasikh Salam, Kuldeep Yadav, Mukesh Kumar, Khaleel Ahmed [Impact Sub: Ishant Sharma] \\n \\n<b>Did you know:</b> \\n \\n-Mohammad Siraj has dismissed Rishabh Pant four times in all T20s \\n \\n- Virat Kohli has hit 15 fours and 13 sixes against spin in IPL 2024 \\n \\n- RCB are one of the two teams (Punjab Kings being the other) to have lost more than they've won at their home venue in IPL 2024 \\n \\n<b>What they said</b> \\n \\n\"As a team we've known for about six-seven games that he's been on two strikes so there was a chance. We could have actually stood him down as a captain to potentially stop this happening. But at the end of the day, like it or not, it's the captain's responsibility for the time that's taken on the field. He doesn't have full control over everything. Circumstantailly, he was a little unlucky in the last game. Going into Khaleel's last over, the over where he bowled four wides in, at that stage we were only three minutes behind. If Khaleel had bowled a regulation over there without the extra balls and then Kuldeep comes in next over and got a wicket like he did, we would have got all that time back. So the fact that Khaleel's over went for nine minutes and in that stage of the game, there's no way we can drag it back. - <b>Ricky Ponting</b> on <b>Rishabh Pant</b> missing out.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715437700530,
    "commText": "<p>***</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715517151060,
    "commText": "<p><b>6.15pm local:</b> Hello and welcome to what is a virtual knockout as RCB take on DC at the Chinnaswamy. Both these teams started poorly in the tournament, but have been resurgent in the second half to somehow keep themselves in the race for the playoffs. However, it'll be the end of the road for the loser here. There has been some rain in Bangalore today. Let's hope we get a full game.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715518354932,
    "commText": "<p>The inclusion of Jake Fraser-McGurk has served as a catalyst to turn things around for DC. He has set the stage on fire at the top with four blistering fifties in just 7 innings, and will once again be the focus of attention in a batting lineup that's going to be without Rishabh Pant who is serving a one-game suspension for slow over-rate. Among the bowlers, Axar Patel has stood out and is going at an economy rate of just 7.32 this season. The rest of them have also pulled their weight since DC went in the direction of an all-India attack in order to accommodate an extra overseas batter.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715519039080,
    "commText": "<p>RCB are on a four-match winning streak with things starting to finally click with both bat and ball. Kohli has been batting beautifully, and has taken the attack to the spinners in the last few games. Faf, Patidar and Jacks have also made big contributions here and there, while Siraj has found his rhythm again with the ball. They've used their spinners much better as well. Should be a good contest between two in-form teams.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715519993561,
    "commText": "<p><b>Pitch report:</b> \"The overhead conditions are a bit cloudy. Pitch no.8 today, there was a 182 that was chased down earlier then there was 287 and the last game was 147 which was chased down comfortably. There was a lot of live grass in the middle with the ends being dry. The grass has now been shaved off, this is now very dry and extremely hard. No grass to speak of. This venue has been unpredictable, could be a score in the high 190s, should be good for batting. There probably won't be any dew as well tonight\" say Ian Bishop and Matthew Hayden.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715520513264,
    "commText": "<p><b>Will Jacks:</b> Looking forward to this game. It's amazing, it's unbelievably loud, especially when Virat is at the other end. We're lucky to have this as our home ground. It's been a bit up or down, I just need to get past 10 balls and hopefully I'll get a big score. Hopefully we can tick off another win. People dream of batting with him (Virat) in a chase, he's the master-chaser and he was talking me through it step by step and I think that's what experienced guys do. It's (aggression) a tight line, especially if I come in in the 4th or 5th over where I want to take advantage of the remaining powerplay. On occasion I might have gone too far over the line but that's something I've been learning. We've been winning the last few games so that's helped me out.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715520513274,
    "commText": "<p><b>Delhi Capitals have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715520637751,
    "commText": "<p><b>Axar:</b> Will bowl first. Bangalore wicket is always good. It's a chasing ground. When we start well, we dominate the game. Rishabh was angry, and had appealed as well against the suspension. He's at the ground here, motivating the team. Kushagra comes in for Rishabh. Rasikh Dhar is in.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715520750729,
    "commText": "<p><b>Faf:</b> Little bit less grass than earlier games. Hopefully it's a good wicket. We look forward to every game now - we're playing some good cricket. Have to start again. We have got more of that confidence in the dressing room. Same team for us.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715521025266,
    "commText": "<p><b>Delhi Capitals</b> (Playing XI): Jake Fraser-McGurk, Abishek Porel(w), Shai Hope, Kumar Kushagra, Tristan Stubbs, Axar Patel(c), Kuldeep Yadav, Rasikh Dar Salam, Mukesh Kumar, Ishant Sharma, Khaleel Ahmed</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715521087444,
    "commText": "<p><b>Royal Challengers Bengaluru</b> (Playing XI): Faf du Plessis(c), Virat Kohli, Will Jacks, Rajat Patidar, Cameron Green, Mahipal Lomror, Dinesh Karthik(w), Karn Sharma, Mohammed Siraj, Lockie Ferguson, Yash Dayal</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715521092305,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715521115305,
    "commText": "<p><b>Royal Challengers Bengaluru Impact Subs:</b> Swapnil Singh, Anuj Rawat, Suyash Prabhudessai, Vyshak Vijaykumar, Himanshu Sharma</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715521154106,
    "commText": "<p><b>Delhi Capitals Impact Subs:</b> David Warner, Sumit Kumar, Ricky Bhui, Vicky Ostwal, Pravin Dubey</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715521480330,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  },
  {
    "timestamp": 1715522299124,
    "commText": "<p>Players are taking the field and the crowd roars as Kohli and Faf walk out. Kohli has been on fire at the top of the order. He's on strike, facing up to Ishant. One slip in place. Fine leg and third are in the ring</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    }
  }
]