[
  {
    "timestamp": 1711549001971,
    "commText": "<p><b>Delhi Capitals</b> Squad: David Warner, Mitchell Marsh, Shai Hope, Rishabh Pant(w/c), Ricky Bhui, Tristan Stubbs, Axar Patel, Sumit Kumar, Abishek Porel, Kuldeep Yadav, Khaleel Ahmed, Ishant Sharma, Mukesh Kumar, Jake Fraser-McGurk, Vicky Ostwal, Praveen Dubey, Jhye Richardson, Anrich Nortje, Prithvi Shaw, Lalit Yadav, Rasikh Dar Salam, Kumar Kushagra, Yash Dhull, Swastik Chikara</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711549105072,
    "commText": "<p><b>Rajasthan Royals</b> Squad: Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Riyan Parag, Shimron Hetmyer, Dhruv Jurel, Ravichandran Ashwin, Sandeep Sharma, Avesh Khan, Trent Boult, Yuzvendra Chahal, Nandre Burger, Rovman Powell, Tanush Kotian, Shubham Dubey, Kuldeep Sen, Navdeep Saini, Tom Kohler-Cadmore, Prasidh Krishna, Donovan Ferreira, Abid Mushtaq, Kunal Singh Rathore</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711549106795,
    "commText": "<p><b>Squads:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711549106805,
    "commText": "<p><b>Preview</b> by <b>Aayush Puthran</b> \\n \\nAlthough it's been two days since Holi, the 'organic' gulaalcolour hasn't completely left the skin of the Rajasthan Royals players as yet. In the Pink City, they are literally wearing the colour of their franchise on their bodies. An unintentional branding exercise. \\n \\nFor Delhi Capitals, it's not their jersey colour that's attracting as much attention as the return of their captain, Rishabh Pant. Batting, handling 'keeping duties and leading the side on his return to competitive cricket after a year and a half, he is expected to be their messiah following their disappointing run last season in his absence. \\n \\nHe enjoys facing Royals, a team against whom he has had tremendous success in the past. But is there enough in Pant to cover up for all of DC's inadequacies? \\n \\nIf the dominance of 2020 and 2021 promised DC the elusive trophy in the near future, the performances of the last two seasons have witnessed a freefall. They have lost 10 of their last 15 games, and are plagued by injuries, unavailability and indifferent form, despite several experiments, the team management are far from finding a fix. \\n \\nPant's absence may have been a key missing link in DC's fragile middle-order last season, but it seems to be just as vulnerable right now. With their insistence on retaining the opening Australian combination of David Warner and Mitchell Marsh, their middle order continues to wear a thin look. Abhishek Porel's explosive innings in the previous game would have given them some reasons to be delighted, but the burden on him along with Ricky Bhui, Axar Patel and Sumit Kumar is way too much to marshall the middle and lower-middle order with only a returning Rishabh Pant and yet-to-fire Tristan Stubbs. \\n \\nThe bowling pack is ready, believes team mentor Sourav Ganguly. It's on the batters to pick themselves up. The challenge, unfortunately, resumes against the potent, varied and experienced bowling attack of Royals in Jaipur. The good news for DC though is that the current lot of Royals players, despite the victory in the previous game, haven't fully aced the conditions of the tricky pitch at the Sawai Mansingh Stadium. \\n \\n<b>Head to head:</b> \\n \\n<b>When:</b> Thursday, March 28, 2023, 7:30 PM IST \\n \\n<b>Where:</b> Rajasthan Royals vs Delhi Capitals, Match 9, IPL 2024, Sawai Mansingh Stadium, Jaipur \\n \\n<b>What to expect:</b> While the ball kept low at times in the second innings, it was largely an easy-playing surface throughout the opening game. While it's the first evening game of Jaipur this season, dew isn't expected to be much of a factor so early in the tournament. The pitch has shown signs of being tricky at times and players might need to adjust on the go. \\n \\n<b>Team Watch:</b> \\n \\n<b>Rajasthan Royals:</b> \\n \\n<b>Injuries and availability:</b> All players are available for the contest \\n \\n<b>Tactics & Matchups:</b> While the hosts may not want to fiddle with their combination, their Impact Substitute strategy hangs delicately based on the toss as well as the match situation, allowing them the opportunity to choose between Rovman Powell and Nadre Burger as the fourth overseas player. While they might wait a bit longer on Shimron Hetmyer to regain his form, there is an opportunity to go for Powell ahead of the hard-hitting southpaw. \\n \\n<b>Probable XII:</b> Yashasvi Jaiswal, Jos Buttler, Sanju Samson, Riyan Parag, Shimron Hetmyer, Dhruv Jurel, Rovman Powell/Nandre Burger, R Ashwin, Avesh Khan, Trent Boult, Sandeep Sharma, Yuzvendra Chahal. \\n \\n<b>Delhi Capitals:</b> \\n \\n<b>Injuries/availability:</b> Anrich Nortje has joined the squad after missing out the previous game due to personal reasons. Ishant Sharma and Mukesh Kumar have also recovered an are available for the game. \\n \\n<b>Tactics & Matchups:</b> For as much as Sanju Samson has attacked left-arm spinners in the last three seasons of the IPL, he has struggled to score at a pace that he usually likes against Axar Patel and Kuldeep Yadav. The DC spin duo will be expected to cage Samson's strokeplay through the middle overs yet again. \\n \\n<b>Probable XII:</b> David Warner, Mitchell Marsh, Abhishek Porel, Ricky Bhui, Rishabh Pant, Tristan Stubbs, Axar Patel, Sumit Kumar/Kumar Kushagra, Anrich Nortje, Kuldeep Yadav, Khaleel Ahmed, Ishant Sharma \\n \\n<b>Did you know?</b> \\n \\nRiyan Parag has scored only 75 runs in 7 innings against Delhi Capitals, at a strike rate of 91.46. With a promotion to No 4 in the batting order, he would look to fix that record. \\n \\nRishabh Pant has smashed four 50s in 9 innings against Rajasthan Royals, that too at a strike rate of 170. \\n \\n<b>What they said:</b> \\n \\nWe decided on (Mitchell) Marsh and (David) Warner to open. Ricky Bhui is a middle order batsman. They bat in different positions. It's not (Ricky) Bhui for (Prithvi) Shaw but it's a different opening combination. They opened for Australia at the top and have done well together, so we decided to open with them - <b>Sourav Ganguly</b> on Delhi Capitals not picking Prithvi Shaw in the opening game. \\n \\nWe haven't played a lot at SMS over the last few years. We came back last year and I don't think we were as in-tune with the changes we had to make to our mindset and to our games to play on this track. The pitches have been relaid, the top soil. It's just a case of adjusting your mindset over what's presented, going with the gameplan and then trust to doing the hard work that's required on this pitch. It's not always a straightforward pitch and the players are more ready for that this year, hopefully - <b>Kumar Sangakkara</b> on the reason for Rajasthan Royals' sub-par record in Jaipur last season.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711629901434,
    "commText": "<p><b>18:15 Local Time, 12:45 GMT, 18:15 IST:</b> Delhi Capitals welcomed back Rishabh Pant to their set-up in their first match of the season against Punjab Kings, but nothing else went right for them on Millanpur as they crashed to an easy defeat. They were already without Anrich Nortje, a batting failure forced them to ditch Mukesh Kumar, who was their expected impact substitute. To add to their woes, Ishant Sharma limped out early into his spell and the absence of quality bowlers clearly told. But they have had a decent break and should be raring to go against the high flying Rajasthan Royals. Sanju Samson's team played almost the perfect game to beat Lucknow Super Giants in their first game and have emerged as the early contenders to beat. The franchise has looked well settled and have plenty of options amongst the bench - On paper, they look exceptionally strong and will back themselves to make it two wins at home.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711631038563,
    "commText": "<p>It's a fresh surface tonight. 67m square boundaries on both sides and a 76m straight boundary. We're playing on pitch number 5 today, it is absolutely rock hard, but there are some cracks which move as you press. It means that the bounce could be low with the new ball, it means the tactics could be similar to that of the last game. It wouldn't be surprising that the Royals could be wanting to bat first again today, reckon <b>Simon Katich and Samuel Badree</b>, in their pitch report</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711631520865,
    "commText": "<p><b>Nandre Burger</b> - It is always good to start the tournament with a win, especially at home. The crowd has been great and the mood in the team is really good. Major part is field placings, the ball is hit to different parts here (in India), so you need to adjust more tactically rather than technically. It's pretty chilled, everyone knows what they're expected to do, it's a great atmosphere (in the team)</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711631771584,
    "commText": "<p><b>Kuldeep Yadav</b> - Nothing like that (on suddenly becoming a star player), I would love to play all three formats though. I don't think a lot, I've always been very relaxed, I've matured with age (now 29), there are plenty of good people around me and that helps me. It's a team game, you need to perform together. Ishant's injury did cost us (in the last game), we couldn't get our combination right, but everyone is fit now and we're raring to go. It's important to have a collective effort, at times we need to lift individual performances - with the bat, someone who has got a start has to go on, same with the bowlers as well.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632641271,
    "commText": "<p><b>Delhi Capitals have won the toss and have opted to field</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632806110,
    "commText": "<p><b>Rishabh Pant</b>- We'll bowl first. The wicket looks fine and we want to use it, there might be some dew in the 2nd innings. Feels good to play 100 matches for the same franchise, but every game is important for me. Most of the concerns are regarding injury, but these are things you can't control. Two changes for us - Ishant hasn't recovered, Shai Hope has a back spasm. Anrich Nortje and Mukesh Kumar come in.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632837823,
    "commText": "<p><b>Sanju Samson</b> - We would have bowled first, dew could come in the second innings. Both pitches have an even covering of grass, but the last match was an afternoon game. All the 10 teams are geared up and prepared well, we just need to follow the process and not think too much, then we will be fine. Same team for us.</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632903575,
    "commText": "<p><b>Rajasthan Royals</b> (Playing XI): Yashasvi Jaiswal, Jos Buttler, Sanju Samson(w/c), Riyan Parag, Shimron Hetmyer, Dhruv Jurel, Ravichandran Ashwin, Trent Boult, Yuzvendra Chahal, Sandeep Sharma, Avesh Khan</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632961664,
    "commText": "<p><b>Delhi Capitals</b> (Playing XI): David Warner, Mitchell Marsh, Ricky Bhui, Rishabh Pant(w/c), Tristan Stubbs, Axar Patel, Sumit Kumar, Kuldeep Yadav, Anrich Nortje, Khaleel Ahmed, Mukesh Kumar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632963229,
    "commText": "<p><b>Teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632963239,
    "commText": "<p><b>First to play 100 IPL matches for a team:</b> \\nCSK - Suresh Raina \\nMI - Harbhajan Singh \\nRCB - Virat Kohli \\nKKR - Gautam Gambhir \\nRR - Ajinkya Rahane \\nSRH - Bhuvneshwar \\nDC - Rishabh Pant** \\n- No one played 100 games for PBKS yet</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711632963249,
    "commText": "<p><b>Most IPL matches for Delhi Capitals:</b> \\n100 - Rishabh Pant* \\n99 - Amit Mishra \\n87 - Shreyas Iyer \\n82 - David Warner \\n79 - Virender Sehwag</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711633073585,
    "commText": "<p><b>Rajasthan Royals Subs:</b> Rovman Powell, Nandre Burger, Tanush Kotian, Shubham Dubey, Kuldeep Sen</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711633356168,
    "commText": "<p><b>Delhi Capitals Subs:</b> Abhishek Porel, Jake Fraser-McGurk, Pravin Dubey, Kumar Kushgara, Rasikh Dar</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711633388081,
    "commText": "<p><b>Here are the Impact substitutes for both the teams:</b></p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711633454880,
    "commText": "<p>We've made no changes to our pre-toss team. Have a look at our expert XI before going ahead with your changes for tonight's fantasy game</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  },
  {
    "timestamp": 1711634193501,
    "commText": "<p>The players are out in the middle. Massive firepower at the top for RR with Jaiswal and Buttler - Pant got a signed DC shirt as he plays his 100th IPL game. DC will start with pace and it's Khaleel Ahmed, a slip in place</p>",
    "ballNbr": 0,
    "overs": 0,
    "events": [],
    "batsmanStriker": {
      "id": 0,
      "batRuns": 0,
      "ballsPlayed": 0,
      "dotBalls": 0,
      "batFours": 0,
      "batSixes": 0
    },
    "bowlerStriker": {
      "id": 0,
      "bowlOvers": 0,
      "bowlMaidens": 0,
      "bowlRuns": 0,
      "bowlWickets": 0,
      "bowlWides": 0,
      "bowlNoBalls": 0
    },
    "batTeamScore": 0
  }
]